{"metadata": {"url": "https://minecraft.fandom.com/wiki/Chunk_format/Entity", "title": "Chunk_format/Entity", "time": "17/04/2022 00:58:02"}, "tables": [], "images": [], "sprites": [{"text": null, "bbox": [223.046875, 446.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 544.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 642.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 715.6875, 16, 16]}, {"text": null, "bbox": [223.046875, 740.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 789.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 813.6875, 16, 16]}, {"text": null, "bbox": [223.046875, 838.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 862.6875, 16, 16]}, {"text": null, "bbox": [223.046875, 985.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 1009.6875, 16, 16]}, {"text": null, "bbox": [223.046875, 1034.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 1058.6875, 16, 16]}, {"text": null, "bbox": [244.046875, 1107.6875, 16, 16]}, {"text": null, "bbox": [223.046875, 1183.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 1232.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 1256.6875, 16, 16]}, {"text": null, "bbox": [244.046875, 1281.1875, 16, 16]}, {"text": null, "bbox": [244.046875, 1330.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 1379.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 1403.6875, 16, 16]}, {"text": null, "bbox": [223.046875, 1428.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 1526.1875, 16, 16]}], "texts": [{"text": "Chunk format/Entity", "bbox": [202.046875, 349.5, 593, 45]}, {"text": " Air: How much air the entity has, in ticks. Decreases by 1 per tick when unable to breathe (except suffocating in a block). Increase by 1 per tick when it can breathe. If -20 while still unable to breathe, the entity loses 1 health and its air is reset to 0. Most mobs can have a maximum of 300 in air, while dolphins can reach up to 4800, and axolotls have 6000.\n CustomName: The custom name JSON text component of this entity. Appears in player death messages and villager trading interfaces, as well as above the entity when the player's cursor is over it. May be empty or not exist. Cannot be removed using the data remove command,[1] but setting it to an empty string has the same effect.\n CustomNameVisible: 1 or 0 (true/false) - if true, and this entity has a custom name, the name always appears above the entity, regardless of where the cursor points. If the entity does not have a custom name, a default name is shown. May not exist.\n FallDistance: Distance the entity has fallen. Larger values cause more damage when the entity lands.\n Fire: Number of ticks until the fire is put out. Negative values reflect how long the entity can stand in fire before burning. Default -20 when not on fire.\n Glowing: 1 or 0 (true/false) - true if the entity has a glowing outline.\n HasVisualFire: 1 or 0 (true/false) - if true, the entity visually appears on fire, even if it is not actually on fire.\n id: String representation of the entity's ID. Does not exist for the Player entity.\n Invulnerable: 1 or 0 (true/false) - true if the entity should not take damage. This applies to living and nonliving entities alike: mobs should not take damage from any source (including potion effects), and cannot be moved by fishing rods, attacks, explosions, or projectiles, and objects such as vehicles and item frames cannot be destroyed unless their supports are removed. Invulnerable player entities are also ignored by any hostile mobs. Note that these entities can be damaged by players in Creative mode.\n Motion: 3 TAG_Doubles describing the current dX, dY and dZ velocity of the entity in meters per tick.\n NoGravity: 1 or 0 (true/false) - if true, the entity does not fall down naturally. Set to true by striders in lava.\n OnGround: 1 or 0 (true/false) - true if the entity is touching the ground.\n Passengers: The data of the entity(s) that is riding this entity. Note that both entities control movement and the topmost entity controls spawning conditions when created by a mob spawner.\n: The same as this format (recursive).\nTags common to all entities[show]\nTags unique to this passenger entity.\n PortalCooldown: The number of ticks before which the entity may be teleported back through a nether portal. Initially starts at 300 ticks (15 seconds) after teleportation and counts down to 0.\n Pos: 3 TAG_Doubles describing the current X, Y and Z position of the entity.\n Rotation: Two TAG_Floats representing rotation in degrees.\nThe entity's rotation clockwise around the Y axis (called yaw). Due south is 0. Does not exceed 360 degrees.\nThe entity's declination from the horizon (called pitch). Horizontal is 0. Positive values look downward. Does not exceed positive or negative 90 degrees.\n Silent: 1 or 0 (true/false) - if true, this entity is silenced. May not exist.\n Tags: List of scoreboard tags of this entity.\n TicksFrozen: Optional. How many ticks the entity has been freezing. Although this tag is defined for all entities, it is actually only used by mobs that are not in the freeze_immune_entity_types entity type tag. Ticks up by 1 every tick while in powder snow, up to a maximum of 300 (15 seconds), and ticks down by 2 while out of it.\n UUID: This entity's Universally Unique IDentifier. The 128-bit UUID is stored as four 32-bit integers, ordered from most to least significant.", "bbox": [202.046875, 443.1875, 726, 1129]}, {"text": "MC-128225", "bbox": [248.046875, 1581.1875, 73, 17]}]}