{"metadata": {"url": "https://minecraft.fandom.com/wiki/Minecraft:_The_Voyage/4CHP", "title": "Minecraft:_The_Voyage/4CHP", "time": "17/04/2022 04:00:13"}, "tables": [{"bbox": [202.046875, 793.015625, 279, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* The Champion at work\n* Lunch in luxurious surroundings\n* A warrior’s misgivings", "„"], "bboxes": [[204.046875, 795.015625, 27, 100], [233.140625, 795.015625, 217, 100], [452.140625, 795.015625, 27, 100]]}}, {"bbox": [202.046875, 1187.515625, 355, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* Stax discovers his own code\n* A return to a not particularly beloved house\n* Surprising news", "„"], "bboxes": [[204.046875, 1189.515625, 27, 100], [233.140625, 1189.515625, 293, 100], [528.140625, 1189.515625, 27, 100]]}}, {"bbox": [202.046875, 1582.015625, 370, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* A project for Osk\n* Surveying a caravan town\n* Directions are offered and promises are made", "„"], "bboxes": [[204.046875, 1584.015625, 27, 100], [233.140625, 1584.015625, 308, 100], [543.140625, 1584.015625, 27, 100]]}}, {"bbox": [202.046875, 2074.515625, 296, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* A country of legends\n* Into the caverns\n* An ignoble retreat and a noble end", "„"], "bboxes": [[204.046875, 2076.515625, 27, 100], [233.140625, 2076.515625, 234, 100], [469.140625, 2076.515625, 27, 100]]}}, {"bbox": [202.046875, 2591.515625, 269, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* A recollection of bygone perils\n* Morning visitors\n* A confession", "„"], "bboxes": [[204.046875, 2593.515625, 27, 100], [233.140625, 2593.515625, 207, 100], [442.140625, 2593.515625, 27, 100]]}}, {"bbox": [202.046875, 2961.515625, 294, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* The bandit king’s hideout\n* Hejira, preceded by his reputation\n* Fouge, at last", "„"], "bboxes": [[204.046875, 2963.515625, 27, 100], [233.140625, 2963.515625, 232, 100], [467.140625, 2963.515625, 27, 100]]}}, {"bbox": [202.046875, 3356.015625, 291, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* A long sought confrontation\n* Hunting for very specific treasure\n* A puzzle with maps", "„"], "bboxes": [[204.046875, 3358.015625, 27, 100], [233.140625, 3358.015625, 229, 100], [464.140625, 3358.015625, 27, 100]]}}, {"bbox": [202.046875, 3799.515625, 384, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* A tower revisited\n* A familiar peninsula, and a long-awaited reunion\n* The future, considered", "„"], "bboxes": [[204.046875, 3801.515625, 27, 100], [233.140625, 3801.515625, 322, 100], [557.140625, 3801.515625, 27, 100]]}}], "images": [], "sprites": [], "texts": [{"text": "Minecraft: The Voyage/4CHP", "bbox": [202.046875, 313, 593, 45]}, {"text": "Contents", "bbox": [215.046875, 442.25, 81, 17]}, {"text": "1 Chapter 25: The Champion, Revealed\n2 Chapter 26: Peril in Patannos\n3 Chapter 27: Encounter in Karahamés\n4 Chapter 28: The Mountain\n5 Chapter 29: Prisoners of Fouge Tempro\n6 Chapter 30: The Man in the Mountaintop Fortress\n7 Chapter 31: Duelists\n8 Chapter 32: Two Shores", "bbox": [203.046875, 475.515625, 363, 246]}, {"text": "Chapter 25: The Champion, Revealed", "bbox": [202.046875, 746.515625, 726, 23]}, {"text": "The man reveals himself to be Troyens, \"the Champion’s\" butler. He brings Stax to the back garden, where \"the Champion\" is snipping grass with shears. \"The Champion\", from this point forward, prefers to be called Abel. Stax and Abel proceed to have a light lunch in the dining room, not before giving Stax a tour of his estate. As they eat, Stax mentions the stories he heard about Abel in Tumbles Harbor, as well as explaining how he got to where he is now. Abel seems interested at first, but then mentions that he was ambushed on horseback by brigands the last time he left home, and because of that, he doesn’t help people anymore. Stax questions why, and Abel says that he can’t get rid of ugliness from the Overworld. The two argue for a bit, with Stax saying that stopping Fouge should be helping the people who have aided him, while Abel says that if Fouge is defeated, then nobody would thank him. Stax tries to explain that everyone would thank him, but Abel tells Stax to leave, in which he does.", "bbox": [202.046875, 896.515625, 726, 221]}, {"text": "Chapter 26: Peril in Patannos", "bbox": [202.046875, 1141.015625, 726, 22]}, {"text": "Heading back down the Graypeaks, Stax informs Hejira of Abel’s decision, and the two begin heading back to Tumbles Harbor. By sunset, they arrive back at the Endless Dunes. Hejira hears some noises, and upon climbing to a peak, notices a raid taking place in Patannos. After a brief discussion about Stax’s own \"code\", Stax and Hejira decide to thwart the raid. The two run over to Patannos and soon fight with the pillagers. Despite the arrival of reinforcements, Stax and Hejira eventually kill off the pillagers. The villagers of Patannos celebrate by giving them gifts as well as a feast, which lasts late into the night. By morning, Stax and Hejira leave and eventually arrive back at Stax’s plot of land, but soon notice Ramoa with a horse. They meet up with her, with Stax asking if she was supposed to be down in Karahamés with a caravan, and Ramoa mentions that she thinks she has found Fouge Tempro.", "bbox": [202.046875, 1291.015625, 726, 220]}, {"text": "Chapter 27: Encounter in Karahamés", "bbox": [202.046875, 1535.515625, 726, 23]}, {"text": "Ramoa mentions to Stax that she was in Karahamés with the caravan, and an innkeeper mentioned to her that Karahamés was overrun by bandits months ago, yet Miggs stayed behind, waiting for orders from Fouge. Ramoa also mentions that Karahamés is to the southeast, and without hesitation, Stax, Hejira, and Ramoa prepare to head there. The three head to Tumbles Harbor to buy horses from Brubbs and Xinxi. They also meet Osk, where Stax asks her to make some enchanted diamond armor and a diamond sword in exchange for a chest of redstone. She accepts, and soon Stax is fitted in said armor and sword. By night, Stax, Hejira, and Ramoa have Osk come along, noting her experience with redstone. Stax specifically asks her to bring every single bit of redstone she has. The four then ride by horse to Karahamés, making it there in about two days. At a local inn, the innkeeper says that Miggs isn’t expected to return until later that evening. That night, Miggs returns to the inn, immediately recognized by Stax because of his beard and a t-shirt that belonged to Stax: a yellow one with red dragons. Stax soon sits by him, and Miggs soon recognizes Stax, asking him if he’s here for revenge. Stax asks Miggs as to the whereabouts of Fouge Tempro. Miggs hesitates at first, but soon says that he’s at a fort atop a mountain to the east. He also, angrily, gives Stax the yellow shirt back, and leaves the inn.", "bbox": [202.046875, 1685.515625, 726, 319]}, {"text": "Chapter 28: The Mountain", "bbox": [202.046875, 2028.015625, 726, 22]}, {"text": "The next morning, Stax, Hejira, Ramoa, and Osk head toward the mountain. Stax soon questions as to why they are going to the mountain from Karahamés, and Hejira mentions that the Omphalos lie east of there. Ramoa clarifies that it means the origin point. Later on, they notice a wandering trader, who mentions that he was robbed, and that the robbers live to the east. Eventually, the four (Stax, Hejira, Ramoa, and Osk) find some ruins, in which Hejira suspects its connected to the Omphalos, and later, they notice the mountain, in which a fortress is atop it. The four split up to find an entrance, and eventually find a lone cave on the eastern side of the mountain. Entering it, they notice glass windows and a door, and then, four of the raiders, ready to attack. Stax, Hejira, Ramoa, and Osk kill them with ease and enter the fortress from the cavern. They fend off several raiders until they arrive at a cavern with a ceiling of sand. Going through it, more than a dozen raiders suddenly emerge from hiding in the mounds of sand, and the four have no choice but to fend them off as best they can. Stax is surprised to see Miggs leading the raiders. Hejira moves to one end of the group of raiders, splitting them off. Osk, who is too scared to fight, runs out of the cavern. Stax and Ramoa attempt to move ahead, but notice Hejira chopping the sand with his sword. They yell at him to stop, but by then, it was too late. The sand ceiling collapses, presumably killing Hejira. The group of a dozen raiders corner Stax and Ramoa, and they have no choice but to surrender.", "bbox": [202.046875, 2178.015625, 726, 343]}, {"text": "Chapter 29: Prisoners of Fouge Tempro", "bbox": [202.046875, 2545.015625, 726, 22]}, {"text": "Stax and Ramoa are put into a jail cell. Stax is stripped of his diamond armor and sword, while Ramoa is stripped of her weapons. Walking around the cell, Ramoa mentions to Stax that she had been through a similar situation before: when she was taken prisoner by the Priest-Kings of Dahver-Nod, Hejira rescued her. A guard yells at them to calm down. Hours pass, and eventually, the guard gives them some bread and says that they should fall asleep, which they do. In the middle of the night, Ramoa quietly wakes up Stax, and soon they hear steel pounding on steel. To their surprise, Hejira is alive yet in pain, with Osk right behind them. Stax and Ramoa find some swords left behind by the guards and prepare to take Fouge Tempro by surprise. Hejira foolishly confesses that he slept in a bed underneath them, yet they promise not to tell anyone.", "bbox": [202.046875, 2695.015625, 726, 196]}, {"text": "Chapter 30: The Man in the Mountaintop Fortress", "bbox": [202.046875, 2915.015625, 726, 22]}, {"text": "The four (Stax, Hejira, Ramoa, and Osk) head up stone stairs, eventually leading to dark oak doors. They barge through, ending up in a dining hall filled with dust. Ramoa notices a path of bootprints leading to another door, which leads to a corridor of rooms. One of the rooms has a nether portal, and eventually they find another set of dark oak doors with torches on either side. The four enter, immediately noticing Fouge Tempro in a high-backed chair at the opposite end of the room, as well as many objects scattered throughout the room. Miggs soon notices the four (Stax, Hejira, Ramoa, and Osk), and is shocked to find that Hejira is alive. One of the raiders yells out that it’s a ghost and runs off. Miggs and the others run off as well, leaving only Fouge to defend himself. Ramoa notices the diamond armor that belonged to Stax, and Osk helps him put it on. Stax and Fouge then draw their diamond swords, preparing for a duel.", "bbox": [202.046875, 3065.015625, 726, 220]}, {"text": "Chapter 31: Duelists", "bbox": [202.046875, 3309.515625, 726, 23]}, {"text": "To Stax’s surprise, Fouge drops his sword and immediately accepts defeat, saying that Stax can do whatever he wants to him. Stax mentions to Fouge that it’s important to be kind to others, and to allow people to create a bubble a kindness against the world’s cruelty. Fouge applauds, saying that he made Stax into a warrior, and that he made Stax actually matter about his life. Stax disagrees, saying that it was himself that turned himself into a warrior. Osk decides to begin building an obsidian cell for Fouge, while Stax, Hejira, and Ramoa go throughout the room, retrieving everything that Fouge and the raiders had stole from Stax. At one point, Stax finds his father’s maps in a chest, but out of order. Over the next few hours, him and Ramoa rearrange them like a puzzle, eventually finding Desolation Bay, Tumbles Harbor, and, thankfully, Stax’s peninsula. A few weeks later, Fouge’s obsidian cell is finished, complete with a small farm, a bed, paintings, and books. Lava also surrounded the cell, with an artificial lake on top. Osk decides to stay at the fortress, making it a laboratory and a home for herself. Stax, Hejira, and Ramoa then depart for Karahamés. When they arrive, Hejira soon departs, heading northward.", "bbox": [202.046875, 3459.515625, 726, 270]}, {"text": "Chapter 32: Two Shores", "bbox": [202.046875, 3753.015625, 726, 22]}, {"text": "The next morning, Stax and Ramoa make it to Desolation Bay, and the morning after that, the two depart, with Stax heading westward toward his peninsula by boat, and Ramoa heading southward. By nightfall, Stax arrives at the tower he had repaired and decides to sleep there for the night. The next day, Stax carefully treads across the ice floes / towers, and eventually arrives back at his peninsula. He then hears a soft meow, and realizes it’s Coal, one of his cats. Emerald and Lapis also show up, happy to be reunited with Stax. He gives the cats some cod to eat and then builds a small shelter where the boathouse once stood, soon falling asleep with his cats by his side. Over the next few weeks, Stax took it upon himself to clear the peninsula of debris left over by the raiders, as well as repairing some stuff like draining the water from the mine, but instead of rebuilding his house, he instead makes a garden and refurbishes the green hill. Stax’s neighbors were stunned to find out that Stax was indeed alive, and were invited to check out the peninsula. Stax also had questioned his neighbors about things such as outposts and trade agreements, further surprising them. Over the next few months, though, Stax began to feel restlessness creep into his mind, remembering his journey through the Overworld and the many people he had met. One day, after Stax gives his cats some cod for breakfast, he decides to go exploring some more by boat, taking the cats along with him.", "bbox": [202.046875, 3903.015625, 726, 343]}]}