{"metadata": {"url": "https://minecraft.fandom.com/wiki/Minecraft_Mini-Series/S2", "title": "Minecraft_Mini-Series/S2", "time": "17/04/2022 04:02:24"}, "tables": [], "images": [], "sprites": [], "texts": [{"text": "Minecraft Mini-Series/S2", "bbox": [202.046875, 349.5, 593, 45]}, {"text": "Contents", "bbox": [215.046875, 589.9375, 81, 17]}, {"text": "1 Episode 1: Poseidon’s Game\n2 Episode 2: Medusa’s Cave\n3 Episode 3: The Twist of the Plot\n4 Episode 4: Clash in the Canal\n5 Episode 5: Stagecraft\n6 Episode 6: Maze of the Minotaur\n7 Episode 7: The Kraken Attacks!\n8 Episode 8: Poseidon’s Last Play", "bbox": [203.046875, 623.203125, 253, 246]}, {"text": "Episode 1: Poseidon’s Game", "bbox": [202.046875, 894.203125, 726, 23]}, {"text": "Quinn from Team Stone Beach and Durango from Team Mesa are sent to the Greek Isles, who are met by Poseidon. CommuniKate explains that she met Poseidon before the show started, and he takes over the show. After stealing items from everyone, he announces that the prize is the “ultimate treasure” after obtaining five eyes of ender. Then, Poseidon spawns the teams that were eliminated from the first season on top of sand pillars above water. Quinn tries to save them, but is stopped by the Kraken. Poseidon explains that they have to obtain the ender eyes in a timely manner, or the teams will respawn in the Nether. The group make it through a portal to the first challenge, Medusa’s Cave.", "bbox": [202.046875, 928.703125, 726, 171]}, {"text": "Episode 2: Medusa’s Cave", "bbox": [202.046875, 1124.203125, 726, 23]}, {"text": "The group enters Medusa’s cave, in which they first encounter the Stygian Witches. Zed creates a barricade of lava, and they make it to a room containing a chest, but are cornered by Medusa. Zed and Durango get trapped in stone, while CommuniKate retreats, forcing Quinn to face Medusa alone. Quinn is about to get trapped in stone, but CommuniKate uses her mirror to get Medusa trapped in stone, allowing the group to obtain the first ender eye. As Poseidon sends the group to their next challenge, Theseus is skeptical about it and worries about Zeus finding out about it.", "bbox": [202.046875, 1158.703125, 726, 147]}, {"text": "Episode 3: The Twist of the Plot", "bbox": [202.046875, 1329.703125, 726, 22]}, {"text": "The team spawns underwater and attempt to break the surface, but come across potions of water breathing given to them by Theseus. Theseus explains that Poseidon is using the group for his own glory, but scurries off out of fear that Poseidon may be eavesdropping. Keeping that in mind, the group swim into the ruins and find an air pocket, which leads to a hidden chamber containing a chest, but are cornered by Hydra. Eventually, the group defeat it and obtain the second ender eye. As Poseidon sends the group to their next location, Theseus meets with the eliminated players and explains that he is working on a plan to free them.", "bbox": [202.046875, 1364.203125, 726, 147]}, {"text": "Episode 4: Clash in the Canal", "bbox": [202.046875, 1535.203125, 726, 23]}, {"text": "The teams are sent to a canal, but CommuniKate realizes the sun is setting, and plans to have the night off. Quinn is worried about the eliminated players, but with a 3-1 vote, Quinn decides to fetch the third ender eye herself. Zed then changes his mind and goes along with Quinn as Durango and CommuniKate unsuccessfully attempt to build a shelter. Quinn and Zed come across a cave containing a chest, but are met by a Harpy. Durango and CommuniKate arrive, with Durango using a fishing rod to hold the Harpy in place from its foot. The group obtain the third ender eye, but Poseidon interrupts them and tells them to make haste. Quinn realizes that River and Toby are missing, and Poseidon realizes that Theseus has made the two escape.", "bbox": [202.046875, 1569.703125, 726, 171]}, {"text": "Episode 5: Stagecraft", "bbox": [202.046875, 1765.203125, 726, 23]}, {"text": "River and Toby are teleported to a theater by Theseus, with the rest of the group following soon after. They are greeted by Chimera, who has the group go through three events: improvisation, mine & movement, and acting. Although Chimera wins at both improvisation and mine & movement, CommuniKate excels at acting, allowing the group to obtain the fourth ender eye. Poseidon is mad at Theseus about River and Toby escaping, and decides to keep a close eye on him as the “show” is almost over. Poseidon then sends the group to their next location, a labyrinth.", "bbox": [202.046875, 1799.703125, 726, 147]}, {"text": "Episode 6: Maze of the Minotaur", "bbox": [202.046875, 1970.703125, 726, 22]}, {"text": "The group make it through the labyrinth, with Zed mining underground and Durango using the creepers to make a shortcut. Eventually, the group make it to the end of the labyrinth, but not before being met by Minotaur, Cerberus, and Cyclops. As the group gets ready to fight them, Zed mines the blocks from below, making the Minotaur and Cyclops fall toward certain death, while Cerberus retreats. The group obtain the fifth ender eye, but Poseidon steals them all in order to make him more powerful than Zeus and teleports the players onto a sand tower to be fed to the Kraken.", "bbox": [202.046875, 2005.203125, 726, 147]}, {"text": "Episode 7: The Kraken Attacks!", "bbox": [202.046875, 2176.203125, 726, 23]}, {"text": "Poseidon reveals that the eyes of ender make a portal to the Overworld, which is where he plans to use his powers. Quinn questions as to why Poseidon couldn’t get the ender eyes himself, and he replies that the chests that held them were created by Zeus, and thus couldn’t be opened by Greek gods. Theseus realizes that he was wrong to have Poseidon defy Zeus, so he steals an ender eye to destroy the portal. While Poseidon chases after Theseus, River and Toby throw fish to distract the Kraken, allowing the players to get to safety. The players and Poseidon fight over the final ender eye, but Poseidon gets the last laugh and obtains it. Durango attempts to use the trident to turn him into a chicken, but the trident turns out to be a dud. Theseus explains that Poseidon isn’t a Greek god, but is actually mortal. Poseidon reveals that he has a trident made out of command blocks, and uses it to make something that destroys the players.", "bbox": [202.046875, 2210.703125, 726, 220]}, {"text": "Episode 8: Poseidon’s Last Play", "bbox": [202.046875, 2455.203125, 726, 23]}, {"text": "Poseidon uses the command blocks to make a Phoenix, but despawns it after Durango begins riding it. Poseidon and Theseus have a duel with two raw fish, and Theseus explains to Quinn that the command blocks have a self-destruct code. After a few attempts with CommuniKate, they are successful in entering it, and run for cover just as the trident erupts. Poseidon attempts to use the eyes of ender again, but Zeus arrives and uses his lightning bolt (powered by command blocks) to steal them from him. Zeus explains that he found out about Poseidon’s plan by binge-watching the entire series, and allows the players to return home. However, he also offers a show in which “those need [the players’] help.”", "bbox": [202.046875, 2489.703125, 726, 171]}]}