{"metadata": {"url": "https://minecraft.fandom.com/wiki/Biome/Before_Beta_1.8", "title": "Biome/Before_Beta_1.8", "time": "17/04/2022 00:31:53"}, "tables": [{"bbox": [202.046875, 1920.015625, 725, 4100], "headers": {"text": ["Biome", "Characteristics", "Image"], "bboxes": [[202.546875, 1920.515625, 90, 31], [293.484375, 1920.515625, 322, 31], [615.234375, 1920.515625, 312, 31]]}, "cells": {"text": ["Rain Forest", "Rainforests are very wet biomes with many trees, which have a 1 in 3 chance of being big, instead of 1 in 10 like all other biomes. They are similar to forests but have a large amount of tall grass and ferns (sometimes consistent and continuous cover generated) and lush green grass due to the temperature and rainfall requirements. A biome is classified as a rainforest if the temperature is greater than 97% and the rainfall is more than 90%. This could be the biome with some of the most cliffs and hills, because the world generator reduces height variation at lower rainfalls.", "", "Seasonal Forest", "Seasonal Forests spawn with a temperature of 97% or greater, and a rainfall value between 45% and 90%. They are commonly found between forest and rain forests, and near plains biomes. They are identical to forests, except their canopies are lower density and are only capable of spawning oak trees. They have a little bit of tall grass but sometimes more is present.", "", "Forest", "A biome with many trees and a little bit of tall grass. Wolves can spawn here. Forest is one of the only biomes where birch trees spawn. It generates when the temperature is between 50% and 97%, and the rainfall is 35% or greater. due to some forests generating in areas with 50% temperature snow can be present on hilltops but does not regenerate. the grass color can be dull green, lush green, and blueish gray depending on the temperature and rainfall values of the region. they were, and still are one of the most common biomes in the game.", "", "Swampland", "Identical to shrubland with only the unused color variables and the biome name differing. It generates when the temperature is less than 70%, and the rainfall is greater than 50%. Because 50% temperature and below causes snowfall, the swamp biome can very rarely have small portions of snow (although it will not regenerate and will rain instead of snow). Even though the swamp biome only generates at above 50% temperature, snow can still generate on hills because the higher the altitude, the higher the temperature that snow can spawn in. the swamp, along with shrubland were some of the smallest biomes in the game, rarely ever being larger than a few chunks. It could often be found near forest, shrubland, taiga, and tundra.", "", "Savanna", "A biome with mostly flat terrain and very few trees, although some hills do spawn and can host tall mountains. It seems to be one of the flattest biomes in the game, alongside desert and tundra, due to the game reducing height variation at lower rainfall values. The grass color can range from dull orange to blue-ish gray. It generates with a temperature between 50% and 95%, and a rainfall value of less than 20%. It was removed in Java Edition Beta 1.8 and was re-added in Java Edition 1.7.2, although it is different from the original Savanna.", "", "Shrubland", "A biome with few trees and no tall grass. It is identical to the savanna biome, but could generate in lower temperature areas. along with swampland, it was one of the smallest biomes in the game, rarely ever being larger than a few chunks, and only spawns if the temperature is between 50% and 97%, and the rainfall value is below 35% and therefore too little to generate a forest. It often generates near forests, seasonal forest, and savanna.", "", "Taiga", "A snowy biome composed of mostly mountainous terrain and a bit of tall grass. Spruce and pine trees as well as ice can be found in this region. Wolves also appear more commonly on this biome than others. Snow is a common weather in taiga biomes. It generates when the temperature is between 10% and 50% and the rainfall is greater than 20%. In Beta 1.8 and Java Edition 1.0, taiga biomes generated without ice and/or snow due to a bug (Java Edition 1.7 allowed for taiga biomes to generate as both snowy and snowless). The pre-1.8 Taiga biome was also usually a smaller biome. from alpha 1.2 to beta 1.3 the taiga was arguably a snowy version of the regular forest as only oak trees generated due to spruce being not yet added", "", "Desert", "A biome consisting mostly of sand, Sandstone , dead bushes and cacti. Trees do not generate in deserts unless the player brings in dirt. No rain occurs in this biome. It spawns when the rainfall is less than 20% and the temperature is greater than 95%.\nSince Beta 1.0 and before Beta 1.4, biome borders were rotated and didn't line up because of a bug, which was more noticeable for deserts due to the fact that they generate different ground blocks than the other biomes. they mostly consist of flat plains but uncommonly hills and mountains can generate, especially if the surrounding biomes are mountainous.\nIt was possible to find exposed or partially buried dungeons here due to sand being affected by gravity, however it is no longer the case a it is no longer possible in modern versions due to changes made to dungeon generation in 1.7.", "", "Plains", "A relatively flat with a very large amount of tall grass (more than in any other type of land). The occasional trees do exist, though very rarely. Plains are typically smaller than other biomes because they have an extremely marginal generation range, only occurring if the temperature is greater than 97% and the rainfall is between 45% and 20% (less and it would be a desert, more and it would be a seasonal forest). Despite having a larger rainfall range than rainforest, the rainfall values fall into this range less often because they sometimes go outside of 0%-100% and are capped at those values, and can become \"stuck\" at 0% or 100% for some time. They can also sometimes but rarely be mountainous if the plains has a high rainfall which increases the chance for varied terrain to occur or if a mountain from a neighboring biome intersects. After Java Edition Beta 1.8, it becomes the second most common biome in the game.", "", "Tundra", "Snowy, barren terrain consisting of flat plains and sometimes hills and mountains, and with very few trees. The occasional trees do exist, though very rarely. Ice can be found over water. Snow is a common weather in tundras. It generates when the temperature is below 50% and the rainfall is less than 20%.\nIn Beta 1.8, Notch also said that this biome would be left out until \"Beta 1.9\". This is because snow was causing problems with the new biome generator.", "", "Sky", "A hidden biome before Beta 1.9 Prerelease 4, this biome was exclusive to, and the sole biome of the Sky Dimension. It would generate floating islands with oceans of air surrounding them. Trees were uncommon, no weather occurred here, and the only mob that could spawn naturally were chickens. It had small patches of snow, although it would not accumulate again. It had green with some extra blue hue for foliage colors.\nThis biome was introduced in Beta 1.6 along with the Sky Dimension itself. It was reintroduced for The End's biome.", "", "Ice Desert (corner case biome)", "An unused biome before Beta 1.8 that was in the code but never implemented into the temperature/rainfall table and thus did not actually generate. It was a biome of sand with snow on top of it and had snowfall and ice.", ""], "bboxes": [[202.546875, 1951.609375, 90, 325], [293.484375, 1951.609375, 322, 325], [615.234375, 1951.609375, 312, 325], [202.546875, 2276.703125, 90, 202], [293.484375, 2276.703125, 322, 202], [615.234375, 2276.703125, 312, 202], [202.546875, 2479.296875, 90, 300], [293.484375, 2479.296875, 322, 300], [615.234375, 2479.296875, 312, 300], [202.546875, 2779.890625, 90, 398], [293.484375, 2779.890625, 322, 398], [615.234375, 2779.890625, 312, 398], [202.546875, 3178.484375, 90, 300], [293.484375, 3178.484375, 322, 300], [615.234375, 3178.484375, 312, 300], [202.546875, 3479.078125, 90, 251], [293.484375, 3479.078125, 322, 251], [615.234375, 3479.078125, 312, 251], [202.546875, 3730.671875, 90, 423], [293.484375, 3730.671875, 322, 423], [615.234375, 3730.671875, 312, 423], [202.546875, 4153.765625, 90, 520], [293.484375, 4153.765625, 322, 520], [615.234375, 4153.765625, 312, 520], [202.546875, 4673.859375, 90, 521], [293.484375, 4673.859375, 322, 521], [615.234375, 4673.859375, 312, 521], [202.546875, 5194.953125, 90, 300], [293.484375, 5194.953125, 322, 300], [615.234375, 5194.953125, 312, 300], [202.546875, 5495.046875, 90, 349], [293.484375, 5495.046875, 322, 349], [615.234375, 5495.046875, 312, 349], [202.546875, 5844.140625, 90, 175], [293.484375, 5844.140625, 322, 175], [615.234375, 5844.140625, 312, 175]]}}, {"bbox": [202.046875, 6124.234375, 725, 1984], "headers": {"text": ["Structure", "Characteristics", "Image"], "bboxes": [[202.546875, 6124.734375, 81, 31], [283.734375, 6124.734375, 331, 31], [615.25, 6124.734375, 312, 31]]}, "cells": {"text": ["Hills/Cliffs", "Mountains are hills with extreme slopes. Prior to the 1.8 update, these highly mountainous landforms were found in every biome type, with the only limiting factor being the rainfall of the biome increasing or decreasing height variation, allowing for high rainfall biomes such as rainforest their unpredictable terrain, and dry biomes like deserts and tundra to be consistently flat or mountainous. But from the Adventure Update onwards, they are very rare outside the Extreme Hills, Modified badlands, shattered savanna, and modified jungle biomes, as mountain generation was entirely biome dependent. They were generated as part of the terrain generation algorithm from infdev to beta 1.8 prerelease. The idea of biome-independent terrain was re-inplemented in Java Edition 1.18.\nCliffs are often carved into hills, and sometimes have caves protruding into them. These caves contain the same blocks which one would find at the same layer in the hill they are carved out of. Sometimes cliffs intersected with hills in strange ways allowing for many chaotic landscapes to generate.\nSome of the most famous seeds at the time were notable for the chaotic and unpredictable nature of cliffs and hills.", "", "Ocean", "Oceans are large bodies of water with every single water tile being a spring. Prior to the Adventure Update, oceans were generated as part of the terrain generation algorithm, instead of being their own biome. The lakebed was almost always consistently dirt, and sometimes gravel depending on if a gravel beach was nearby or not, in contrast to the clay, sand, gravel, and dirt patches from beta 1.8 onwards.", "", "Beaches", "Beaches were usually generated next to oceans or lakes and covered all nearby low elevated shorelines. They could be found in any biome. They came in two varieties: sand and gravel. Sandstone was located below sand in sand beaches, and occasional patches of clay could also be found.\nGravel beaches had no such underground border, and thus posed dangers such as falling into caverns located right underneath them. The famous \"404 challenge\" was possible due to this feature.\nThe block that beaches and ocean floors consist of is determined by the same algorithm. It is determined whether each X-Z coordinate generates with sand, dirt or gravel, and then if the highest terrain block is at altitude 65 (2 blocks above sea level) or below, the surface is replaced with that material.\nLike in deserts, exposed or partially buried dungeons could sometimes generate near the surface of beaches. The well known seed \"worstseedever\" had one in relative close proximity. However, due to changes made to the way dungeons generate in Java Edition 1.7.2, this is no longer the case in modern versions.\nDue to the changes in the terrain generation algorithm in the Java Edition Beta 1.8 update, beaches were removed completely from the game. They later returned with Minecraft Java Edition 1.1 as a separate biome, but lacked the spaciousness of old beaches from Beta versions, and only came in the sand variety. Java Edition 1.7 later added a beach biome that is made of stone and gravel, the stone shore, for when a beach generates next to an extreme hills biome. Spacier beaches were re-added in Java Edition 1.18.", ""], "bboxes": [[202.546875, 6155.828125, 81, 716], [283.734375, 6155.828125, 331, 716], [615.25, 6155.828125, 312, 716], [202.546875, 6871.921875, 81, 227], [283.734375, 6871.921875, 331, 227], [615.25, 6871.921875, 312, 227], [202.546875, 7099.015625, 81, 1009], [283.734375, 7099.015625, 331, 1009], [615.25, 7099.015625, 312, 1009]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/5/58/Example_of_Biomes.png", "path": "images/img.png", "alt_text": "", "caption": "Pre-Beta 1.8 example of Biomes", "bbox": [73.9375, 676.078125, 854, 480]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/8/85/Rainforest.jpg", "path": "images/Rainforest.jpg", "alt_text": "Rainforest", "caption": null, "bbox": [621.328125, 2026.15625, 300, 176]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/1/1a/SeasonalForest.jpg", "path": "images/SeasonalForest.jpg", "alt_text": "SeasonalForest", "caption": null, "bbox": [621.328125, 2290, 300, 176]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/3/3a/Forest.jpg", "path": "images/Forest.jpg", "alt_text": "Forest", "caption": null, "bbox": [621.328125, 2541.59375, 300, 176]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/8/8a/Swampland.jpg", "path": "images/Swampland.jpg", "alt_text": "Swampland", "caption": null, "bbox": [621.328125, 2891.1875, 300, 176]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/b/b5/Savanna.jpg", "path": "images/Savanna.jpg", "alt_text": "Savanna", "caption": null, "bbox": [621.328125, 3240.78125, 300, 176]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/b/bf/Shrubland.jpg", "path": "images/Shrubland.jpg", "alt_text": "Shrubland", "caption": null, "bbox": [621.328125, 3516.875, 300, 176]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/4/46/Taiga.jpg", "path": "images/Taiga.jpg", "alt_text": "Taiga", "caption": null, "bbox": [621.328125, 3854.21875, 300, 176]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/c/c2/Old_Desert.jpg", "path": "images/Old Desert.jpg", "alt_text": "Old Desert", "caption": null, "bbox": [621.328125, 4325.8125, 300, 176]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/7/73/Plains.jpg", "path": "images/Plains.jpg", "alt_text": "Plains", "caption": null, "bbox": [621.328125, 4846.40625, 300, 176]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/e/e3/Tundra.jpg", "path": "images/Tundra.jpg", "alt_text": "Tundra", "caption": null, "bbox": [621.328125, 5257, 300, 176]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/8/82/Sky_Dimension_1.jpg", "path": "images/Sky Dimension 1.jpg", "alt_text": "Sky Dimension 1", "caption": null, "bbox": [621.328125, 5592.59375, 300, 154]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/4/41/Ice_desert.png", "path": "images/Ice desert.png", "alt_text": "Ice desert", "caption": null, "bbox": [621.328125, 5847.4375, 300, 169]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/2/27/Beta_Mountain.png", "path": "images/Beta Mountain.png", "alt_text": "Beta Mountain", "caption": null, "bbox": [621.34375, 6333.375, 300, 169]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/f4/Giant_overhang_in_Beta_1.7.png", "path": "images/Giant overhang in Beta 1.7.png", "alt_text": "Giant overhang in Beta 1.7", "caption": null, "bbox": [621.34375, 6502.375, 300, 168]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/1/10/BetaOcean.png", "path": "images/An open Ocean with a couple islands in the distance..png", "alt_text": "An open Ocean with a couple islands in the distance.", "caption": null, "bbox": [621.34375, 6901.46875, 300, 168]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/e/e2/Sand_beach_2.png", "path": "images/Sand beach 2.png", "alt_text": "Sand beach 2", "caption": null, "bbox": [621.34375, 7427.5625, 300, 169]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/fd/Gravel_beach.png", "path": "images/Gravel beach.png", "alt_text": "Gravel beach", "caption": null, "bbox": [621.34375, 7596.5625, 300, 159]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/f2/Biomes_Example.png", "path": "images/img (1).png", "alt_text": "", "caption": null, "bbox": [255.046875, 8243.109375, 120, 67]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/2/26/NotchBiomeGraph.png", "path": "images/img (2).png", "alt_text": "", "caption": null, "bbox": [413.046875, 8231.609375, 120, 90]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/7/73/BiomesGraph.png", "path": "images/img (3).png", "alt_text": "", "caption": null, "bbox": [571.046875, 8216.609375, 120, 120]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/4/46/Beta1.7.3_BiomeGraph.png", "path": "images/img (4).png", "alt_text": "", "caption": null, "bbox": [729.046875, 8216.609375, 120, 120]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/9/92/Huge_Beta_Overhang.png", "path": "images/img (5).png", "alt_text": "", "caption": null, "bbox": [255.046875, 8546.609375, 120, 64]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/7/79/Beta_Mountains_1.jpg", "path": "images/img.jpg", "alt_text": "", "caption": null, "bbox": [413.046875, 8544.609375, 120, 68]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/6/67/Beta_Mountains_2.png", "path": "images/img (6).png", "alt_text": "", "caption": null, "bbox": [571.046875, 8545.109375, 120, 67]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/0/07/Beta_Mountains_3.png", "path": "images/img (7).png", "alt_text": "", "caption": null, "bbox": [729.046875, 8545.109375, 120, 67]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/a/a5/Beta_Beaches_1.png", "path": "images/img (8).png", "alt_text": "", "caption": null, "bbox": [255.046875, 8756.609375, 120, 68]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/f9/Beta_Beaches_2.png", "path": "images/img (9).png", "alt_text": "", "caption": null, "bbox": [413.046875, 8756.609375, 120, 68]}], "sprites": [{"text": null, "bbox": [260.53125, 491.484375, 32, 32]}, {"text": null, "bbox": [220.046875, 1792.171875, 16, 16]}], "texts": [{"text": "Biome/Before Beta 1.8", "bbox": [202.046875, 353.890625, 593, 45]}, {"text": "See also: Biome/Before TU5", "bbox": [216.046875, 443.390625, 712, 25]}, {"text": "In Java Edition Beta 1.8, Legacy Console Edition TU5, and Pocket Edition v0.9.0 alpha, biomes received a major overhaul, removing and changing many biomes.", "bbox": [202.046875, 551.078125, 726, 49]}, {"text": "Biome types", "bbox": [202.046875, 624.078125, 726, 43]}, {"text": "Before the Adventure Update, biomes were much smaller, sometimes smaller than a chunk, and less distinct.", "bbox": [202.046875, 676.078125, 726, 545]}, {"text": "Biome generation was controlled in these versions by noise generated temperature and rainfall values, allowing for fully smooth transitions from biome to biome and preventing cold and warm biomes from generating next to one another. The specific biome was determined by where the combination of temperature and rainfall put it.", "bbox": [202.046875, 1245.578125, 726, 74]}, {"text": "Height variation was entirely independent of biome type, with biomes having no influence on the shape of terrain. This meant things like cliffs and mountains were able to generate up to nearly 128 on the y-axis in any biome. Tall grass was also much less present in pre-1.8 worlds (except in the \"Plains\" and \"Rainforest\" biomes).", "bbox": [202.046875, 1343.078125, 726, 73]}, {"text": "There were 13 biome types: 10 in the Overworld, 1 in the Nether, and 2 unused ones that are in the code but aren't encountered in normal play. These biomes were added in Java Edition Alpha 1.2.0, and relatively few changes were undergone to these biomes other than the introduction of birch and spruce trees in Beta 1.2 (which allowed for new chunks to have birch trees generate in forests and spruce to generate in taiga in place of oak trees), desert biome borders being rotated due to then not lining up in Beta 1.4, and the introduction of tall grass and ferns in Beta 1.6.", "bbox": [202.046875, 1440.578125, 726, 147]}, {"text": "Grass and foliage colors were determined by an algorithm based on the temperature and humidity, rather than from the biomes directly. This means there can be a wide range of different grass and foliage colors for any one biome. Once the game gets the temperature and humidity values by pulling grass and foliage colors, it uses said values to grab colors from /misc/grasscolor.png or /misc/foliagecolor.png, and applies it to the uncolored grass or leaves. The same implementation also existed for water colorization with /misc/watercolor.png. However, this feature wasn't enabled in the code, and wasn't implemented until Java Edition 1.13.", "bbox": [202.046875, 1611.578125, 726, 147]}, {"text": "Terrain features", "bbox": [202.046875, 6058.234375, 726, 43]}, {"text": "Gallery", "bbox": [202.046875, 8140.609375, 726, 43]}, {"text": "An old image of biomes work-in-progress. \"To the right of the player is a taiga, to the left is either a forest, or woods, I can’t remember. In the distance is probably tundra.\" – Notch\nThe biomes graph prior to Beta 1.8, drawn by Notch. Notice the chicken scratch handwriting, as Notch was working quick to try to get the biomes added by the Halloween Update.\nThe old biomes graph, with linear axes.\nThe actual biome graph used by Beta 1.7.3.\nA large overhang, a common occurrence in Beta's terrain generation.\nMountainous terrain in a rainforest biome.\nMountainous terrain viewed from across water.\nMountainous terrain with many overhangs.\nNumerous large flat beaches.\nNumerous large flat beaches.", "bbox": [238.046875, 8192.609375, 690, 712]}, {"text": "An old image of biomes work-in-progress. \"To the right of the player is a taiga, to the left is either a forest, or woods, I can’t remember. In the distance is probably tundra.\" – Notch", "bbox": [240.046875, 8352.609375, 155, 144]}, {"text": "The biomes graph prior to Beta 1.8, drawn by Notch. Notice the chicken scratch handwriting, as Notch was working quick to try to get the biomes added by the Halloween Update.", "bbox": [398.046875, 8352.609375, 155, 126]}, {"text": "The old biomes graph, with linear axes.", "bbox": [556.046875, 8352.609375, 155, 36]}, {"text": "The actual biome graph used by Beta 1.7.3.", "bbox": [714.046875, 8352.609375, 155, 36]}, {"text": "A large overhang, a common occurrence in Beta's terrain generation.", "bbox": [240.046875, 8654.609375, 155, 54]}, {"text": "Mountainous terrain in a rainforest biome.", "bbox": [398.046875, 8654.609375, 155, 36]}, {"text": "Mountainous terrain viewed from across water.", "bbox": [556.046875, 8654.609375, 155, 36]}, {"text": "Mountainous terrain with many overhangs.", "bbox": [714.046875, 8654.609375, 155, 36]}, {"text": "Numerous large flat beaches.", "bbox": [240.046875, 8866.609375, 155, 36]}, {"text": "Numerous large flat beaches.", "bbox": [398.046875, 8866.609375, 155, 36]}]}