{"metadata": {"url": "https://minecraft.fandom.com/wiki/Player.dat_format/ItemPotion", "title": "Player.dat_format/ItemPotion", "time": "17/04/2022 06:24:13"}, "tables": [], "images": [], "sprites": [{"text": null, "bbox": [202.046875, 443.6875, 16, 16]}, {"text": null, "bbox": [223.046875, 468.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 517.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 541.6875, 16, 16]}, {"text": null, "bbox": [223.046875, 566.1875, 16, 16]}, {"text": null, "bbox": [244.046875, 639.6875, 16, 16]}, {"text": null, "bbox": [265.046875, 664.1875, 16, 16]}, {"text": null, "bbox": [286.046875, 688.6875, 16, 16]}, {"text": null, "bbox": [286.046875, 713.1875, 16, 16]}, {"text": null, "bbox": [286.046875, 762.1875, 16, 16]}, {"text": null, "bbox": [286.046875, 811.1875, 16, 16]}, {"text": null, "bbox": [286.046875, 860.1875, 16, 16]}, {"text": null, "bbox": [286.046875, 909.1875, 16, 16]}, {"text": null, "bbox": [244.046875, 933.6875, 16, 16]}, {"text": null, "bbox": [244.046875, 1031.6875, 16, 16]}], "texts": [{"text": "Player.dat format/ItemPotion", "bbox": [202.046875, 347, 593, 45]}, {"text": "The root tag.\n Count: Number of items stacked in this inventory slot. Any item can be stacked, even if unstackable through normal means. Values below 0 cause the item to be treated as air, resulting in the item being removed.\n Slot: The inventory slot the item is in.\n id: Item/Block ID. If not specified, gets treated as air, resulting in the item being removed.\n tag: Additional information about the item, discussed more in the subsections of the item structure section. This tag is optional for most items. Unlike other entity or block NBT, this tag is never deserialized and can hold user defined tags that are not used by the game by standard.", "bbox": [202.046875, 440.6875, 726, 196]}, {"text": " CustomPotionEffects: The custom potion effects (status effects) this potion or tipped arrow has.\nOne of these for each effect.\n Id: The numeric ID of the effect.\n Amplifier: The amplifier of the effect, with level I having value 0. Negative levels are discussed here. Optional, and defaults to level I.\n Duration: The duration of the effect in ticks. Values 0 or lower are treated as 1. Optional, and defaults to 1 tick.\n Ambient: 1 or 0 (true/false) - whether or not this is an effect provided by a beacon and therefore should be less intrusive on the screen. Optional, and defaults to false.\n ShowParticles: 1 or 0 (true/false) - whether or not this effect produces particles. Optional, and defaults to true.\n ShowIcon: 1 or 0 (true/false) - true if effect icon is shown. false if no icon is shown.\n Potion: The name of the default potion effect. This name differs from the status effect name. For example, the value for an \"Instant Health II\" potion is \"minecraft:strong_healing\". A potion or tipped arrow getting its effects from this tag is named with the proper effect. The default value is \"minecraft:empty\", which gives it the \"Uncraftable\" name.\n CustomPotionColor: The item uses this custom color, and area-of-effect clouds, arrows, and splash and lingering potions use it for their particle effects. This color does not extend, however, to the particles given off by entities who ultimately receive the effect. The numeric color codes are equal to the hex code of the color converted to a decimal number, or can alternatively be calculated from the Red, Green and Blue components using this formula: Red<<16 + Green<<8 + Blue. For positive values larger than 0x00FFFFFF, the top byte is ignored. All negative values produce white.", "bbox": [202.046875, 636.6875, 726, 539]}]}