{"metadata": {"url": "https://minecraft.fandom.com/wiki/Tutorials/Spawn-proofing", "title": "Tutorials/Spawn-proofing", "time": "16/04/2022 23:58:08"}, "tables": [], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/6/62/Gear_%28item%29.gif", "path": "images/Gear (item).png", "alt_text": "Gear (item)", "caption": null, "bbox": [260.53125, 472.234375, 32, 32]}], "sprites": [], "texts": [{"text": "Tutorials/Spawn-proofing", "bbox": [202.046875, 353.890625, 593, 45]}, {"text": "Hostile mobs will spawn in and around your builds if there is not a high enough light level or if it is night time. Mobs such as creepers have the potential to destroy your creations, while others may attack you. There are many ways of preventing hostile creatures from spawning.", "bbox": [202.046875, 544.078125, 726, 73]}, {"text": "Basic spawnproofing", "bbox": [202.046875, 641.578125, 726, 43]}, {"text": "Light blocks\nOne of the most basic ways to prevent mob spawning is by placing torches. These will increase the light level around them, stopping hostiles from spawning. Other blocks such as glowstone or shroomlight emit higher light levels, but are harder to come by. This method does not work with mobs whose spawning does not rely on low light level, such as slimes, magma cubes and hoglins.", "bbox": [202.046875, 693.578125, 726, 123]}, {"text": "Slabs and partial blocks\nMobs cannot spawn on blocks that are less than a full block in height. Areas covered in bottom half slabs will be unable to spawn mobs, no matter the light level, although double slabs, top half slabs and upside down stairs are still spawnable. Also Dirt Path/Grass Path is a partial block (15/16th of a block in height) and cannot be spawned upon.", "bbox": [202.046875, 816.078125, 726, 122]}, {"text": "Transparent blocks\nMobs will also not be able to spawn on top of transparent blocks, such as glass, or partially transparent blocks, such as leaves.\nOne exception is the scaffolding, which is transparent but allows mobs to spawn. This odd fact allows a very efficient mob farm by ianxofour.", "bbox": [202.046875, 938.578125, 726, 123]}, {"text": "Carpet\nMobs cannot spawn on carpets because they are not a full block. It also makes nice art.", "bbox": [202.046875, 1061.078125, 726, 49]}, {"text": "Snow layer\nSnow layers of thicknesses 2 to 7 prevent hostile mobs from spawning.", "bbox": [202.046875, 1110.078125, 726, 49]}, {"text": "Redstone components\nMobs cannot spawn on buttons, levers, pressure plates, and all types of rails.", "bbox": [202.046875, 1159.078125, 726, 49]}, {"text": "Fluids\nMobs other than water mobs are unable to spawn in water. Mobs other than striders are unable to spawn on lava.", "bbox": [202.046875, 1208.078125, 726, 73]}, {"text": "(Side note: You can download mods to show where you have to spawn-proof for your mob farm or entity removing needs.)", "bbox": [202.046875, 1281.578125, 726, 49]}, {"text": "Advanced spawnproofing", "bbox": [202.046875, 1354.578125, 726, 43]}, {"text": "Mob switch\nMinecraft has a mob cap. That mob cap increases by 70 for each player online, unless it is altered through commands. This is to ensure that the world is not flooded with mobs. If you use name tag on a mob, it no longer counts towards the mob cap, but it does not despawn either, i.e it won't disappear if you go away. Some mobs are an exception to this despawn rule, like withers and shulkers. Therefore if you put more than the mob cap of either of these mob in the spawn chunks, you prevent mobs from spawning in the world. If those mobs are put on the edges of the spawn chunks, you can move them in and out (in mine carts), turning it on or off.\nAnother alternative to the spawn chunks is loading the area with nether portals. This is useful because it allows you to locate the mob switch anywhere in the world.", "bbox": [202.046875, 1406.578125, 726, 221]}]}