{"metadata": {"url": "https://minecraft.fandom.com/wiki/Naturalist", "title": "Naturalist", "time": "16/04/2022 23:45:11"}, "tables": [{"bbox": [202.046875, 442.890625, 726, 157], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "As I sit here in my warm study, surrounded by my treasured books, my mind turns to the worlds beyond my windows. Out there, countless adventurers are courageously exploring the Overworld and beyond... ...The time has come for me to retire from my role as explorer, and so I leave you with my life's work — a thorough account of every mob discovered so far in this strange and perilous world.", "„", "", "— The naturalist speaking in the preface from the Minecraft: Mobestiary.", ""], "bboxes": [[204.046875, 444.890625, 27, 124], [233.140625, 444.890625, 664, 124], [898.84375, 444.890625, 27, 124], [204.046875, 570.890625, 27, 27], [233.140625, 570.890625, 664, 27], [898.84375, 570.890625, 27, 27]]}}, {"bbox": [202.046875, 1056.40625, 726, 229], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "Hello! If you read the Mobestiary carefully,\nyou'll notice that it's written from the point of view of one particular naturalist who tends to put their own theories and ideas among the facts, and maybe doesn't even have personal experience of the creatures they're writing about. So you should decide for yourself if you\nagree with them :)", "„", "", "— Alex Wiltshire on the creditability of the Naturalist.", ""], "bboxes": [[204.046875, 1058.40625, 27, 197], [233.140625, 1058.40625, 664, 197], [898.84375, 1058.40625, 27, 197], [204.046875, 1256.90625, 27, 27], [233.140625, 1256.90625, 664, 27], [898.84375, 1256.90625, 27, 27]]}}, {"bbox": [202.046875, 1603.40625, 726, 206], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "With insider gaming info and tips, this is the official, definitive, fully illustrated guide to mobs - and how to outsmart them- in Minecraft. Minecraft: Mobestiary reveals the secrets of every mob in the game. You’ll find little-known facts about passive, neutral, hostile, utility, and boss mobs, as well as more general information about their locations, behaviors, threat levels, and drops. Written by Alex Wiltshire, who has made it his life’s work to study Minecraft’s mobs. Illustrated with field sketches throughout by Anton Stenvall.", "„", "", "— The description shown on the back of the book.", ""], "bboxes": [[204.046875, 1605.40625, 27, 173], [233.140625, 1605.40625, 664, 173], [898.84375, 1605.40625, 27, 173], [204.046875, 1780.40625, 27, 27], [233.140625, 1780.40625, 664, 27], [898.84375, 1780.40625, 27, 27]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/6/67/Minecraft_Mobestiary.png", "path": "images/Minecraft Mobestiary.png", "alt_text": "Minecraft Mobestiary", "caption": null, "bbox": [701.9375, 1361.40625, 226, 223]}], "sprites": [], "texts": [{"text": "Naturalist", "bbox": [202.046875, 353.890625, 593, 45]}, {"text": "The naturalist is a human scholar in the world of Minecraft and the fictional writer of Minecraft: Mobestiary by Alex Wiltshire. They has supposedly made it their life’s work to study Minecraft’s mobs and write their findings into an encyclopedia about the creatures and animals.", "bbox": [202.046875, 599.390625, 726, 73]}, {"text": "Contents", "bbox": [215.046875, 712.640625, 81, 17]}, {"text": "1 Creditability of the Naturalist\n2 Minecraft: Mobestiary\n2.1 Description\n3 Trivia\n4 References", "bbox": [203.046875, 745.90625, 231, 161]}, {"text": "Creditability of the Naturalist", "bbox": [202.046875, 931.40625, 726, 43]}, {"text": "According to Alex Wiltshire, the naturalist is an unreliable narrator who places bias on their own beliefs over evidence and personally experiencing the creatures talked about, as seen in this quote by the author:", "bbox": [202.046875, 983.40625, 726, 49]}, {"text": "Minecraft: Mobestiary", "bbox": [202.046875, 1309.40625, 726, 43]}, {"text": "The Naturalist explains how each mob works in detail according to his perspective in the Minecraft world. Most of the writing focuses on the in-game mechanics of each mob, but occasionally describes or shows information from outside of the game. Such as the origins of the killer bunny, TNT shown inside a creeper, and the superstition of the chicken being a spy. There are also dissections of some of the mobs showing organs, bones, gas, magma, gears, and/or redstone depending on the mob.", "bbox": [202.046875, 1361.40625, 726, 171]}, {"text": "Description", "bbox": [202.046875, 1556.90625, 726, 23]}, {"text": "Trivia", "bbox": [202.046875, 1826.90625, 726, 43]}, {"text": "A naturalist is someone who studies natural history and practices naturalism in the forms of art and writing.\nIt is actually confirmed by author Alex Wiltshire that not everything in the book might be canon. https://imgur.com/eQVpq8u", "bbox": [238.046875, 1878.90625, 690, 74]}, {"text": "References", "bbox": [202.046875, 1970.40625, 726, 43]}]}