{"metadata": {"url": "https://minecraft.fandom.com/wiki/Simulation_distance", "title": "Simulation_distance", "time": "17/04/2022 00:15:25"}, "tables": [{"bbox": [202.046875, 1345.90625, 725, 296], "headers": {"text": ["Simulation distance", "Spawning range", "Random despawn range", "Instant despawn range", "4", "6", "8-12"], "bboxes": [[202.546875, 1346.40625, 100, 55], [303.015625, 1346.40625, 207, 55], [510.171875, 1346.40625, 132, 55], [642.1875, 1346.40625, 285, 55], [202.546875, 1402, 100, 31], [202.546875, 1433.09375, 100, 80], [202.546875, 1513.1875, 100, 129]]}, "cells": {"text": ["24-44 blocks", "34-44 blocks", ">44 blocks from nearest player", "24-128 blocks, except in chunks bordering unloaded chunks", "34-128 blocks if no damage taken within last 30 seconds", ">128 blocks, or when entering a chunk on the edge of the simulation distance (technically a chunk not fully surrounded by 8 chunks that were simulated on the last game tick)", "24-128 blocks, except in chunks bordering unloaded chunks and chunks with a center more than 96 blocks away[1]"], "bboxes": [[303.015625, 1402, 207, 31], [510.171875, 1402, 132, 31], [642.1875, 1402, 285, 31], [303.015625, 1433.09375, 207, 80], [510.171875, 1433.09375, 132, 209], [642.1875, 1433.09375, 285, 209], [303.015625, 1513.1875, 207, 129]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/9/98/SimDistanceBedrock.png", "path": "images/img.png", "alt_text": "", "caption": "Simulation Distance control slider in Bedrock Edition.", "bbox": [627.9375, 382.390625, 300, 212]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/4/47/Lightning_distribution_BE.png", "path": "images/img (1).png", "alt_text": "", "caption": "Maximum distance of lightning strikes from a lightning rod is determined by simulation distance as taxicab distance, in this case 12 chunks (192 blocks) from the player position at the center of the image.", "bbox": [747.9375, 1029.40625, 180, 101]}], "sprites": [], "texts": [{"text": "Simulation distance", "bbox": [202.046875, 317.390625, 593, 45]}, {"text": "Simulation distance is a world-creation setting in Bedrock Edition that controls mob spawning and despawning, and tick updates. As of Java Edition 1.18, simulation distance was introduced as a video setting related to render distance, to restrict tick update distance.", "bbox": [202.046875, 382.390625, 726, 123]}, {"text": "Contents", "bbox": [215.046875, 544.640625, 81, 17]}, {"text": "1 Bedrock Edition\n1.1 Control\n1.2 Tick updates\n1.3 Spawning and despawning\n1.4 Mob cap\n2 Java Edition\n3 References", "bbox": [203.046875, 577.90625, 243, 218]}, {"text": "Bedrock Edition", "bbox": [202.046875, 820.40625, 726, 43]}, {"text": "Control", "bbox": [202.046875, 887.40625, 726, 23]}, {"text": "The simulation distance control appears in the settings page when creating a new world. The values that can be set range from 4 to 12 in increments of 2 (even numbers only).", "bbox": [202.046875, 921.90625, 726, 49]}, {"text": "Tick updates", "bbox": [202.046875, 994.90625, 726, 22]}, {"text": "Simulation distance determines the maximum chunk distance in which entities get updated, and blocks and fluids are ticked. This is not a Euclidean distance, but taxicab distance in Bedrock Edition.", "bbox": [202.046875, 1029.40625, 726, 74]}, {"text": "Spawning and despawning", "bbox": [202.046875, 1126.90625, 726, 22]}, {"text": "Simulation distance restricts the maximum distance at which mobs spawn and despawn.", "bbox": [202.046875, 1161.40625, 726, 49]}, {"text": "The minimum spawning distance is 24 blocks (Euclidean distance) from the player. The maximum spawning distance and despawning distances are determined by the simulation distance, which is a quasi-spherical shell having the following ranges relative to the player:", "bbox": [202.046875, 1234.40625, 726, 74]}, {"text": "Within the simulation distance, there is a 11⁄2000 chance of the mob spawning algorithm attempting to run per chunk, per tick.", "bbox": [202.046875, 1656.78125, 726, 49]}, {"text": "Realms supports only a simulation distance of 4.", "bbox": [202.046875, 1729.78125, 726, 25]}, {"text": "Regardless of simulation distance, mobs with persistence do not despawn, and fish always despawn when they are more than 40 blocks from the nearest player.", "bbox": [202.046875, 1778.28125, 726, 49]}, {"text": "Mob cap", "bbox": [202.046875, 1851.28125, 726, 22]}, {"text": "Mobs in chunks outside a ticking area still count toward the per-mob population control caps as long as they were previously loaded within the simulation distance at some time.", "bbox": [202.046875, 1885.78125, 726, 49]}, {"text": "Java Edition", "bbox": [202.046875, 1958.78125, 726, 43]}, {"text": "In Java Edition, the minimum value of simulation distance is 5. The maximum value is the same as for render distance: 32 for 64-bit Java installs with at least 1 gigabyte of memory, and 16 in all other cases. If render distance is set to a lower value than simulation distance, the lower value is used instead.", "bbox": [202.046875, 2010.78125, 726, 74]}, {"text": "Simulation distance defines a square region of chunks around the player where entities are ticked. Using distance of 6 for instance, entities move normally within a 13x13 chunk column around the player chunk. One more chunk out, within a one-chunk-thick square frame surrounding this region, redstone still runs, fluids flow, and crops grow (subject to normal chunk ticking rules). Beyond that nothing moves or changes. Using a simulation distance of less than 8 may cause hostile mobs to spawn in the outer frame non-entity-ticking chunks as long as the spawn position is still within a 128 block radius sphere around the player; however, because they are not ticked, the mobs do not move or despawn naturally and cannot be killed by command[2], even though they still contribute to the mob cap.[3] They despawn once the player moves more than 128 blocks away.", "bbox": [202.046875, 2108.28125, 726, 196]}, {"text": "Custom Minecraft server software may change these rules, such as making entity-ticking chunks a circular region and not a square.", "bbox": [202.046875, 2328.28125, 726, 49]}, {"text": "The simulation distance setting is ideally less than render distance because updating all entities within the simulation distance is more taxing on performance than the equivalent level of render distance.", "bbox": [202.046875, 2401.28125, 726, 49]}, {"text": "References", "bbox": [202.046875, 2474.28125, 726, 43]}, {"text": "The 96-block horizontal limit is reported as a bug at MCPE-102197", "bbox": [248.046875, 2529.28125, 414, 17]}, {"text": "MC-148494", "bbox": [248.046875, 2553.78125, 76, 17]}, {"text": "MC-2536", "bbox": [248.046875, 2578.28125, 58, 17]}]}