{"metadata": {"url": "https://minecraft.fandom.com/wiki/Featured_servers/Galaxite", "title": "Featured_servers/Galaxite", "time": "16/04/2022 23:14:09"}, "tables": [{"bbox": [624.9375, 902.734375, 300, 268], "headers": {"text": ["Server type", "Address", "Language(s)", "App", "Links"], "bboxes": [[625.9375, 903.734375, 87, 30], [625.9375, 934.765625, 87, 31], [625.9375, 966.796875, 87, 96], [625.9375, 1063.921875, 87, 30], [625.9375, 1094.953125, 87, 74]]}, "cells": {"text": ["Minigames", "play.galaxite.net", "English, Japanese, Italian, Bulgarian, German, Dutch, Indonesian, Spanish, Chinese (Simplified)", "", "Discord: Galaxite Official\nTwitter: @GalaxiteMC\nWebsite: Galaxite"], "bboxes": [[713.9375, 903.734375, 210, 30], [713.9375, 934.765625, 210, 31], [713.9375, 966.796875, 210, 96], [713.9375, 1063.921875, 210, 30], [713.9375, 1094.953125, 210, 74]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/c/c5/Move_arrows.svg", "path": "images/Move arrows.png", "alt_text": "Move arrows", "caption": null, "bbox": [260.53125, 521.234375, 32, 32]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/d/d7/Galaxite.png", "path": "images/Galaxite.png", "alt_text": "Galaxite", "caption": null, "bbox": [699.9375, 748.734375, 150, 150]}], "sprites": [], "texts": [{"text": "Featured servers/Galaxite", "bbox": [202.046875, 353.890625, 593, 45]}, {"text": "Galaxite is a Minecraft Featured Server on Bedrock Edition platform.", "bbox": [202.046875, 703.265625, 726, 49]}, {"text": "Galaxite was first conceptualized by Blockception back in late 2017 during a team meeting, ever since their developers have been hard at work setting up the building blocks for the server's architecture. Blockception has funded and designed all of Galaxite's assets, more information regarding future game modes and assets will be shared in the future.", "bbox": [202.046875, 776.265625, 726, 147]}, {"text": "Contents", "bbox": [215.046875, 963.015625, 81, 17]}, {"text": "1 Mini-Games\n1.1 Core Wars\n1.2 Fill in the Gaps\n1.3 Prop Hunt\n1.4 Chronos: Battle Royale\n1.5 Hyper Racers\n1.5.1 Single\n1.5.2 Battle\n2 Regions and Servers\n3 History\n3.1 Updates\n4 External Links", "bbox": [203.046875, 996.28125, 220, 360]}, {"text": "Mini-Games", "bbox": [202.046875, 1381.28125, 726, 43]}, {"text": "Core Wars", "bbox": [202.046875, 1448.28125, 726, 22]}, {"text": "Core Wars (formerly known as Planets) is Galaxite's very own version of Bedwars but with many unique additions. 4-8 players are individually put onto their own island with a core. It is the player's job to protect their core and eliminate other player's cores. Going inwards towards the center will be smaller islands that the players can build to, and the center contains the largest part of the map.", "bbox": [202.046875, 1482.78125, 726, 98]}, {"text": "Four different kinds of in-game currency can be used in the two shops located on every player island. The first form is iron ingots, which come from the drill on the player's island and can be upgraded with the other two currency stages. The second form of currency is diamonds, which are located on the second-inner level of the map. The third currency is emeralds, which can be found at the center of the map. The fourth form is Core Pieces, which you get by damaging another player's core or eliminating another person in the game. These currencies will allow the player to buy blocks, buffs, and abilities within the game.", "bbox": [202.046875, 1604.78125, 726, 147]}, {"text": "Players will need these currencies to get weapons and tools to destroy other player's cores. If a player dies, they will respawn on their island as long as their core is still alive. Every time they die, the player's core is damaged, and they lose one health bar. If someone is getting spawn-killed, they will enter Annihilation mode, which will allow them to defeat the spawn-camper and continue with the fun of the game. Destroying other players' cores will grant you core pieces and heal your core by two health bars. The last player standing wins!", "bbox": [202.046875, 1775.78125, 726, 123]}, {"text": "Solos, Doubles, Quads are the current versions of Core Wars where players are in teams of one, two or four! Join a party to play with a friend!", "bbox": [202.046875, 1922.28125, 726, 49]}, {"text": "Currently, Core Wars has the following maps:", "bbox": [202.046875, 1995.28125, 726, 24]}, {"text": "Viking\nAztec\nTiny Castle\nNeon\nElven\nCandy\nAtlantis\nMothership\nHalloween\nElder Springs\nPainted Cliffs\nPirates\nNether\nOlympus\nSakura\nRunestars' Breach\nMars", "bbox": [238.046875, 2043.78125, 690, 417]}, {"text": "Fill in the Gaps", "bbox": [202.046875, 2484.28125, 726, 22]}, {"text": "Fill in the Gaps (FTG), is a building-based minigame that has players competing against the clock and each other! At the beginning of each round, a build spawns at the center of the map.  Players are allowed a short amount of time to examine and study the build before it disappears. Players are sent back to their plots, and the same build spawns in front of them, only with a variety of blocks missing. The players must fill those missing blocks before time runs outs. A percentage is displayed to show how much of the build is complete. There are two rounds for each game of FTG. The faster the build is completed, the higher chance you have at winning!", "bbox": [202.046875, 2518.78125, 726, 147]}, {"text": "There's also Solos, Doubles and Quads versions of FTG where players are in teams of one, two or four! Join a party to play with a friend!*", "bbox": [202.046875, 2689.78125, 726, 49]}, {"text": "This game mode has the following maps:", "bbox": [202.046875, 2762.78125, 726, 25]}, {"text": "City\nEgypt\nForest\nPicnic\nFarm\nAtlantis\nWild West\nToy Box\nDining Table\nWinter\nNeon\nZoo", "bbox": [238.046875, 2811.28125, 690, 294]}, {"text": "Prop Hunt", "bbox": [202.046875, 3129.28125, 726, 22]}, {"text": "Prop Hunt is an advanced version of hide-and-seek. Each game, eight hiders are put into a map and given a brief amount of time to hide. They can turn into almost any of the items around them. Once they have found a sneaky place, players can secure their position by not moving for three seconds and will appear as a regular item to the seekers. While hidden, hiders can taunt the seekers for additional points, which comes with a risk of giving away the hiding spot, so use them wisely!", "bbox": [202.046875, 3163.78125, 726, 123]}, {"text": "There are two seekers who hunt the hiders. Once a seeker has successfully spotted and eliminated a hider, the hider becomes a seeker. Around the map, power-up blocks will spawn. Each set off a variety of effects that give advantage to the player. Examples include a hider obtaining quick-step or a seeker giving blindness to hiders. Seekers will win the game if all the hiders are found, but if not, the hiders will claim victory. Over 75 unique models are featured in the game to keep it fresh and fun for all players!*", "bbox": [202.046875, 3310.28125, 726, 122]}, {"text": "This game mode has the following maps:", "bbox": [202.046875, 3456.78125, 726, 49]}, {"text": "Mall\nSchool\nSuburbs\nPark\nTropical resort\nLibrary\nVilla\nMuseum\nHaunted Mansion\nTrain Station", "bbox": [238.046875, 3529.78125, 690, 245]}, {"text": "Chronos: Battle Royale", "bbox": [202.046875, 3798.78125, 726, 23]}, {"text": "Before the game starts, choose from 41 perks to match your play-style! 8-32 players spawn in a 1000x1000 square map. As time goes on, the “Corruption” will come inward and injure you. The longer the game goes, the less area you have to safely wander the map.*", "bbox": [202.046875, 3833.28125, 726, 73]}, {"text": "The goal is simple, be the last player alive!", "bbox": [202.046875, 3930.78125, 726, 25]}, {"text": "Each player is granted a map during the start of the match that will show you where you’re located, where the Time Leader is located, and where Time Warps are summoned.", "bbox": [202.046875, 3979.28125, 726, 49]}, {"text": "There are six different tiers of loot within the shulker boxes, labeled by color. Hundreds of them spawn around the map to give every contestant an equal chance to gain gear and items.", "bbox": [202.046875, 4052.28125, 726, 49]}, {"text": "(Common = White, Uncommon = Green, Rare = Blue, Epic = Purple, Legendary = Orange, Mythic = Red)", "bbox": [202.046875, 4125.28125, 726, 24]}, {"text": "Various things ranging from blocks, bows, arrows, swords and snowballs will appear in the shulker boxes. A few special items will also spawn in them such as: Time Capsules, Time Warps, Upgrade Tokens, bountys, and Vault Keys.", "bbox": [202.046875, 4173.78125, 726, 74]}, {"text": "• Time Capsules allow you to increase your time meter just by simply right clicking the item with it in your hand.", "bbox": [202.046875, 4271.28125, 726, 24]}, {"text": "• Vault Keys open up a vault with a mythic chest in it. The vault will be marked on your map if you have a key in your inventory to help navigate.", "bbox": [202.046875, 4319.78125, 726, 49]}, {"text": "• Place a Time Warp on the ground and wait 30 seconds before a mythic chest spawns at that location. But beware! The location is visible to all players once you place the Time Warp down.", "bbox": [202.046875, 4392.78125, 726, 49]}, {"text": "• Upgrade any item in your inventory with the Upgrade Token at the corresponding upgrade station.", "bbox": [202.046875, 4465.78125, 726, 25]}, {"text": "use bountys to track players! when your bounty target is killed slain by you, you'll get 60 seconds of extra time", "bbox": [238.046875, 4514.28125, 690, 49]}, {"text": "You can stop at Jam’s Time Shop, located at various locations around the map. You can buy and sell items using your time as a currency.", "bbox": [202.046875, 4581.28125, 726, 49]}, {"text": "Stop at an upgrade station to combine duplicate items and upgrade their efficiency! They vary in form such as ranged, armor, and melee weapon upgrade stations. Note: the items in which you are attempting to enhance must be of the same rarity.", "bbox": [202.046875, 4654.28125, 726, 73]}, {"text": "If your time happens to expire, do not fear! You can gain more time from eliminating enemy players, but this share also cycles backwards, so if you are to be slain, your time will be transmitted to the player who eliminated you. The further into the game, the higher the stakes when losing time. You can also get time by using Time Capsules. The player with the most time is titled the Time Leader, and is displayed on the map for everyone to see as a red player marker.", "bbox": [202.046875, 4751.78125, 726, 123]}, {"text": "Once you lose all your time, you’ll no longer respawn. The last player remaining wins!* Solos and Doubles are the current versions of Chronos where players are in teams of one or two, Join a party to play with a friend!*", "bbox": [202.046875, 4898.28125, 726, 49]}, {"text": "This game currently has one map:", "bbox": [202.046875, 4971.28125, 726, 24]}, {"text": "Chronos", "bbox": [238.046875, 5019.78125, 690, 25]}, {"text": "Hyper Racers", "bbox": [202.046875, 5068.28125, 726, 22]}, {"text": "Single", "bbox": [202.046875, 5108.78125, 726, 20]}, {"text": "See who's the fastest in this unique racing game! Collect power-ups and use abilities against your opponents as you race through one of our many themed maps. Keep an eye out for scraps scattered throughout the track, you can grab those to upgrade your kart. Be the first across the finish line to claim your victory!*", "bbox": [202.046875, 5137.78125, 726, 74]}, {"text": "This game has the following maps:", "bbox": [202.046875, 5235.28125, 726, 24]}, {"text": "Alpine Speedway\nCanyon Rush\nInformation Highway\nNeon City\nSunset Temple\nGolden Plaza", "bbox": [238.046875, 5283.78125, 690, 147]}, {"text": "Battle", "bbox": [202.046875, 5448.78125, 726, 20]}, {"text": "This is a special game mode where, instead of racing, players drive around a map to collect power-ups and hit other players! The person with the most hits wins!*", "bbox": [202.046875, 5477.78125, 726, 49]}, {"text": "This game has the following maps:", "bbox": [202.046875, 5550.78125, 726, 25]}, {"text": "Plaza\nMesa Pit\nKoi Park *description is from galaxite.net", "bbox": [238.046875, 5599.28125, 690, 73]}, {"text": "Regions and Servers", "bbox": [202.046875, 5696.78125, 726, 43]}, {"text": "Galaxite currently runs on servers from two regions.", "bbox": [202.046875, 5748.78125, 726, 25]}, {"text": "Europe (EU)\nNorth America (NA)\nAsia (AS) (Coming Soon)", "bbox": [238.046875, 5797.28125, 690, 73]}, {"text": "History", "bbox": [202.046875, 5888.78125, 726, 43]}, {"text": "Released Season 3 and added a new game: Hyper Racers (2/23/21)", "bbox": [202.046875, 5940.78125, 726, 25]}, {"text": "Changed Planets to Core Wars and Chronos to Chronos: Battle Royale (11/12/20)", "bbox": [202.046875, 5989.28125, 726, 24]}, {"text": "Updates", "bbox": [202.046875, 6037.78125, 726, 23]}, {"text": "Find the whole change log on the updates section.", "bbox": [202.046875, 6072.28125, 726, 24]}, {"text": "Disclaimer: Galaxite is very glitchy and you can get kicked for no reason at times.", "bbox": [202.046875, 6120.78125, 726, 25]}, {"text": "One of the most common glitches is on the Battle Royale, in which you can try to upgrade a bow while you have it equipped, and it will kick you. Developers are trying to fix these glitches while they can, and so don't leave bad reviews on reviews websites for the server, instead, do this: Tweet tagging @GalaxiteMC about the glitch that you found, and they will probably see your Tweet.", "bbox": [202.046875, 6169.28125, 726, 98]}, {"text": "External Links", "bbox": [202.046875, 6291.28125, 726, 43]}, {"text": "Official Galaxite wiki: Galaxite MCBE Wiki | Fandom", "bbox": [202.046875, 6343.28125, 726, 24]}]}