{"metadata": {"url": "https://minecraft.fandom.com/wiki/Minecraft:_The_Crash/3CHP", "title": "Minecraft:_The_Crash/3CHP", "time": "17/04/2022 05:36:09"}, "tables": [], "images": [], "sprites": [], "texts": [{"text": "Minecraft: The Crash/3CHP", "bbox": [202.046875, 349.5, 593, 45]}, {"text": "Contents", "bbox": [215.046875, 589.9375, 81, 17]}, {"text": "1 Chapter 19\n2 Chapter 20\n3 Chapter 21\n4 Chapter 22\n5 Chapter 23\n6 Chapter 24\n7 Chapter 25\n8 Chapter 26\n9 Chapter 27", "bbox": [203.046875, 623.203125, 145, 275]}, {"text": "Chapter 19", "bbox": [202.046875, 922.703125, 726, 22]}, {"text": "Bianca and Lonnie enter the Nether, but soon become stuck after a ghast shoots a fireball at the portal. The two have no choice but to run. Eventually, they stumble into Anton, who gives Bianca some armor, and the trio meet up with Esme, fending off some zombie pigmen.", "bbox": [202.046875, 957.203125, 726, 74]}, {"text": "Chapter 20", "bbox": [202.046875, 1054.703125, 726, 22]}, {"text": "Anton attempts to talk to Bianca about the car crash, but she decides to kill some zombie pigmen instead. Esme has a slight change of plans, and the group head over to a nether fortress.", "bbox": [202.046875, 1089.203125, 726, 49]}, {"text": "Chapter 21", "bbox": [202.046875, 1162.203125, 726, 23]}, {"text": "On the way to the fortress, the group run into wither skeletons, but successfully arrive at the fortress. The group split up to see if a blaze spawner is present. Eventually, Bianca and Esme find the spawner, and kill the blaze that spawns from it, obtaining a blaze rod. The fortress begins to collapse as the group reunites, so they have no choice but to escape.", "bbox": [202.046875, 1196.703125, 726, 98]}, {"text": "Chapter 22", "bbox": [202.046875, 1318.703125, 726, 22]}, {"text": "The group successfully escape from the collapsing fortress, and Bianca replenishes herself with enchanted golden apples. As Esme builds a portal back to the Overworld, the rest of the group fend off some ghasts. The group then leaves the Nether through the portal.", "bbox": [202.046875, 1353.203125, 726, 74]}, {"text": "Chapter 23", "bbox": [202.046875, 1450.703125, 726, 22]}, {"text": "Upon returning to the Overworld, the group stumble upon an endermen with a white scar, but ignore it and prepare for the End. The group then stumble upon a ship not seen in the vanilla game, which turns out to be filled with endermen. The group attack the endermen and destroy the ship with TNT.", "bbox": [202.046875, 1485.203125, 726, 74]}, {"text": "Chapter 24", "bbox": [202.046875, 1582.703125, 726, 22]}, {"text": "The group escape the wreckage by boat. Anton and Esme realize that the endermen with white scars were created by Bianca’s brain synapses, and attempt to talk to her about the car crash and what happened to Lonnie. Bianca refuses, saying that they need to get to the End. The group stack up on potions, weapons, food, and armor, and successfully find a stronghold.", "bbox": [202.046875, 1617.203125, 726, 98]}, {"text": "Chapter 25", "bbox": [202.046875, 1739.203125, 726, 23]}, {"text": "The group explore the stronghold whilst fending off several silverfishes. Eventually, they make it to the end portal room, create the portal, and enter the End.", "bbox": [202.046875, 1773.703125, 726, 49]}, {"text": "Chapter 26", "bbox": [202.046875, 1846.703125, 726, 22]}, {"text": "As Bianca jumps through the portal, she realizes that nobody has checked on Lonnie in real life because he wasn’t checked into the children’s ward or the trauma ward. She then realizes her mistake; she held up her phone showing something that she was doing in Minecraft that distracted Lonnie from driving, causing the car crash. The group then arrive in the End, and soon after, an ender dragon spawns. As the group prepare to fight it, Bianca has another flashback to the playground. Lonnie is there, but with a cast on his right arm; an injury sustained from when he attempted to catch Bianca on the playground. Lonnie teaches Bianca a bit more about Minecraft, and Bianca apologizes to Lonnie for what happened. The group has a plan regarding the ender dragon; Bianca will distract it while Anton and Esme go after the end crystals. Eventually all the crystals are broken, and the group prepare to defeat the ender dragon.", "bbox": [202.046875, 1881.203125, 726, 221]}, {"text": "Chapter 27", "bbox": [202.046875, 2125.703125, 726, 22]}, {"text": "Eventually, Bianca herself successfully defeats the ender dragon and enters the exit portal. At about the same time, the VR goggles are taken off her head. Esme, Anton, and A.J. were standing beside her hospital bed. Bianca questions A.J. about why he showed her the game in the first place, and A.J. says that it’s because the game helped him overcome his fears of being in the hospital. A.J. also says that he knew the news about Lonnie, so he figured that he would show Bianca the VR goggles to make sure that she was prepared for it. Sadly, Lonnie was killed in the car crash, but Bianca understands that her new friends would help her power through everything.", "bbox": [202.046875, 2160.203125, 726, 147]}]}