{"metadata": {"url": "https://minecraft.fandom.com/wiki/Far_Lands", "title": "Far_Lands", "time": "16/04/2022 23:41:36"}, "tables": [{"bbox": [202.046875, 2856.90625, 725, 882], "headers": {"text": ["Noise generator", "Breaks down at...\n(32-bit)", "Version range", "Notes", "First", "Last", "Low noise", "High noise", "Selector noise", "Depth noise", "Scale noise", "Classic world noise", "Island carver noise", "Soil depth", "Sand beaches", "Gravel beaches"], "bboxes": [[202.546875, 2857.40625, 103, 80], [305.984375, 2857.40625, 117, 80], [423.46875, 2857.40625, 285, 40], [707.625, 2857.40625, 219, 80], [423.46875, 2897.453125, 199, 40], [621.796875, 2897.453125, 86, 40], [202.546875, 2937.5, 103, 31], [202.546875, 2968.59375, 103, 31], [202.546875, 2999.6875, 103, 55], [202.546875, 3055.28125, 103, 153], [202.546875, 3208.875, 103, 55], [202.546875, 3264.46875, 103, 55], [202.546875, 3320.0625, 103, 129], [202.546875, 3449.15625, 103, 80], [202.546875, 3529.25, 103, 104], [202.546875, 3633.84375, 103, 104]]}, "cells": {"text": ["12,550,824", "inf-20100327", "present[n 1]", "Jointly responsible for the Far Lands", "1,004,065,924", "inf-20100327", "present[n 1]", "Responsible for the Farther Lands", "42,949,672", "[more information needed]", "present[n 1]", "Causes the terrain to rise up several blocks.\n\"Stretching effects\" are rare.\nImpossible to see unless made to start before low and high noise overflow.", "7,662,742,722", "[more information needed]", "Beta 1.7.3", "Superseded by biome-based terrain height in Beta 1.8.", "33,554,432", "probably the first version that generated terrain", "inf-20100325", "Causes the famous \"stone wall\" of Infdev.", "933,688,542", "[more information needed]", "in-20100223", "Used to create Floating maps in Indev.\nDue to their limited world size,\nthis breaks far beyond what can generate.", "34,359,738,368", "[more information needed]", "present[n 1]", "Causes large regions of exposed stone in earlier versions,\nor gravel in later versions.", "68,719,476,736", "[more information needed]", "Beta 1.7.3", "Determines whether beaches use sand or not.\nIn the Nether, this controls soul sand.", "68,719,476,736", "[more information needed]", "Beta 1.7.3", "Determines whether beaches use gravel or not.\nAlso exists in the Nether for gravel."], "bboxes": [[305.984375, 2937.5, 117, 62], [423.46875, 2937.5, 199, 62], [621.796875, 2937.5, 86, 62], [707.625, 2937.5, 219, 62], [305.984375, 2999.6875, 117, 55], [423.46875, 2999.6875, 199, 55], [621.796875, 2999.6875, 86, 55], [707.625, 2999.6875, 219, 55], [305.984375, 3055.28125, 117, 153], [423.46875, 3055.28125, 199, 153], [621.796875, 3055.28125, 86, 153], [707.625, 3055.28125, 219, 153], [305.984375, 3208.875, 117, 55], [423.46875, 3208.875, 199, 55], [621.796875, 3208.875, 86, 55], [707.625, 3208.875, 219, 55], [305.984375, 3264.46875, 117, 55], [423.46875, 3264.46875, 199, 55], [621.796875, 3264.46875, 86, 55], [707.625, 3264.46875, 219, 55], [305.984375, 3320.0625, 117, 129], [423.46875, 3320.0625, 199, 129], [621.796875, 3320.0625, 86, 129], [707.625, 3320.0625, 219, 129], [305.984375, 3449.15625, 117, 80], [423.46875, 3449.15625, 199, 80], [621.796875, 3449.15625, 86, 80], [707.625, 3449.15625, 219, 80], [305.984375, 3529.25, 117, 104], [423.46875, 3529.25, 199, 104], [621.796875, 3529.25, 86, 104], [707.625, 3529.25, 219, 104], [305.984375, 3633.84375, 117, 104], [423.46875, 3633.84375, 199, 104], [621.796875, 3633.84375, 86, 104], [707.625, 3633.84375, 219, 104]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/0/00/DAB_list.svg", "path": "images/DAB list.png", "alt_text": "DAB list", "caption": null, "bbox": [216.046875, 742.25, 20, 15]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/b/bc/Brush.png", "path": "images/img.png", "alt_text": "", "caption": null, "bbox": [260.53125, 3881.53125, 32, 32]}], "sprites": [], "texts": [{"text": "Far Lands", "bbox": [202.046875, 353.890625, 593, 45]}, {"text": "The Far Lands is a terrain generation bug that appears when the noise generators responsible for creating the shape of terrain stop functioning properly. This results in a large, spongy wall of terrain appearing around 12,550,821 blocks from the origin of the Minecraft world.", "bbox": [202.046875, 418.890625, 726, 74]}, {"text": "Currently, across all currently-developed editions, the Far Lands only occur either in older versions of the game or via modding to remove the patches which prevent them from occurring.", "bbox": [202.046875, 516.390625, 726, 49]}, {"text": "The Far Lands still retain a legacy as one of the franchise's most famous glitches, even being referenced in other official games such as Minecraft: Story Mode and Super Smash Bros. Ultimate.", "bbox": [202.046875, 589.390625, 726, 49]}, {"text": "Bedrock Edition Far Lands\nJava Edition Far Lands", "bbox": [238.046875, 662.390625, 690, 49]}, {"text": "Contents", "bbox": [215.046875, 834.140625, 81, 17]}, {"text": "1 General information\n1.1 What the Far Lands are not\n1.2 Types of Far Lands\n1.3 Fandom\n2 References", "bbox": [203.046875, 867.40625, 242, 161]}, {"text": "General information", "bbox": [202.046875, 1052.90625, 726, 43]}, {"text": "What the Far Lands are not", "bbox": [202.046875, 1119.90625, 726, 23]}, {"text": "Due to many occurrences at high distance being lumped together with each other, confusion often arises as to what is related to or caused by the Far Lands, and what is not. The following is a list of things which are commonly misattributed to being a product, effect or even type of the Far Lands, despite not being so.", "bbox": [202.046875, 1154.40625, 726, 73]}, {"text": "Precision loss errors are not caused by the Far Lands", "bbox": [202.046875, 1251.90625, 726, 25]}, {"text": "The position where the world appears to render is considerably offset at the point where the Far Lands begin in Beta 1.7.3 and earlier, with a magnitude of one block, with the player appearing to be at the edges and corners of blocks at all times.", "bbox": [202.046875, 1276.40625, 726, 73]}, {"text": "However, this is purely a floating-point bug, and exists whether or not the Far Lands themselves do. This can be demonstrated by the following:", "bbox": [202.046875, 1373.90625, 726, 49]}, {"text": "Noticing that the precision loss is a gradual change, which increases at each power of 2. This is in stark contrast to the Far Lands, which happen immediately due to integer overflow.\nBackporting a Superflat world (with flat terrain where the Far Lands would be) from 1.1 to Beta 1.7.3, and noticing that the effect persists in said version, proving that it's clearly not linked to terrain. While Far Lands chunks will still generate outside of what superflat chunks were generated in 1.1, these still are unrelated.\nModding the game can be done to either patch out this precision loss issue or the Far Lands individually. This proves their existence to be completely independent.\nGenerating the Far Lands in any version between the March 27 and June 18 builds of Infdev inclusive. Whereas the Far Lands clearly generate in these versions, the precision loss bug was first introduced in the June 24th build.", "bbox": [238.046875, 1446.90625, 690, 245]}, {"text": "This is also true of every other precision loss bug, especially those which were not fixed in Beta 1.8 and persisted into later versions after the Far Lands were removed in said version, demonstrating that they are two completely different things which are only associated with each other due to happening at high distances.", "bbox": [202.046875, 1709.90625, 726, 74]}, {"text": "The Stripe Lands are not a type of Far Lands", "bbox": [202.046875, 1807.40625, 726, 24]}, {"text": "The Stripe Lands, a mostly Bedrock Edition-exclusive phenomenon which can only be seen in Java Edition through extensive modding, are another example of floating-point precision loss, and are not a terrain bug.", "bbox": [202.046875, 1831.90625, 726, 49]}, {"text": "Fake chunks are not caused by the Far Lands", "bbox": [202.046875, 1904.90625, 726, 25]}, {"text": "\"Fake\" chunks at the world boundary are another anomaly that happens at high distances. Occurring considerably past the Far Lands' beginning, they are commonly said to be a \"part\" or \"layer\" of the Far Lands. While they are among the interesting effects which can be experienced when moving high distances from the world origin, their occurrence is a distinct phenomenon, and, to an extent, actually intended. This is further reinforced by them being at a rather round number (32 million), rather than the seemingly overall arbitrary 12,550,824 of the Far Lands, or power-of-two values such as 16,777,216 where precision loss worsens.", "bbox": [202.046875, 1929.40625, 726, 147]}, {"text": "It is likely that them occurring past the Far Lands is accidental. Their original positioning at 32,000,000 was likely done to make the Far Lands, then at 33,554,432, inaccessible without modifying the game. However, when terrain generation was redone, the Far Lands moved closer to their familiar position of 12,550,824, despite the boundary remaining at 32,000,000, meaning that the Far Lands were once more accessible, with the boundary no longer making them inaccessible as intended; it is likely that Notch would not have thought to check this at the time due to the distances being ludicrous. Fake chunks beginning in Alpha v1.2.0 (as opposed to the void seen in prior versions) are also likely unintentional, probably arising due to changes in chunk handling for biomes, the Nether, or both, and would have presumably also flown under the radar given their inaccessibility in normal gameplay without external editors.", "bbox": [202.046875, 2100.40625, 726, 220]}, {"text": "Hard limits are not caused by the Far Lands", "bbox": [202.046875, 2344.90625, 726, 25]}, {"text": "While the Far Lands themselves are technically a hard limit due to arising from integer overflow, they are treated solely as a terrain phenomenon, and the game still functions fine with them. Integer overflows in other cases such as player position are much more dangerous and much harder to reach, and are considered separately.", "bbox": [202.046875, 2369.40625, 726, 73]}, {"text": "Types of Far Lands", "bbox": [202.046875, 2466.90625, 726, 23]}, {"text": "The Far Lands comprise a very, very wide array of terrain generation bugs. The effects vary depending on which noise generator breaks (for traditional Far Lands, \"low noise\" and \"high noise\" are jointly responsible), as well as the player's distance on each axis (the \"Edge Far Lands\" refer to when noise breaks on only one axis, the \"Corner Far Lands\" on two, and the \"Vertex Far Lands\" on three).", "bbox": [202.046875, 2501.40625, 726, 98]}, {"text": "Other noise generators are capable of breaking down. Selector noise, a noise generator which determines whether low noise or high noise is used at a given position in the world, breaks down 80 times further than low and high noise by default, giving rise to what is known as the \"Farther Lands\".", "bbox": [202.046875, 2623.40625, 726, 73]}, {"text": "A full list of Java Edition noise generators known to break down and give rise to their own unique effects, many of which require mods to see, is as follows. Note that it assumes that the X and Z axes are identical, and ignores the Y axis; in many cases, the Y axis has a different value from the X and Z axes, whereas in other cases the noise generator is entirely 2D.", "bbox": [202.046875, 2720.90625, 726, 98]}, {"text": "No longer overflows within vanilla bounds as of Beta 1.8 Pre-release, but can be forced to break via mods", "bbox": [238.046875, 3761.9375, 672, 41]}, {"text": "Fandom", "bbox": [202.046875, 3831.9375, 726, 23]}, {"text": "One player known as KilloCrazyMan is known to have walked to the Far Lands in vanilla Minecraft, beginning the journey in September 2019 and reaching them nine months later in June 2020. Upon arrival, a USD$10,000 donation was awarded to him by Notch for his efforts.[1]", "bbox": [202.046875, 3942.625, 726, 73]}, {"text": "In Bedrock Edition, the Far Lands were first introduced with the infinite terrain generation in 0.9.0 alpha, and were removed in 1.17.30 (beta 1.17.20.20).", "bbox": [202.046875, 4040.125, 726, 49]}, {"text": "References", "bbox": [202.046875, 4113.125, 726, 43]}, {"text": "KilloCrazyMan's Far Lands stream archive on YouTube", "bbox": [248.046875, 4168.125, 341, 17]}]}