{"metadata": {"url": "https://minecraft.fandom.com/wiki/Minecraft_(disambiguation)", "title": "Minecraft_(disambiguation)", "time": "17/04/2022 01:13:16"}, "tables": [], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/fd/Disambig_color.svg", "path": "images/Disambig color.png", "alt_text": "Disambig color", "caption": null, "bbox": [216.046875, 1910.875, 20, 15]}], "sprites": [], "texts": [{"text": "Minecraft (disambiguation)", "bbox": [202.046875, 349.5, 593, 45]}, {"text": "Minecraft typically refers to the game in general. It may also refer to:", "bbox": [202.046875, 414.5, 726, 25]}, {"text": "Contents", "bbox": [215.046875, 478.75, 81, 17]}, {"text": "1 Editions\n2 Other games\n3 Miscellaneous\n4 Other uses", "bbox": [203.046875, 512.015625, 145, 132]}, {"text": "Editions", "bbox": [202.046875, 669.015625, 726, 43]}, {"text": "Main article: Edition", "bbox": [216.046875, 721.015625, 712, 24]}, {"text": "Java Edition: the original edition for Windows, macOS, and Linux.\nBedrock Edition: the edition for mobile (Android, iOS, iPadOS, and Fire), Windows, Xbox One, PlayStation 4, and Nintendo Switch.\nLegacy Console Edition: the discontinued edition for various consoles (Xbox 360, Xbox One (legacy version), PlayStation 3, PlayStation 4 (legacy version), PlayStation Vita, Wii U, and Nintendo Switch (legacy version)).\nPi Edition: the discontinued edition for the Raspberry Pi.\nEducation Edition: the edition for classrooms.\nChina Edition: the edition for mainland China.\nNew Nintendo 3DS Edition: the discontinued edition for the New Nintendo 3DS/2DS systems.", "bbox": [238.046875, 752.515625, 690, 221]}, {"text": "Other games", "bbox": [202.046875, 997.015625, 726, 43]}, {"text": "Demo: the Minecraft demo versions.\nMinecraft 4k: a under 4 kibibytes version of the game made for the 2010 Java 4K contest.\nMinecraft: Story Mode: the narrative-driven video game.\nMinecraft: Story Mode - Season Two: the sequel to Minecraft: Story Mode.\nMinecraft Earth: a discontinued augmented reality (AR) mobile game spin-off.\nMinecraft Dungeons: an action/adventure role-playing video game spin-off.\nMinecraft Dungeons Arcade: an arcade adaptation of Minecraft Dungeons.", "bbox": [238.046875, 1049.015625, 690, 201]}, {"text": "Miscellaneous", "bbox": [202.046875, 1268.515625, 726, 43]}, {"text": "Minecraft (franchise): the Minecraft franchise.\nMinecraft Launcher: the game downloader and launcher for Java Edition and one of the game downloaders and launchers for Bedrock Edition and Minecraft Dungeons.\nMinecraft Dungeons Launcher: was one of the game downloaders and launchers for Minecraft Dungeons.\n.minecraft: the game data folder.\nMinecraft Music: the soundtrack name for one of the music tracks in the game.\nMinecraft 2.0: a joke update made for April Fools 2013.\nMinecraft: The Movie: an upcoming Swedish–American film due for an unknown release.\nMinecraft: an advancement by getting a crafting table in your inventory.\nMinecraft Magazine: the official magazine of Minecraft.\nMinecraft (Dark Horse Comics): a graphic novel series based on the video game.\nMinecraft Hour of Code: a tutorial designed to introduce the player to programming logic.\nMinecraft Books: a series of guidebooks for Minecraft.\nMinecraft Plus!: a screensaver app and website for an April Fools 2021 joke.\nMinecraft (Step into Reading series): a children's book series based on the video game.\nMinecraft: Builders & Biomes: a board game published by Mojang Studios and Ravensburger.\nMinecraft Card Game: a card game published by Mojang Studios and Mattel Games.", "bbox": [238.046875, 1320.515625, 690, 465]}, {"text": "Other uses", "bbox": [202.046875, 1803.515625, 726, 43]}, {"text": "Minecraft.net: Official website for Minecraft.", "bbox": [238.046875, 1855.515625, 690, 25]}]}