{"metadata": {"url": "https://minecraft.fandom.com/wiki/Minecraft:_Story_Mode/Gameplay", "title": "Minecraft:_Story_Mode/Gameplay", "time": "17/04/2022 02:04:35"}, "tables": [], "images": [], "sprites": [], "texts": [{"text": "Minecraft: Story Mode/Gameplay", "bbox": [202.046875, 347, 593, 45]}, {"text": "Minecraft: Story Mode is an episodic point-and-click narrative-driven graphic adventure video game similar to Telltale's previous titles such as Tales from the Borderlands. The player is able to collect items, solve puzzles, and talk to non-player characters though conversation trees to learn about the story and determine what to do next. Like other Telltale Games, decisions that the player makes have an impact on story elements in future episodes.[1] However, unlike Telltale's previous games that carry more mature or emotional overtones including the death of major characters, Story Mode is known as a family-friendly title, so the decisions are still pivotal and emotional but do not involve mature imagery or themes.[1] Elements of crafting and building, central to Minecraft, are included in the gameplay, following a similar approach.[1] The game features combat and other action sequences, carried out through both quick time events similar to Telltale's other episodic games, and more arcade-like controls, such as steering around debris on a road.[2][3] The game also mixes new characters with original themes to make an entirely original Minecraft experience.", "bbox": [202.046875, 436.5, 726, 270]}, {"text": "References", "bbox": [202.046875, 730, 726, 43]}, {"text": "\"Giving Minecraft a story\" by Andrew Webster – The Verge, August 26, 2015.", "bbox": [275.046875, 785, 477, 17]}, {"text": "\"PAX 2015: Minecraft Vet, Rookie Each Play Telltale's Minecraft: Story Mode\" by Jared Petty and Ryan McCafferty – IGN, August 28, 2015.", "bbox": [238.046875, 809.5, 651, 41]}, {"text": "\"Minecraft: Story Mode: A chip off the old block\" by Jeffrey Matulef – Eurogamer, September 9, 2015.", "bbox": [248.046875, 858.5, 635, 17]}]}