{"metadata": {"url": "https://minecraft.fandom.com/wiki/Minecraft:_The_Voyage/2CHP", "title": "Minecraft:_The_Voyage/2CHP", "time": "17/04/2022 05:04:31"}, "tables": [{"bbox": [202.046875, 793.015625, 380, 128], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* Stax makes an aquatic discovery\n* A hated food from childhood gets reconsidered\n* Remedial tool use\n* Laughter in the dark", "„"], "bboxes": [[204.046875, 795.015625, 27, 124], [233.140625, 795.015625, 318, 124], [553.140625, 795.015625, 27, 124]]}}, {"bbox": [202.046875, 1236.515625, 359, 153], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* Stax puts his father’s lessons to work\n* A reluctant decision and several promises\n* The science of making weapons on a beach\n* A brief aside about the nature of storytelling\n* A melancholy nighttime chorus", "„"], "bboxes": [[204.046875, 1238.515625, 27, 149], [233.140625, 1238.515625, 297, 149], [532.140625, 1238.515625, 27, 149]]}}, {"bbox": [202.046875, 1606.515625, 311, 153], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* Fatherly advice, imperfectly recalled\n* A camp on another loathsome shore\n* The library of dreams\n* Alone on the Sea of Sorrows\n* A light in the darkness", "„"], "bboxes": [[204.046875, 1608.515625, 27, 149], [233.140625, 1608.515625, 249, 149], [484.140625, 1608.515625, 27, 149]]}}, {"bbox": [202.046875, 2148.015625, 287, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* Things that go thump in the light\n* Strange fish\n* A familiar destination", "„"], "bboxes": [[204.046875, 2150.015625, 27, 100], [233.140625, 2150.015625, 225, 100], [460.140625, 2150.015625, 27, 100]]}}, {"bbox": [202.046875, 2444.515625, 267, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* A decision made\n* An unexpected green country\n* A cabin and a riddle", "„"], "bboxes": [[204.046875, 2446.515625, 27, 100], [233.140625, 2446.515625, 205, 100], [440.140625, 2446.515625, 27, 100]]}}, {"bbox": [202.046875, 2790.015625, 253, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* Meeting Ramoa\n* Stax must choose\n* A disagreement in the night", "„"], "bboxes": [[204.046875, 2792.015625, 27, 100], [233.140625, 2792.015625, 191, 100], [426.140625, 2792.015625, 27, 100]]}}, {"bbox": [202.046875, 3331.015625, 304, 177], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* A peace offering\n* Introduction to a busy town\n* An unwelcome reunion\n* The sights and sounds of the fair\n* Tumbles Harbor, considered\n* A visit to the mine, with free advice", "„"], "bboxes": [[204.046875, 3333.015625, 27, 173], [233.140625, 3333.015625, 242, 173], [477.140625, 3333.015625, 27, 173]]}}, {"bbox": [202.046875, 3823.515625, 237, 104], "headers": {"text": [], "bboxes": []}, "cells": {"text": ["“", "* Brubbs and Xinxi\n* The right tool for the job\n* Mrs. Taney has questions", "„"], "bboxes": [[204.046875, 3825.515625, 27, 100], [233.140625, 3825.515625, 175, 100], [410.140625, 3825.515625, 27, 100]]}}], "images": [], "sprites": [], "texts": [{"text": "Minecraft: The Voyage/2CHP", "bbox": [202.046875, 313, 593, 45]}, {"text": "Contents", "bbox": [215.046875, 442.25, 81, 17]}, {"text": "1 Chapter 9: Gifts from the Sea\n2 Chapter 10: Back to Sea\n3 Chapter 11: A Perilous Journey\n4 Chapter 12: Guardians of the Light\n5 Chapter 13: A New Direction\n6 Chapter 14: The Caravan\n7 Chapter 15: Tumbles Harbor\n8 Chapter 16: Three Curious Characters", "bbox": [203.046875, 475.515625, 292, 246]}, {"text": "Chapter 9: Gifts from the Sea", "bbox": [202.046875, 746.515625, 726, 23]}, {"text": "Stax wakes up as soon as daybreak hits. His belly rumbles from starvation. Stax climbs up to the top of the hill, only seeing desert for miles on end. He turns around, facing the sea, and notices kelp beneath the water. Suddenly, Stax has a flashback to his childhood: his father once gave him a chunk of dried kelp to bite on, but Stax soon spat it out due to the salty aftertaste. Nonetheless, Stax forgets about the flashback and retrieves some kelp from a kelp stalk. He then looks back out to sea and notices something glinting in the sunlight. Delighted, Stax swims out to it, astonished that it is a compass. Though he has thoughts of trying to head home now, he instead decides to rest in the stone tower for the night. Stax crafts a wood pickaxe to mine some stone, and then uses the stone to craft a furnace. From there, he uses sticks as fuel to cook the kelp into dried kelp and cautiously eats it. By nightfall, Stax had eaten six pieces of dried kelp and cooked a dozen extra for tomorrow. Although some drowned greet him outside the tower, he laughs them off and soon falls asleep.", "bbox": [202.046875, 921.015625, 726, 245]}, {"text": "Chapter 10: Back to Sea", "bbox": [202.046875, 1190.015625, 726, 22]}, {"text": "By morning, Stax begins crafting a boat. Whilst doing this, he has flashbacks to his grandmother and father: Stax’s grandmother hated boats, saying that they were \"both dangerous and a waste of time\", while his father loved them, saying that he had \"been comfortable in them\" and even taught Stax how to craft one. Nonetheless, Stax crafts a boat, but soon realizes that it’s already too late in the day to begin heading home. Sighing, he instead uses the rest of the day to craft a wood sword, and retreats into the stone tower by nightfall, falling asleep moments later.", "bbox": [202.046875, 1389.015625, 726, 147]}, {"text": "Chapter 11: A Perilous Journey", "bbox": [202.046875, 1560.015625, 726, 22]}, {"text": "Stax wakes up the following morning and quickly prepares to leave. He eats some dried kelp, and puts his bed and compass into his inventory, along with some wood planks and stone. Soon after, he leaves on his boat, and decides to begin swimming in the opposite direction of the compass. Eventually, by nightfall, Stax stops at an abandoned stone building on a shore, plopping down his bed and falling asleep immediately. He continues his journey back home the next morning, but soon remembers that he’ll be going through an area of water where there’ll be no land to be seen in any direction, a.k.a the Sea of Sorrows. Stax slowly stops his boat, understanding that it wouldn’t be wise to head there by nightfall. Instead, he turns and rows toward an island to the south of him, building a cabin big enough for his bed. Stax falls asleep soon after, dreaming that he is in a library, eventually finding a map room which has a map of his home, but upon picking up the map, it quickly disintegrates. He quickly wakes up from his dream, shaking his head over it, and gets back in his boat soon after. Stax eventually makes it to the Sea of Sorrows, and decides to row westward for a while. Eventually, he rows to the north as it becomes night. Tired from rowing, he slumps over the oars, falling asleep. The next morning, Stax resumes rowing northward, with no land in sight. By nightfall, he begins to notice a glimmer of light in the distance.", "bbox": [202.046875, 1759.015625, 726, 318]}, {"text": "Chapter 12: Guardians of the Light", "bbox": [202.046875, 2101.515625, 726, 23]}, {"text": "Stax decides to head closer to the glimmer of light, and soon notices that it’s actually underwater, revealing it to be an ocean monument. Something bumps his boat from underneath, startling him. Upon further inspection, it is a guardian, who zaps Stax from underwater. He quickly rows away from the monument, falling asleep soon after. The next morning, he continues to row northward, eventually making it back to the stone tower that he had left from just a few days ago.", "bbox": [202.046875, 2251.515625, 726, 123]}, {"text": "Chapter 13: A New Direction", "bbox": [202.046875, 2398.015625, 726, 22]}, {"text": "Stax wastes no time getting to work. He rebuilds his crafting table and furnace, gathers additional kelp, and repairs his boat. Stax hatched a new plan: seeing as Fouge stole Stax’s father’s maps, it would be best to head in the direction that Fouge went. By the next morning, he headed in the direction the compass was pointing, eventually leading him to an area of green hills with several trees. Stax puts the boat to shore, and soon notices some sheep on a nearby hill. He kills one of them with his wooden sword, and feasts on the mutton it dropped. Stax then makes a cabin and looks around his surroundings, hoping to find exposed iron deposits or creepers, but the area had nothing but flowers and trees. By nightfall, he enters the cabin and falls asleep.", "bbox": [202.046875, 2548.015625, 726, 171]}, {"text": "Chapter 14: The Caravan", "bbox": [202.046875, 2743.515625, 726, 23]}, {"text": "By morning, Stax awakens to the sounds of bells, animals, and most importantly, other people talking. He quickly puts his bed into his inventory, puts his wooden sword in his hand for defense, and hurries off toward the sounds. Approaching slowly, Stax notices a caravan, consisting of wolves, sheep, and several people. Just then, two bearded men, Ritzo and Chigam, approach Stax, and ask who he is. Ramoa then introduces herself to Stax, who explains that her caravan is heading to Tumbles Harbor, a town set to the north that is home to a mining company, as well as a monthly fair. Stax tells Ramoa about his journey through the Sea of Sorrows leading to a desert, and Ramoa mentions that the desert is known as Desolation Bay. She also mentions that guardians are known as \"the Old Ones\", and that she has only explored areas east of the Sea of Sorrows.", "bbox": [202.046875, 2893.515625, 726, 196]}, {"text": "By dusk, the caravan stops for the night at a meadow between two rivers. As they sit by a fire, Stax asks Ramoa if she’ll be heading back south afterward. She says that she’ll be meeting her friend, Hejira Tenboots, in Tumbles Harbor, who has been exploring jungles to the north. Stax then shows Ramoa the compass that was left behind, and Ramoa explains to Stax that compasses lead to the origin point, basically making it useless. The two are then assigned to guard duty, and they kill a lone skeleton. Stax explains to Ramoa about his journey so far, as well as options in case Tumbles Harbor doesn’t work out for him. The two then continue guard duty in silence.", "bbox": [202.046875, 3113.515625, 726, 147]}, {"text": "Chapter 15: Tumbles Harbor", "bbox": [202.046875, 3284.515625, 726, 23]}, {"text": "By morning, the caravan is moving again toward Tumbles Harbor. By dusk, the caravan stops again for the night, and Ramoa kills a few spiders. The next morning, she hands Stax a fishing rod, and by midday, the caravan eventually reaches Tumbles Harbor. Stax and Ramoa awkwardly part ways, and Stax eventually finds the caravan agent at a local inn. The caravan agent gives Stax some money for food. Stax then finds the innkeeper, who shows him his room, although it is closed off due to the fair. Stax then gets himself some cooked mutton and a cookie to eat, and explores the town for a while. Eventually, he comes across a fork in the road, with one path leading to the mining company, known as The Tumbles Extraction Company. Stax walks down said path, and is greeted by a man saying that the office is closed due to the fair. Stax asks if the owner will be here tomorrow, and the man says that the manager will be in tomorrow, known as Mrs. Taney. The man then says to Stax to get himself some tools and new clothes, and Stax says he’ll be back tomorrow.", "bbox": [202.046875, 3508.015625, 726, 245]}, {"text": "Chapter 16: Three Curious Characters", "bbox": [202.046875, 3777.015625, 726, 22]}, {"text": "Stax heads back to town, getting himself a bowl of mushroom stew. He then heads back to the inn and falls asleep. By morning, Stax heads to the local store and orders some new clothes and an iron pickaxe. He then heads back to the offices of The Tumbles Extraction Company and has an interview with Mrs. Taney. She asks him questions about mining and fears such as claustrophobia (tight spaces) nyctophobia (the dark), and basophobia (falling), as well as being attacked by zombies, skeletons, or creepers. Stax is then hired, and is immediately assigned to the crew of Mr. Barnacle.", "bbox": [202.046875, 3927.015625, 726, 147]}]}