{"metadata": {"url": "https://minecraft.fandom.com/wiki/Java_Edition_Far_Lands/Up_to_Infdev_20100325", "title": "Java_Edition_Far_Lands/Up_to_Infdev_20100325", "time": "16/04/2022 23:53:19"}, "tables": [], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/e/e7/Dark_Oak_Sapling_JE7_BE2.png", "path": "images/Dark Oak Sapling JE7 BE2.png", "alt_text": "Dark Oak Sapling JE7 BE2", "caption": null, "bbox": [260.53125, 504.984375, 32, 32]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/d/dd/Eyc0bj7pr4w51.jpg", "path": "images/img.jpg", "alt_text": "", "caption": "Stone Wall generated in Infdev 20100227-2", "bbox": [202.046875, 597.578125, 603, 339]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/d/d7/The_Corner_Stone_Far_Lands.jpg", "path": "images/The corner stone far lands, with one side smooth and the other side rough.jpg", "alt_text": "The corner stone far lands, with one side smooth and the other side rough", "caption": "Corner Stone Wall with one side smooth and the other side rough", "bbox": [442.9375, 1278.578125, 485, 273]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/f9/My_Project_2.jpg", "path": "images/img (1).jpg", "alt_text": "", "caption": "End of Infdev's world generation seen at X: 2,147,483,904.", "bbox": [442.9375, 1620.578125, 485, 273]}], "sprites": [], "texts": [{"text": "Java Edition Far Lands/Up to Infdev 20100325", "bbox": [202.046875, 353.890625, 593, 90]}, {"text": "Stone wall \"Far Lands\" (X/Z: >±33,554,432)", "bbox": [202.046875, 568.578125, 726, 20]}, {"text": "In the February 27th build of Infdev, all generation past 33,554,432 blocks would be solid stone, continuing out to the 32-bit limit. This wall extends vertically from the bottom of the world to the height limit, and are the first truly visible appearance of the Far Lands, although very visually, behaviourally and positionally distinct from convention.", "bbox": [202.046875, 961.578125, 726, 98]}, {"text": "In the March 13th build, a world boundary was placed at 32 million blocks, preventing this wall from being normally accessible, however modding can bring it back. Later Infdev versions would have ores spawn in this stone wall as if it were any other body of stone.", "bbox": [202.046875, 1083.578125, 726, 74]}, {"text": "This stone wall may not always start at exactly 33,554,432 blocks out - it is not uncommon to see a rough, repetitive boundary at this point, visually resembling the ridges of a radiator or the fins of a heat sink, in a similar way to how the usual Far Lands can generate a few blocks earlier.", "bbox": [202.046875, 1181.078125, 726, 73]}, {"text": "On some seeds, the Far Lands don't have any rough appearance but are rather just smooth. Sometimes Far Lands on one axis can be smooth while on the other axis they're rough.", "bbox": [202.046875, 1278.578125, 726, 147]}, {"text": "With the terrain generation rewrite in the March 27th build exactly a month later, this stone wall was eliminated and unwittingly \"replaced\" with the traditional sets of Far Lands.", "bbox": [202.046875, 1449.578125, 726, 147]}, {"text": "While occurring at exactly a power of two, this is not a hard limit, but rather due to the noise generator settings for these versions themselves also being a power of two, returning this overflow point in the calculations can lead to lag or even a crash on the game.", "bbox": [202.046875, 1620.578125, 726, 196]}, {"text": "Walking to these Far Lands is impossible in normal gameplay as the game becomes unplayable well before this point due to a variety of distance effects. Even if a player could overcome the distance effects, beyond 16,777,216 blocks away blocks stop being solid (however, swimming in water is still possible), preventing the player from traveling any further.", "bbox": [202.046875, 1840.578125, 726, 172]}, {"text": "Distance Effects in Infdev-227-1 and Infdev 227-2:", "bbox": [202.046875, 2036.078125, 726, 49]}, {"text": "X/Z: 512 - Clouds stop rendering\nX/Z: -512 / 1,024 - The sky box stops rendering.\nX/Z: 2,048 - The first noticeable jitter begins, with the hitbox appearing to flicker slightly around blocks.\nX/Z: 16,384 - First noticeable world rendering issue begins, with the borders of chunks beginning to become visible and the chunks appearing to shake slightly.\nX/Z: 32,768 - The world rendering bug present in Infdev 624 through Beta 1.7.3 begins to manifest, with the hitbox being slightly offset from the blocks.\nX/Z: 65,536 - Particles begin to lose precision, appearing more blocky and stretched.\nX/Z: 131,072 - Hitbox outline begins to deform and shake visually.\nX/Z: >1,048,576 - The world rendering fails when looking at certain angles, causing the screen to flicker. It becomes very noticeable beyond X/Z: 2,000,000.\nX/Z: 16,777,216 - Blocks stop being solid, causing the player to fall into the void. However, the player can still swim through water.\nX/Z: 268,435,456 - The gaps between chunks start to become multiple blocks long, making the world look like stripes on one axis and a grid pattern on both axis.\nX/Z: 2,147,483,647 - The world stops generating terrain and the map appears blank from here on out with only the Sun and Moon.\nX/Z: Infinity - The largest achievable distance Java can render(1.7976931348623157e+308, any numbers larger than that are simply referred as infinity on NaN). The sun and moon are gone and everything is blank with the default sky color.", "bbox": [238.046875, 2109.078125, 690, 490]}]}