{"metadata": {"url": "https://minecraft.fandom.com/wiki/Minecraft_(Step_into_Reading_series)/PlotSummary", "title": "Minecraft_(Step_into_Reading_series)/PlotSummary", "time": "17/04/2022 05:39:32"}, "tables": [], "images": [], "sprites": [], "texts": [{"text": "Minecraft (Step into Reading series)/PlotSummary", "bbox": [202.046875, 313, 593, 90]}, {"text": "Survival Mode!", "bbox": [202.046875, 471.5, 726, 23]}, {"text": "Emmy and Birch, along with Birch’s tame wolf, Byte, are in the Overworld. As Birch and Byte play around in some sunflowers nearby, Emmy plans to climb to the top of a nearby mountain dubbed \"Mount Farview\", with Birch concurring. The two then punch out some logs from a nearby tree to craft into planks, which in turn are used to craft a crafting table. After Emmy crafts some wooden tools, everyone starts heading toward Mount Farview. They notice a spider nearby, but it doesn’t attack as the sun is still out. Not long after, Emmy, Birch, and Byte arrive at the base of the mountain, and decide to gather some more supplies. Emmy uses her axe to knock apples off a nearby oak tree, while Birch uses his wooden pickaxe to gather cobblestone. The pickaxe soon breaks, but Emmy then crafts Birch a stone pickaxe. As everyone begins to climb Mount Fairview, the sun begins to set, so they decide to build a shelter. Birch mines out cobblestone while Emmy uses it build a house. Just then, a skeleton fires arrows at them, but is killed with ease. More hostile mobs soon appear, like zombies and creepers, but all are killed by daybreak. Emmy, Birch, and Byte then finish climbing up Mount Farview, overlooking numerous biomes in the distance as the narrator mentions that their adventure was just getting started.", "bbox": [202.046875, 506, 726, 294]}, {"text": "Mobs in the Overworld!", "bbox": [202.046875, 824, 726, 22]}, {"text": "As Birch plays fetch with his tame wolf, Byte, near a village, Emmy plans on getting a pet of her own, so they decide to go exploring around the Overworld. They first come across mobs such as cows and chickens, but Birch remarks that they belong to the villagers as they are in an enclosed space. Emmy agrees, and so the two continue exploring. Coming to a taiga biome, they find some rabbits and a fox. Emmy acknowledges that the rabbits are cute, but is worried about taking one from a family. Byte ends up scaring away the fox. Birch then spots a bees' nest and starts to knock it off of the tree with his pickaxe. Emmy warns him to stop, but by then, it was too late. A group of angry bees then chase everyone out of the woods and into a nearby cave, where they come across spiders, silverfish, bats, and numerous hostile mobs such as zombies and slimes. Exiting the cave, the three (Emmy, Birch, and their tame wolf, Byte) then come across a panda in a jungle, who sneezes at them, leaving behind a slimeball.", "bbox": [202.046875, 858.5, 726, 245]}, {"text": "They soon head into the ocean, where they find mobs such as dolphins and drowned, and then into the ice and snow, finding a stray and some polar bears. Not long after, Emmy, Birch, and Byte come across a swamp, where they notice a black cat, but a witch begins throwing potions at the three from nearby, leaving them no choice but to run off. As they leave the swamp, a creeper blows up right by them, making a crater in the ground. Emmy begins to worry that she might not be able to find an animal to be her pet, but a horse just happens to be nearby. Birch crafts a lead using string from a spider and the slimeball from the panda, while Emmy walks slowly over to the horse. Emmy then takes the lead from Birch while he feeds the horse an apple. As Emmy puts a saddle on the horse and climbs on it, she decides to call the horse \"Ink\". Emmy and Ink then gallop across the Overworld as Birch and Byte run alongside them.", "bbox": [202.046875, 1127.5, 726, 221]}, {"text": "Escape from the Nether!", "bbox": [202.046875, 1372, 726, 22]}, {"text": "Emmy, Birch, and their wolf, Byte, are in the Overworld. Emmy is wearing a golden helmet and some golden boots, while Birch has an iron sword. The two decide to play fetch with Byte by throwing a stick into a nearby forest. Although Byte chases after it, Emmy and Birch soon realize that Byte has disappeared and start calling its name as they head toward the forest. Beneath some trees, the two soon find a nether portal. Feeling that Byte may have gone through it, Emmy and Birch decide to go through it as well, spawning in a warped forest in the Nether. Climbing a vine to get a better view of their surroundings, the two also notice a crimson forest, a huge swath of netherrack, and \"an ocean of lava\". Emmy then puts some warped fungus into her inventory as she and Birch head over to the crimson forest. Suddenly, the two are surrounded by piglins. They attack Birch but avoid Emmy as she is wearing a gold helmet and a pair of gold boots. Emmy then gives Birch her gold helmet so she no longer can be attacked by piglins.", "bbox": [202.046875, 1406.5, 726, 245]}, {"text": "The two then follow the piglins over to a bastion remnant, where the two soon find \"a treasure room filled with gold\". Opening a chest in the room ends up provoking the piglins, however, so Emmy and Birch escape by making a hole in the wall. The escape quickly becomes tricky, however, due to them ending up in a soul sand valley. As skeletons fire at them, the two find a nether portal across a river of lava. Birch feels as if they are trapped, but Emmy soon notices some striders. They saddle them and climb on top, but the striders don’t move. Emmy then attempts to use a carrot on a stick, but it doesn’t work. As the mobs close in on them, Birch suggests to use the warped fungus to craft a warped fungus on a stick. Emmy does so, and just as she has the fungus in front of the strider’s face, they begin to run across the lava. Emmy and Birch quickly head toward the nether portal, where they notice Byte on the other side, and soon go through it. Now safe in the Overworld, the two decide to play fetch with Byte once again.", "bbox": [202.046875, 1675.5, 726, 245]}]}