{"metadata": {"url": "https://minecraft.fandom.com/wiki/Programs_and_editors/Tectonicus/Mac_Scripting_Tutorial", "title": "Programs_and_editors/Tectonicus/Mac_Scripting_Tutorial", "time": "17/04/2022 05:28:47"}, "tables": [], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/f2/Paper_JE2_BE2.png", "path": "images/Paper JE2 BE2.png", "alt_text": "Paper JE2 BE2", "caption": null, "bbox": [260.53125, 545.59375, 32, 32]}], "sprites": [], "texts": [{"text": "Programs and editors/Tectonicus/Mac Scripting Tutorial", "bbox": [202.046875, 349.5, 593, 135]}, {"text": "Tectonicus can be scripted to run on any Linux- or BSD-based operating system, including Mac OS X. This gives the system administrator the ability to generate maps on a schedule without having to manually trigger anything.", "bbox": [202.046875, 605.1875, 726, 49]}, {"text": "Two things are required to make this happen: a script, and a crontab entry.", "bbox": [202.046875, 678.1875, 726, 25]}, {"text": "Contents", "bbox": [215.046875, 742.4375, 81, 17]}, {"text": "1 Example Script\n2 Example Script Breakdown\n2.1 Exit Status\n2.2 Variables\n2.3 Logging\n2.4 Running Tectonicus\n2.5 Transferring The Map with Rsync\n2.6 Timing and Completion\n3 Making Things Run Automatically With Cron\n4 Wrapping Up", "bbox": [203.046875, 775.703125, 325, 303]}, {"text": "Example Script", "bbox": [202.046875, 1103.703125, 726, 43]}, {"text": "The script is the actual thing that gets executed to perform the Tectonicus render. It contains the Tectonicus commands and anything else that you might want to include. The example script below triggers Tectonicus and uploads the resulting map to a web server using rsync, and also times how long each operation takes and then writes the results out to a short log file.", "bbox": [202.046875, 1155.703125, 726, 98]}, {"text": "First, here is the entire script:", "bbox": [202.046875, 1277.703125, 726, 24]}, {"text": "Example Script Breakdown", "bbox": [202.046875, 3070.203125, 726, 43]}, {"text": "That might look like a pretty intimidating block of text up there, especially if you've never done any scripting before, so let's dive into what each of the sections does.", "bbox": [202.046875, 3122.203125, 726, 49]}, {"text": "Exit Status", "bbox": [202.046875, 3195.203125, 726, 23]}, {"text": "The very topmost part of the script lists the potential exit status that the script could report when it stops running.", "bbox": [202.046875, 3229.703125, 726, 24]}, {"text": "An exit status of 0 means that no errors were reported, while other numbers indicate either a failure with Tectonicus itself or a failure during rsync. These exit status numbers could be used to determine what to do next based on what failed—for example, you could re-trigger Tectonicus if the script returns an exit code of 3. This script doesn't do any of that, though.", "bbox": [202.046875, 3360.203125, 726, 98]}, {"text": "Variables", "bbox": [202.046875, 3482.203125, 726, 23]}, {"text": "The next part of the example script sets variables that the rest of the script uses. This is done so that you can change things around (like the Tectonicus jar file or the locations of the working files) without having to edit the main part of the script.", "bbox": [202.046875, 3516.703125, 726, 73]}, {"text": "You'll want to fill in your own information in each of these spots. Here's what they're for:", "bbox": [202.046875, 4004.203125, 726, 25]}, {"text": "The LOG variable is the place where this script writes its own simple log file, which is just a simple text file. The log file records whether or not the script ran, and where it failed if it didn't complete. More importantly, it records how log the script takes to run.\nLOGOLD is the name that the previous run's log file will be changed to every time. This way, the script will keep the last run's log file rather than just overwriting it.\nWORLDWORKDIR is the location of the Minecraft map data files. Set this to wherever the Minecraft map is on your computer. If you're running your Minecraft map on another server, then copy it to your computer first.\nTECTJAR is the location of the current Tectonicus jar file. As Tectonicus is updated, you'll change this variable to point to the new jar files.\nTECTCONFIG is the XML configuration file for Tectonicus. It's possible to have multiple config files for Tectonicus and list them here with different variable names, then trigger Tectonicus multiple times to render different maps.\nTECTOUTPUT is where Tectonicus will place the map it generates. This is what you'd then copy to a web server, either on your LAN or somewhere on the Internet.\nWEBSERVER is the fully-qualified domain name of the sever where rsync will copy the Tectonicus map.\nWEBSVC is the account that rsync will use to log onto the web server. Note that to make this process seamless and secure, you'll want to enable ssh key authentication on the web server, if that's allowed. Otherwise, you'll have to specify the account password in this script. Here's a howto on setting up key-based ssh authentication.\nWEBSERVERPATH is the location on the web server where the Tectonicus map files will be placed so that they can be served out to the Internet.", "bbox": [238.046875, 4052.703125, 690, 539]}, {"text": "Logging", "bbox": [202.046875, 4615.703125, 726, 22]}, {"text": "The first thing that the next section does is set another variable, named STARTTIME, which records the time to the second that the script starts:", "bbox": [202.046875, 4650.203125, 726, 49]}, {"text": "The time is recorded in Unix time, which gives us the number of seconds elapsed since 00:00 on 1 January 1970. At the end of the script, we'll store the Unix time in another variable, which will give us the number of seconds that the entire script took to run. Just recording the seconds makes the time math a lot easier—this way, we don't have to do multiple hour/minute/second conversions, since we're already working with seconds.", "bbox": [202.046875, 4763.203125, 726, 98]}, {"text": "Next we set up our script's log file:", "bbox": [202.046875, 4885.203125, 726, 25]}, {"text": "The first thing we do is check to see if there's already a log file, and if one exists, we rename it with the mv command to the value in the LOGOLD variable. After that, a note gets placed in the log file that the old log has been backed up, and records the time that this script starts running.", "bbox": [202.046875, 5085.703125, 726, 73]}, {"text": "If no old log file exists, the script makes one, and then records the time in it.", "bbox": [202.046875, 5183.203125, 726, 25]}, {"text": "Running Tectonicus", "bbox": [202.046875, 5231.703125, 726, 22]}, {"text": "The next section actually starts Tectonicus and waits for it to finish rendering before moving on.", "bbox": [202.046875, 5266.203125, 726, 25]}, {"text": "The first line notes in the log file the time Tectonicus actually starts, and then the next line executes Tectonicus, using the variables set in the beginning of the script to specify where the Tectonicus jar and config files live.", "bbox": [202.046875, 5466.703125, 726, 49]}, {"text": "The next part, starting with the \"IF\" statement, looks at the exit status that Java spits out when it finishes. If Tectonicus runs successfully and reports no errors, then the Java process will send back an exit status of 0 when it's done. The script is watching for an exit status of anything except 0 (that's the \"if $? -ne 0\" bit—if the exit code is not equal to zero), and if it sees anything except zero, it writes its own error message to the log file and terminates.", "bbox": [202.046875, 5539.703125, 726, 122]}, {"text": "However, if Java does indeed return a status of zero—indicating a successful Tectonicus run—we note that in the long, along with the time, and move on to the next section.", "bbox": [202.046875, 5686.203125, 726, 49]}, {"text": "Transferring The Map with Rsync", "bbox": [202.046875, 5759.203125, 726, 23]}, {"text": "Rsync is a powerful file transfer tool with many uses, but the one we care about most here is its ability to look at a whole bunch of files at a source and at a destination, and then only transfer the files from source to destination that are different. Tectonicus generates lots and lots and lots of files, and you will save huge amounts of time by transferring to your web server only the new bits of the map every night instead of copying the whole thing every time.", "bbox": [202.046875, 5793.703125, 726, 122]}, {"text": "The first line records the time rsync starts transferring, and the second line executes rsync. Here's a what each of the command line arguments do:", "bbox": [202.046875, 6120.203125, 726, 49]}, {"text": "--delete removes files on the destination that have been removed on the source, which helps keeps clutter to a minimum\n--force ensures that directories that have been removed on the source get removed on the destination, again helping to keep clutter down\n-aPe is three options lumped into one:\na tells rsync to use its \"archive\" preset, which basically tells rsync to copy all the subdirectories within the directory you're copying, and to preserve the layout and attributes of the files.\nP tells rsync to keep partially-transferred files, and also to display a progress indicator as the copy runs, so you have something to look at if you happen to be at your computer while the script is running\ne ssh tells rsync that it's going to use ssh on the remote computer to execute commands\n--exclude 'Cache' makes rsync skip copying over the Tectonicus cache directory. The cache directory can be very large and contain hundreds of thousands of files, so not transferring this to the web server can save a lot of time.\n$TECTOUTPUT/* $WEBSVC@$WEBSERVER:$WEBSERVERPATH tells rsync to copy the Tectonicus output directory to the desired destination path on the web server, logging on with the account you specified. The values you put in the variables section at the beginning are substituted in when the command is run by the script.", "bbox": [238.046875, 6193.203125, 690, 441]}, {"text": "Timing and Completion", "bbox": [202.046875, 6657.703125, 726, 22]}, {"text": "The last two sections measure how long the entire script ran, record the info in the log file, and then report a successful exit.", "bbox": [202.046875, 6692.203125, 726, 49]}, {"text": "The current Unix time is recorded in the STOPTIME variable, and then using some handy bash math, STARTTIME is subtracted from STOPTIME, which gives us the number of seconds that the script took to run. This value is converted to hours/minutes/seconds and recorded in the log file. (Some limited testing reveals that the date -ur function works correctly on OS X, but doesn't appear to work on Linux). Lastly, we report an exit status of 0 and the script comes to an end.", "bbox": [202.046875, 7071.203125, 726, 123]}, {"text": "For Linux, try using the alternate \"Total time elapsed\" line. Seanos 07:11, 1 October 2011 (UTC)", "bbox": [202.046875, 7217.703125, 726, 24]}, {"text": "Making Things Run Automatically With Cron", "bbox": [202.046875, 7266.203125, 726, 43]}, {"text": "The preferred way to schedule a task on OS X is to use launchd, but these instructions are for cron, since that will work on both OS X and also other Linux- and BSD-based operating systems. For instructions on setting up a launchd job to execute a script every night, use Google.", "bbox": [202.046875, 7318.203125, 726, 74]}, {"text": "To tell cron to run this script nightly whether or not a user is logged on, you'll need to edit the system crontab file, which is located at /etc/crontab (though on OS X 10.6.x, the file might not exist—if that's the case, then you can create it yourself). Open the file for editing and paste in the following line:", "bbox": [202.046875, 7415.703125, 726, 73]}, {"text": "Make sure to substitute in the path to the Tectonicus script. The first two characters are the minute and hour that cron will execute the script in 24-hour notation, so the line as it is above will run the script every night at 01:00. To change it to 03:30, you'd replace the \"0\" with \"30\" and the \"1\" with \"3\".", "bbox": [202.046875, 7553.203125, 726, 74]}, {"text": "Wrapping Up", "bbox": [202.046875, 7650.703125, 726, 43]}, {"text": "The script above is just an example of one way to automate the execution of Tectonicus—it can be modified to do lots of other things, including execute multiple instances of Tectonicus, either in serial or parallel.", "bbox": [202.046875, 7702.703125, 726, 49]}, {"text": "This article would probably benefit from instructions on creating a launchd item instead of using cron, but cron works fine for me, so I haven't put in the time to figure out how to make launchd work instead.", "bbox": [202.046875, 7775.703125, 726, 49]}]}