{"metadata": {"url": "https://minecraft.fandom.com/wiki/Tutorials/Architectural_terms", "title": "Tutorials/Architectural_terms", "time": "17/04/2022 03:52:59"}, "tables": [{"bbox": [202.046875, 578, 725, 1037], "headers": {"text": ["Term", "Definition"], "bboxes": [[202.546875, 578.5, 98, 31], [300.734375, 578.5, 626, 31]]}, "cells": {"text": ["Bastion", "A large wedge shaped defence, typically seen on polish castles.", "Buttress", "An external support to a wall that prevents it from leaning outwards and collapsing. See Walls and buttresses.", "Console", "An ornamental bracket, often used to support a wall fixture, bust or other feature. In Minecraft, a console and a corbel will often be indistinguishable.", "Corbel", "Corbels, and the technique of 'corbelling' are used in various ways in architecture. Prior to the development of the methods now used for arches, a corbel arch was a 'fake' arch that just edged the stones out from a wall a little at a time until they met, without changing the shape or orientation of the stones in the ways that would be done for a true arch. 'Corbel' is also a term for a support, usually of stone, that has been keyed into the supporting wall so that it is stronger than a console would be.", "Counterfort", "A supporting structure for a dam or retaining wall, similar to a buttress.", "Dormer", "A structure on a roof commonly with its own 'mini-roof' above it. See Roof decorations. Also a shortened term for a dormer window, a window within a dormer structure.", "Embrasure", "If a wall is partly hollowed out from the inside, this is known as an embrasure. They may be used as a site for arrow slits, or as a firing hole for a cannon, or to broaden the opening around an arch or doorway. See Walls and buttresses.", "Light", "The term light is used not only for actual lights, but also for some types of window – hence 'skylight', 'fanlight', 'transom light' and so forth.", "Monitor", "A protuding secondary roof, running along the roof ridge parallel to the main roof. See Roof types.", "Mullion", "A vertical element dividing the sections of windows, doors, or screens, or used decoratively.", "Pile", "A heavy beam or post driven vertically into the ground to support the foundations of a very large structure.", "Slab ceiling", "This is a Minecraft-specific term for a ceiling made of slabs. These have less disadvantages than slab floors, as the only common ceiling 'furniture' are lights of various kinds, but using a slab ceiling does still impose a limit on the ceiling materials available.", "Slab floor", "This is a Minecraft-specific term for a floor made of slabs. These are used with some furniture types, which rely on having a half-height base – a slab – in order to look correct. It also makes it possible to approximate skirting boards using step blocks while staying in scale with the rest of the room. The disadvantage of a slab floor is that only a small number of Minecraft blocks have slab variants available, which limits the possible floor types, and the new carpet tiles cannot be used.", "Stay", "A usually nautical term for a rope, wire or rod which helps hold a structure in position. Often used for ships' masts and other very tall, thin structures, and sometimes for certain designs of retaining wall.", "Transom", "A horizontal structural beam or bar, or the crosspiece separating a door from a window above it. Also a shortened term for a transom window, or transom light."], "bboxes": [[202.546875, 609.59375, 98, 31], [300.734375, 609.59375, 626, 31], [202.546875, 640.6875, 98, 55], [300.734375, 640.6875, 626, 55], [202.546875, 696.28125, 98, 55], [300.734375, 696.28125, 626, 55], [202.546875, 751.875, 98, 153], [300.734375, 751.875, 626, 153], [202.546875, 905.46875, 98, 31], [300.734375, 905.46875, 626, 31], [202.546875, 936.5625, 98, 55], [300.734375, 936.5625, 626, 55], [202.546875, 992.15625, 98, 80], [300.734375, 992.15625, 626, 80], [202.546875, 1072.25, 98, 55], [300.734375, 1072.25, 626, 55], [202.546875, 1127.84375, 98, 31], [300.734375, 1127.84375, 626, 31], [202.546875, 1158.9375, 98, 31], [300.734375, 1158.9375, 626, 31], [202.546875, 1190.03125, 98, 55], [300.734375, 1190.03125, 626, 55], [202.546875, 1245.625, 98, 80], [300.734375, 1245.625, 626, 80], [202.546875, 1325.71875, 98, 153], [300.734375, 1325.71875, 626, 153], [202.546875, 1479.3125, 98, 80], [300.734375, 1479.3125, 626, 80], [202.546875, 1559.40625, 98, 55], [300.734375, 1559.40625, 626, 55]]}}, {"bbox": [202.046875, 1891.5, 726, 3004], "headers": {"text": ["[hide]\nTutorials", "Introductory", "Newcomer survival", "Shelters", "General", "Challenges", "Non-standard survival", "Challenge maps", "Constructions", "Farming", "Blocks and items", "Mobs", "OP farms", "Enchanting and smelting", "Blockbreaking", "Mechanisms", "Basic redstone", "Detectors", "Minecarts", "Traps", "Pistons", "Redstone (advanced)", "Servers", "Server setup", "Technical", "Maps", "Resource packs", "Data packs", "Creating Minecraft media", "Game installation", "Outdated"], "bboxes": [[205.046875, 1894.5, 720, 27], [205.046875, 1923.453125, 195, 176], [402.046875, 1949.953125, 152, 74], [402.046875, 2025.453125, 152, 74], [205.046875, 2100.953125, 195, 270], [205.046875, 2372.453125, 195, 347], [402.046875, 2545.953125, 177, 147], [402.046875, 2694.953125, 177, 25], [205.046875, 2721.453125, 195, 196], [205.046875, 2919.453125, 195, 666], [402.046875, 2919.453125, 139, 417], [402.046875, 3337.953125, 139, 221], [402.046875, 3560.453125, 139, 25], [205.046875, 3586.953125, 195, 49], [205.046875, 3637.953125, 195, 25], [205.046875, 3664.453125, 195, 500], [402.046875, 3664.453125, 168, 172], [402.046875, 3837.953125, 168, 74], [402.046875, 3913.453125, 168, 49], [402.046875, 3964.453125, 168, 49], [402.046875, 4015.453125, 168, 49], [402.046875, 4066.453125, 168, 98], [205.046875, 4166.453125, 195, 149], [402.046875, 4217.453125, 109, 98], [205.046875, 4317.453125, 195, 451], [402.046875, 4343.953125, 198, 74], [402.046875, 4419.453125, 198, 49], [402.046875, 4470.453125, 198, 25], [402.046875, 4496.953125, 198, 25], [402.046875, 4523.453125, 198, 245], [205.046875, 4770.453125, 195, 123]]}, "cells": {"text": ["Menu screen Game terms\nNewcomer survival The first day/beginner's guide The second day The third day Hunger management Things not to do Simple tips and tricks Your first ten minutes\nShelters Best biomes for homes Best building materials Building and construction Navigation Shelters Shelter types", "The first day/beginner's guide The second day The third day Hunger management Things not to do Simple tips and tricks Your first ten minutes", "Best biomes for homes Best building materials Building and construction Navigation Shelters Shelter types", "Achievement guide Advancement guide Best enchantments guide Breaking bedrock Combat Complete main adventure Creating a village Dual wielding End survival Exploring caverns Gathering resources on peaceful difficulty Getting food quickly Headless pistons Hitboxes Horses Indestructible end crystals Mapping Measuring distance Minecraft in education Mining Diamonds Fossils Ancient Debris Nether hub Nether portals Nether survival Organization Pillar jumping PvP PvP bases Spawn-proofing Summoning jockeys The Void Time-saving tips Thunderstorm survival Units of measure Update suppression Village mechanics Trading X-ray glitches", "Acquiring a conduit Curing a zombie villager Defeating temples Defeating a village raid Defeating a Nether fortress Defeating a bastion remnant Defeating a dungeon Defeating a pillager outpost Defeating a woodland mansion Defeating a monument Defeating an End city Defeating the Ender dragon Defeating the Wither Exploring an ancient city Obtaining every music disc\nNon-standard survival Adventure survival Half hearted hardcore Hardcore mode Surviving in a single area indefinitely Infinite desert survival Island survival Manhunt Nomadic experience Skywars survival Superflat survival Ultra hardcore survival\nChallenge maps Beating a challenge map Creating a challenge map", "Adventure survival Half hearted hardcore Hardcore mode Surviving in a single area indefinitely Infinite desert survival Island survival Manhunt Nomadic experience Skywars survival Superflat survival Ultra hardcore survival", "Beating a challenge map Creating a challenge map", "Adding beauty to constructions Airlock Architectural terms Building a cruise ship Building a metropolis Building a rollercoaster Building safe homes Building water features Color palette Creating shapes Defense Desert shelter Elevators Endless circling pool Furniture Glazed terracotta patterns Making nice floors Pixel art Ranches Roof types Curved roofs Roof construction guidelines Roof decorations Secret door Settlement guide Underwater home Walls and buttresses Water gate Water-powered boat transportation", "Blocks and items Amethyst Armor Azalea Bamboo Basalt Bedrock Blaze rod Bone meal Cactus Chorus fruit Clay and mud Cobblestone Cocoa bean Copper Crops (Beetroot, Carrot, Potato, Wheat) Dirt Dragon's breath Dripleaf Dripstone Egg Fern Fish Flower Froglight Glow berries Glow ink sac Glow lichen Gold Hanging root Honey Ice Iron Kelp Lava Meat Moss block Mushroom Music disc Nautilus shell Nether growth Nether vine Nether wart Obsidian Powder snow Pumpkin, Melon Rooted dirt Sculk growths Scute Seagrass Sea pickle Snow Soul soil Sugar cane Sweet berries Tree Trident Vine Villager trading hall Wither rose Wool Duplication\nMobs Mob farming Mob grinding Spawner traps Animals (Cows, Pigs, Sheep) Axolotl Blaze Cave spider Creeper Drowned Ender dragon Enderman Frog Guardian Hoglin Iron golem Magma cube Phantom Piglin bartering farm Raid Shulker Slime Squid Turtle Villager Wandering trader Witch Wither Wither skeleton Zombie Zombified piglin\nOP farms End of light mob farms", "Amethyst Armor Azalea Bamboo Basalt Bedrock Blaze rod Bone meal Cactus Chorus fruit Clay and mud Cobblestone Cocoa bean Copper Crops (Beetroot, Carrot, Potato, Wheat) Dirt Dragon's breath Dripleaf Dripstone Egg Fern Fish Flower Froglight Glow berries Glow ink sac Glow lichen Gold Hanging root Honey Ice Iron Kelp Lava Meat Moss block Mushroom Music disc Nautilus shell Nether growth Nether vine Nether wart Obsidian Powder snow Pumpkin, Melon Rooted dirt Sculk growths Scute Seagrass Sea pickle Snow Soul soil Sugar cane Sweet berries Tree Trident Vine Villager trading hall Wither rose Wool Duplication", "Mob farming Mob grinding Spawner traps Animals (Cows, Pigs, Sheep) Axolotl Blaze Cave spider Creeper Drowned Ender dragon Enderman Frog Guardian Hoglin Iron golem Magma cube Phantom Piglin bartering farm Raid Shulker Slime Squid Turtle Villager Wandering trader Witch Wither Wither skeleton Zombie Zombified piglin", "End of light mob farms", "Enchantment mechanics Anvil mechanics Automatic smelting Manual smelting", "Blast chamber Wither cage", "Basic redstone Automatic respawn anchor recharger Basic logic gates Command block Flying machines Hopper Item transportation Mechanisms Observer stabilizer Combination locks Randomizers Redstone music Redstone tips Rube Goldberg machine Shulker box storage Villager trading hall\nDetectors Block update detector Comparator update detector Daylight sensor Day night detector\nMinecarts Train station Minecarts Storage Storage system\nTraps Snow golems TNT cannons Trapdoor uses Trap design Traps\nPistons Piston uses Piston circuits Quasi-connectivity Zero-ticking Instant repeaters\nRedstone (advanced) Advanced redstone circuits Arithmetic logic Calculator Command stats Hourly clock Morse code Printer Redstone computers Redstone telegraph", "Automatic respawn anchor recharger Basic logic gates Command block Flying machines Hopper Item transportation Mechanisms Observer stabilizer Combination locks Randomizers Redstone music Redstone tips Rube Goldberg machine Shulker box storage Villager trading hall", "Block update detector Comparator update detector Daylight sensor Day night detector", "Train station Minecarts Storage Storage system", "Snow golems TNT cannons Trapdoor uses Trap design Traps", "Piston uses Piston circuits Quasi-connectivity Zero-ticking Instant repeaters", "Advanced redstone circuits Arithmetic logic Calculator Command stats Hourly clock Morse code Printer Redstone computers Redstone telegraph", "Playing on servers Multiplayer Survival Spawn jail Griefing prevention Joining a LAN world with alternate accounts\nServer setup Setting up a server Server startup script FreeBSD startup script OpenBSD startup script Ubuntu startup script Setting up a Hamachi server Setting up a Minecraft Forge server Setting up a Spigot server Ramdisk enabled server", "Setting up a server Server startup script FreeBSD startup script OpenBSD startup script Ubuntu startup script Setting up a Hamachi server Setting up a Minecraft Forge server Setting up a Spigot server Ramdisk enabled server", "Improving frame rate Minecraft help FAQ (IRC channel) Update Java\nMaps Custom maps Map downloads Command NBT tags Falling blocks Updating old terrain using MCEdit\nResource packs Creating a resource pack Loading a resource pack Sound directory\nData packs Creating a data pack Installing a data pack\nCreating Minecraft media Creating videos Livestreaming\nGame installation Installing snapshots Joining and leaving the Bedrock Edition beta program How to get a crash report Installing Forge mods Custom Minecraft directory Playing and saving Minecraft on a thumb drive Playing and saving Minecraft on a thumb drive with the old launcher Recover corrupted saved world data Run Minecraft through Google Drive Save game data to Dropbox (world data only) Saved data Dropbox guide", "Custom maps Map downloads Command NBT tags Falling blocks Updating old terrain using MCEdit", "Creating a resource pack Loading a resource pack Sound directory", "Creating a data pack Installing a data pack", "Creating videos Livestreaming", "Installing snapshots Joining and leaving the Bedrock Edition beta program How to get a crash report Installing Forge mods Custom Minecraft directory Playing and saving Minecraft on a thumb drive Playing and saving Minecraft on a thumb drive with the old launcher Recover corrupted saved world data Run Minecraft through Google Drive Save game data to Dropbox (world data only) Saved data Dropbox guide", "Building micro shelters Custom texture packs Door-based iron golem farming Far Lands How to get a crash report Installing mods Man-made lake Managing slimes in superflat mode Minecart booster Potion farming Repeater reboot system Survival with no enabled data packs Update LWJGL Update Minecraft Village chaining Water ladder Water tram"], "bboxes": [[402.046875, 1923.453125, 523, 176], [556.046875, 1949.953125, 369, 74], [556.046875, 2025.453125, 369, 74], [402.046875, 2100.953125, 523, 270], [402.046875, 2372.453125, 523, 347], [581.046875, 2545.953125, 344, 147], [581.046875, 2694.953125, 344, 25], [402.046875, 2721.453125, 523, 196], [402.046875, 2919.453125, 523, 666], [543.046875, 2919.453125, 382, 417], [543.046875, 3337.953125, 382, 221], [543.046875, 3560.453125, 382, 25], [402.046875, 3586.953125, 523, 49], [402.046875, 3637.953125, 523, 25], [402.046875, 3664.453125, 523, 500], [572.046875, 3664.453125, 353, 172], [572.046875, 3837.953125, 353, 74], [572.046875, 3913.453125, 353, 49], [572.046875, 3964.453125, 353, 49], [572.046875, 4015.453125, 353, 49], [572.046875, 4066.453125, 353, 98], [402.046875, 4166.453125, 523, 149], [513.046875, 4217.453125, 412, 98], [402.046875, 4317.453125, 523, 451], [602.046875, 4343.953125, 323, 74], [602.046875, 4419.453125, 323, 49], [602.046875, 4470.453125, 323, 25], [602.046875, 4496.953125, 323, 25], [602.046875, 4523.453125, 323, 245], [402.046875, 4770.453125, 523, 123]]}}, {"bbox": [400.046875, 1947.953125, 527, 153], "headers": {"text": ["Newcomer survival", "Shelters"], "bboxes": [[402.046875, 1949.953125, 152, 74], [402.046875, 2025.453125, 152, 74]]}, "cells": {"text": ["The first day/beginner's guide The second day The third day Hunger management Things not to do Simple tips and tricks Your first ten minutes", "Best biomes for homes Best building materials Building and construction Navigation Shelters Shelter types"], "bboxes": [[556.046875, 1949.953125, 369, 74], [556.046875, 2025.453125, 369, 74]]}}, {"bbox": [400.046875, 2543.953125, 527, 177], "headers": {"text": ["Non-standard survival", "Challenge maps"], "bboxes": [[402.046875, 2545.953125, 177, 147], [402.046875, 2694.953125, 177, 25]]}, "cells": {"text": ["Adventure survival Half hearted hardcore Hardcore mode Surviving in a single area indefinitely Infinite desert survival Island survival Manhunt Nomadic experience Skywars survival Superflat survival Ultra hardcore survival", "Beating a challenge map Creating a challenge map"], "bboxes": [[581.046875, 2545.953125, 344, 147], [581.046875, 2694.953125, 344, 25]]}}, {"bbox": [400.046875, 2917.453125, 527, 670], "headers": {"text": ["Blocks and items", "Mobs", "OP farms"], "bboxes": [[402.046875, 2919.453125, 139, 417], [402.046875, 3337.953125, 139, 221], [402.046875, 3560.453125, 139, 25]]}, "cells": {"text": ["Amethyst Armor Azalea Bamboo Basalt Bedrock Blaze rod Bone meal Cactus Chorus fruit Clay and mud Cobblestone Cocoa bean Copper Crops (Beetroot, Carrot, Potato, Wheat) Dirt Dragon's breath Dripleaf Dripstone Egg Fern Fish Flower Froglight Glow berries Glow ink sac Glow lichen Gold Hanging root Honey Ice Iron Kelp Lava Meat Moss block Mushroom Music disc Nautilus shell Nether growth Nether vine Nether wart Obsidian Powder snow Pumpkin, Melon Rooted dirt Sculk growths Scute Seagrass Sea pickle Snow Soul soil Sugar cane Sweet berries Tree Trident Vine Villager trading hall Wither rose Wool Duplication", "Mob farming Mob grinding Spawner traps Animals (Cows, Pigs, Sheep) Axolotl Blaze Cave spider Creeper Drowned Ender dragon Enderman Frog Guardian Hoglin Iron golem Magma cube Phantom Piglin bartering farm Raid Shulker Slime Squid Turtle Villager Wandering trader Witch Wither Wither skeleton Zombie Zombified piglin", "End of light mob farms"], "bboxes": [[543.046875, 2919.453125, 382, 417], [543.046875, 3337.953125, 382, 221], [543.046875, 3560.453125, 382, 25]]}}, {"bbox": [400.046875, 3662.453125, 527, 504], "headers": {"text": ["Basic redstone", "Detectors", "Minecarts", "Traps", "Pistons", "Redstone (advanced)"], "bboxes": [[402.046875, 3664.453125, 168, 172], [402.046875, 3837.953125, 168, 74], [402.046875, 3913.453125, 168, 49], [402.046875, 3964.453125, 168, 49], [402.046875, 4015.453125, 168, 49], [402.046875, 4066.453125, 168, 98]]}, "cells": {"text": ["Automatic respawn anchor recharger Basic logic gates Command block Flying machines Hopper Item transportation Mechanisms Observer stabilizer Combination locks Randomizers Redstone music Redstone tips Rube Goldberg machine Shulker box storage Villager trading hall", "Block update detector Comparator update detector Daylight sensor Day night detector", "Train station Minecarts Storage Storage system", "Snow golems TNT cannons Trapdoor uses Trap design Traps", "Piston uses Piston circuits Quasi-connectivity Zero-ticking Instant repeaters", "Advanced redstone circuits Arithmetic logic Calculator Command stats Hourly clock Morse code Printer Redstone computers Redstone telegraph"], "bboxes": [[572.046875, 3664.453125, 353, 172], [572.046875, 3837.953125, 353, 74], [572.046875, 3913.453125, 353, 49], [572.046875, 3964.453125, 353, 49], [572.046875, 4015.453125, 353, 49], [572.046875, 4066.453125, 353, 98]]}}, {"bbox": [400.046875, 4215.453125, 527, 102], "headers": {"text": ["Server setup"], "bboxes": [[402.046875, 4217.453125, 109, 98]]}, "cells": {"text": ["Setting up a server Server startup script FreeBSD startup script OpenBSD startup script Ubuntu startup script Setting up a Hamachi server Setting up a Minecraft Forge server Setting up a Spigot server Ramdisk enabled server"], "bboxes": [[513.046875, 4217.453125, 412, 98]]}}, {"bbox": [400.046875, 4341.953125, 527, 428], "headers": {"text": ["Maps", "Resource packs", "Data packs", "Creating Minecraft media", "Game installation"], "bboxes": [[402.046875, 4343.953125, 198, 74], [402.046875, 4419.453125, 198, 49], [402.046875, 4470.453125, 198, 25], [402.046875, 4496.953125, 198, 25], [402.046875, 4523.453125, 198, 245]]}, "cells": {"text": ["Custom maps Map downloads Command NBT tags Falling blocks Updating old terrain using MCEdit", "Creating a resource pack Loading a resource pack Sound directory", "Creating a data pack Installing a data pack", "Creating videos Livestreaming", "Installing snapshots Joining and leaving the Bedrock Edition beta program How to get a crash report Installing Forge mods Custom Minecraft directory Playing and saving Minecraft on a thumb drive Playing and saving Minecraft on a thumb drive with the old launcher Recover corrupted saved world data Run Minecraft through Google Drive Save game data to Dropbox (world data only) Saved data Dropbox guide"], "bboxes": [[602.046875, 4343.953125, 323, 74], [602.046875, 4419.453125, 323, 49], [602.046875, 4470.453125, 323, 25], [602.046875, 4496.953125, 323, 25], [602.046875, 4523.453125, 323, 245]]}}], "images": [], "sprites": [{"text": "Things not to do", "bbox": [772.046875, 1977.453125, 16, 16]}, {"text": "Best building materials", "bbox": [715.046875, 2028.453125, 16, 16]}, {"text": "Navigation", "bbox": [730.046875, 2052.953125, 16, 16]}, {"text": "Achievement guide", "bbox": [404.046875, 2103.953125, 16, 16]}, {"text": "Advancement guide", "bbox": [559.40625, 2103.953125, 16, 16]}, {"text": "Best enchantments guide", "bbox": [718.765625, 2103.953125, 16, 16]}, {"text": "Breaking bedrock", "bbox": [404.046875, 2128.453125, 16, 16]}, {"text": "Combat", "bbox": [546.40625, 2128.453125, 16, 16]}, {"text": "Creating a village", "bbox": [404.046875, 2152.953125, 16, 16]}, {"text": "Dual wielding", "bbox": [544.40625, 2152.953125, 16, 16]}, {"text": "End survival", "bbox": [659.765625, 2152.953125, 16, 16]}, {"text": "Gathering resources on peaceful difficulty", "bbox": [404.046875, 2177.453125, 16, 16]}, {"text": "Getting food quickly", "bbox": [702.40625, 2177.453125, 16, 16]}, {"text": "Headless pistons", "bbox": [404.046875, 2201.953125, 16, 16]}, {"text": "Horses", "bbox": [611.40625, 2201.953125, 16, 16]}, {"text": "Indestructible end crystals", "bbox": [687.765625, 2201.953125, 16, 16]}, {"text": "Mapping", "bbox": [404.046875, 2226.453125, 16, 16]}, {"text": "Measuring distance", "bbox": [489.40625, 2226.453125, 16, 16]}, {"text": "Mining", "bbox": [797.765625, 2226.453125, 16, 16]}, {"text": "Diamonds", "bbox": [404.046875, 2250.953125, 16, 16]}, {"text": "Fossils", "bbox": [499.40625, 2250.953125, 16, 16]}, {"text": "Ancient Debris", "bbox": [573.765625, 2250.953125, 16, 16]}, {"text": "Nether hub", "bbox": [702.125, 2250.953125, 16, 16]}, {"text": "Nether portals", "bbox": [806.484375, 2250.953125, 16, 16]}, {"text": "Nether survival", "bbox": [415.046875, 2275.453125, 16, 16]}, {"text": "Organization", "bbox": [544.40625, 2275.453125, 16, 16]}, {"text": "PvP", "bbox": [751.765625, 2275.453125, 16, 16]}, {"text": "Spawn-proofing", "bbox": [404.046875, 2299.953125, 16, 16]}, {"text": "Summoning jockeys", "bbox": [539.40625, 2299.953125, 16, 16]}, {"text": "The Void", "bbox": [699.765625, 2299.953125, 16, 16]}, {"text": "Time-saving tips", "bbox": [786.125, 2299.953125, 16, 16]}, {"text": "Thunderstorm survival", "bbox": [404.046875, 2324.453125, 16, 16]}, {"text": "Village mechanics", "bbox": [404.046875, 2348.953125, 16, 16]}, {"text": "X-ray glitches", "bbox": [611.40625, 2348.953125, 18, 18]}, {"text": "Acquiring a conduit", "bbox": [404.046875, 2375.453125, 16, 16]}, {"text": "Curing a zombie villager", "bbox": [557.40625, 2375.453125, 16, 16]}, {"text": null, "bbox": [738.765625, 2375.453125, 16, 16]}, {"text": "Defeating temples", "bbox": [754.765625, 2375.453125, 16, 16]}, {"text": "Defeating a village raid", "bbox": [404.046875, 2399.953125, 16, 16]}, {"text": "Defeating a Nether fortress", "bbox": [580.40625, 2399.953125, 16, 16]}, {"text": "Defeating a bastion remnant", "bbox": [404.046875, 2424.453125, 16, 16]}, {"text": "Defeating a dungeon", "bbox": [616.40625, 2424.453125, 16, 16]}, {"text": "Defeating a pillager outpost", "bbox": [404.046875, 2448.953125, 16, 16]}, {"text": "Defeating a woodland mansion", "bbox": [610.40625, 2448.953125, 16, 16]}, {"text": "Defeating a monument", "bbox": [404.046875, 2473.453125, 16, 16]}, {"text": "Defeating an End city", "bbox": [581.40625, 2473.453125, 16, 16]}, {"text": "Defeating the Ender dragon", "bbox": [404.046875, 2497.953125, 16, 16]}, {"text": "Defeating the Wither", "bbox": [611.40625, 2497.953125, 16, 16]}, {"text": "Exploring an ancient city", "bbox": [404.046875, 2522.453125, 16, 16]}, {"text": "Hardcore mode", "bbox": [583.046875, 2573.453125, 16, 16]}, {"text": "Infinite desert survival", "bbox": [664.046875, 2597.953125, 16, 16]}, {"text": "Island survival", "bbox": [583.046875, 2622.453125, 16, 16]}, {"text": "Manhunt", "bbox": [705.40625, 2622.453125, 16, 16]}, {"text": "Superflat survival", "bbox": [785.046875, 2646.953125, 16, 16]}, {"text": "Building a rollercoaster", "bbox": [584.046875, 2748.953125, 16, 16]}, {"text": "Building safe homes", "bbox": [760.40625, 2748.953125, 16, 16]}, {"text": "Building water features", "bbox": [404.046875, 2773.453125, 16, 16]}, {"text": "Defense", "bbox": [789.40625, 2773.453125, 16, 16]}, {"text": "Desert shelter", "bbox": [404.046875, 2797.953125, 16, 16]}, {"text": "Endless circling pool", "bbox": [597.40625, 2797.953125, 16, 16]}, {"text": "Furniture", "bbox": [756.765625, 2797.953125, 16, 16]}, {"text": "Glazed terracotta patterns", "bbox": [404.046875, 2822.453125, 16, 16]}, {"text": "Ranches", "bbox": [792.40625, 2822.453125, 16, 16]}, {"text": "Underwater home", "bbox": [564.046875, 2871.453125, 16, 16]}, {"text": "Water gate", "bbox": [404.046875, 2895.953125, 16, 16]}, {"text": "Water-powered boat transportation", "bbox": [504.40625, 2895.953125, 16, 16]}, {"text": "Amethyst", "bbox": [545.046875, 2922.453125, 16, 16]}, {"text": "Armor", "bbox": [639.40625, 2922.453125, 16, 16]}, {"text": "Azalea", "bbox": [709.765625, 2922.453125, 16, 16]}, {"text": "Bamboo", "bbox": [784.125, 2922.453125, 16, 16]}, {"text": "Basalt", "bbox": [545.046875, 2946.953125, 16, 16]}, {"text": "Bedrock", "bbox": [616.40625, 2946.953125, 16, 16]}, {"text": "Blaze rod", "bbox": [700.765625, 2946.953125, 16, 16]}, {"text": "Bone meal", "bbox": [791.125, 2946.953125, 16, 16]}, {"text": "Cactus", "bbox": [545.046875, 2971.453125, 16, 16]}, {"text": "Chorus fruit", "bbox": [621.40625, 2971.453125, 16, 16]}, {"text": null, "bbox": [727.765625, 2971.453125, 16, 16]}, {"text": null, "bbox": [746.765625, 2971.453125, 16, 16]}, {"text": "Cobblestone", "bbox": [545.046875, 2995.953125, 16, 16]}, {"text": "Cocoa bean", "bbox": [656.40625, 2995.953125, 16, 16]}, {"text": "Copper", "bbox": [763.765625, 2995.953125, 16, 16]}, {"text": null, "bbox": [841.125, 2995.953125, 16, 16]}, {"text": null, "bbox": [857.125, 2995.953125, 16, 16]}, {"text": null, "bbox": [873.125, 2995.953125, 16, 16]}, {"text": "Crops (Beetroot, Carrot, Potato, Wheat)", "bbox": [545.046875, 3020.453125, 16, 16]}, {"text": "Dirt", "bbox": [824.40625, 3020.453125, 16, 16]}, {"text": null, "bbox": [878.765625, 3020.453125, 16, 16]}, {"text": "Dripleaf", "bbox": [659.046875, 3044.953125, 16, 16]}, {"text": "Dripstone", "bbox": [740.40625, 3044.953125, 16, 16]}, {"text": "Egg", "bbox": [833.765625, 3044.953125, 16, 16]}, {"text": "Fern", "bbox": [545.046875, 3069.453125, 16, 16]}, {"text": "Fish", "bbox": [605.40625, 3069.453125, 16, 16]}, {"text": "Flower", "bbox": [663.765625, 3069.453125, 16, 16]}, {"text": "Froglight", "bbox": [738.125, 3069.453125, 16, 16]}, {"text": "Glow berries", "bbox": [545.046875, 3093.953125, 16, 16]}, {"text": "Glow ink sac", "bbox": [655.40625, 3093.953125, 16, 16]}, {"text": "Glow lichen", "bbox": [765.765625, 3093.953125, 16, 16]}, {"text": "Gold", "bbox": [871.125, 3093.953125, 16, 16]}, {"text": "Hanging root", "bbox": [556.046875, 3118.453125, 16, 16]}, {"text": "Honey", "bbox": [669.40625, 3118.453125, 16, 16]}, {"text": "Ice", "bbox": [742.765625, 3118.453125, 16, 16]}, {"text": "Iron", "bbox": [794.125, 3118.453125, 16, 16]}, {"text": "Kelp", "bbox": [850.484375, 3118.453125, 16, 16]}, {"text": "Lava", "bbox": [545.046875, 3142.953125, 16, 16]}, {"text": "Meat", "bbox": [608.40625, 3142.953125, 16, 16]}, {"text": "Moss block", "bbox": [671.765625, 3142.953125, 16, 16]}, {"text": "Mushroom", "bbox": [773.125, 3142.953125, 16, 16]}, {"text": "Music disc", "bbox": [545.046875, 3167.453125, 16, 16]}, {"text": "Nautilus shell", "bbox": [642.40625, 3167.453125, 16, 16]}, {"text": "Nether growth", "bbox": [758.765625, 3167.453125, 16, 16]}, {"text": "Nether vine", "bbox": [545.046875, 3191.953125, 16, 16]}, {"text": "Nether wart", "bbox": [651.40625, 3191.953125, 16, 16]}, {"text": "Obsidian", "bbox": [759.765625, 3191.953125, 16, 16]}, {"text": "Powder snow", "bbox": [545.046875, 3216.453125, 16, 16]}, {"text": null, "bbox": [662.40625, 3216.453125, 16, 16]}, {"text": "Pumpkin, Melon", "bbox": [678.40625, 3216.453125, 16, 16]}, {"text": "Rooted dirt", "bbox": [808.765625, 3216.453125, 16, 16]}, {"text": "Sculk growths", "bbox": [545.046875, 3240.953125, 16, 16]}, {"text": "Scute", "bbox": [667.40625, 3240.953125, 16, 16]}, {"text": "Seagrass", "bbox": [736.765625, 3240.953125, 16, 16]}, {"text": "Sea pickle", "bbox": [828.125, 3240.953125, 16, 16]}, {"text": "Snow", "bbox": [545.046875, 3265.453125, 16, 16]}, {"text": "Soul soil", "bbox": [612.40625, 3265.453125, 16, 16]}, {"text": "Sugar cane", "bbox": [695.765625, 3265.453125, 16, 16]}, {"text": "Sweet berries", "bbox": [800.125, 3265.453125, 16, 16]}, {"text": "Tree", "bbox": [545.046875, 3289.953125, 16, 16]}, {"text": "Trident", "bbox": [604.40625, 3289.953125, 16, 16]}, {"text": "Vine", "bbox": [679.765625, 3289.953125, 16, 16]}, {"text": "Villager trading hall", "bbox": [739.125, 3289.953125, 16, 16]}, {"text": "Wither rose", "bbox": [545.046875, 3314.453125, 16, 16]}, {"text": "Wool", "bbox": [648.40625, 3314.453125, 16, 16]}, {"text": "Spawner traps", "bbox": [727.046875, 3340.953125, 16, 16]}, {"text": "Animals (Cows, Pigs, Sheep)", "bbox": [545.046875, 3365.453125, 16, 16]}, {"text": "Axolotl", "bbox": [754.40625, 3365.453125, 16, 16]}, {"text": "Blaze", "bbox": [829.765625, 3365.453125, 16, 16]}, {"text": "Cave spider", "bbox": [545.046875, 3389.953125, 16, 16]}, {"text": "Creeper", "bbox": [651.40625, 3389.953125, 16, 16]}, {"text": "Drowned", "bbox": [733.765625, 3389.953125, 16, 16]}, {"text": "Ender dragon", "bbox": [545.046875, 3414.453125, 16, 16]}, {"text": "Enderman", "bbox": [661.40625, 3414.453125, 16, 16]}, {"text": "Frog", "bbox": [757.765625, 3414.453125, 16, 16]}, {"text": "Guardian", "bbox": [818.125, 3414.453125, 16, 16]}, {"text": "Hoglin", "bbox": [545.046875, 3438.953125, 16, 16]}, {"text": "Iron golem", "bbox": [616.40625, 3438.953125, 16, 16]}, {"text": "Magma cube", "bbox": [714.765625, 3438.953125, 16, 16]}, {"text": "Phantom", "bbox": [828.125, 3438.953125, 16, 16]}, {"text": "Piglin bartering farm", "bbox": [545.046875, 3463.453125, 16, 16]}, {"text": "Raid", "bbox": [704.40625, 3463.453125, 16, 16]}, {"text": "Shulker", "bbox": [763.765625, 3463.453125, 16, 16]}, {"text": "Slime", "bbox": [844.125, 3463.453125, 16, 16]}, {"text": "Squid", "bbox": [545.046875, 3487.953125, 16, 16]}, {"text": "Turtle", "bbox": [612.40625, 3487.953125, 16, 16]}, {"text": "Villager", "bbox": [679.765625, 3487.953125, 16, 16]}, {"text": "Wandering trader", "bbox": [758.125, 3487.953125, 16, 16]}, {"text": "Witch", "bbox": [545.046875, 3512.453125, 16, 16]}, {"text": "Wither", "bbox": [612.40625, 3512.453125, 16, 16]}, {"text": "Wither skeleton", "bbox": [684.765625, 3512.453125, 16, 16]}, {"text": "Zombie", "bbox": [814.125, 3512.453125, 16, 16]}, {"text": "Zombified piglin", "bbox": [545.046875, 3536.953125, 16, 16]}, {"text": "Enchantment mechanics", "bbox": [404.046875, 3589.953125, 16, 16]}, {"text": "Anvil mechanics", "bbox": [596.40625, 3589.953125, 16, 16]}, {"text": "Automatic smelting", "bbox": [732.765625, 3589.953125, 16, 16]}, {"text": "Manual smelting", "bbox": [404.046875, 3614.453125, 16, 16]}, {"text": "Blast chamber", "bbox": [404.046875, 3640.953125, 16, 16]}, {"text": "Wither cage", "bbox": [528.40625, 3640.953125, 16, 16]}, {"text": "Automatic respawn anchor recharger", "bbox": [574.046875, 3667.453125, 16, 16]}, {"text": "Command block", "bbox": [621.046875, 3691.953125, 16, 16]}, {"text": "Flying machines", "bbox": [754.40625, 3691.953125, 16, 16]}, {"text": "Hopper", "bbox": [574.046875, 3716.453125, 16, 16]}, {"text": "Item transportation", "bbox": [652.40625, 3716.453125, 16, 16]}, {"text": "Observer stabilizer", "bbox": [574.046875, 3740.953125, 16, 16]}, {"text": "Combination locks", "bbox": [723.40625, 3740.953125, 16, 16]}, {"text": "Redstone music", "bbox": [668.046875, 3765.453125, 16, 16]}, {"text": "Shulker box storage", "bbox": [738.046875, 3789.953125, 16, 16]}, {"text": "Villager trading hall", "bbox": [574.046875, 3814.453125, 16, 16]}, {"text": "Comparator update detector", "bbox": [574.046875, 3865.453125, 16, 16]}, {"text": "Daylight sensor", "bbox": [787.40625, 3865.453125, 16, 16]}, {"text": "Minecarts", "bbox": [663.046875, 3916.453125, 16, 16]}, {"text": "Storage", "bbox": [754.40625, 3916.453125, 16, 16]}, {"text": "Snow golems", "bbox": [574.046875, 3967.453125, 16, 16]}, {"text": "TNT cannons", "bbox": [690.40625, 3967.453125, 16, 16]}, {"text": "Trapdoor uses", "bbox": [805.765625, 3967.453125, 16, 16]}, {"text": "Piston uses", "bbox": [574.046875, 4018.453125, 16, 16]}, {"text": "Instant repeaters", "bbox": [663.046875, 4042.953125, 16, 16]}, {"text": "Command stats", "bbox": [650.046875, 4093.953125, 16, 16]}, {"text": "Hourly clock", "bbox": [781.40625, 4093.953125, 16, 16]}, {"text": "Spawn jail", "bbox": [668.046875, 4169.453125, 16, 16]}, {"text": "Far Lands", "bbox": [404.046875, 4797.953125, 16, 16]}, {"text": "Managing slimes in superflat mode", "bbox": [404.046875, 4822.453125, 16, 16]}, {"text": "Minecart booster", "bbox": [653.40625, 4822.453125, 16, 16]}, {"text": "Potion farming", "bbox": [792.765625, 4822.453125, 16, 16]}, {"text": "Village chaining", "bbox": [526.046875, 4871.453125, 16, 16]}], "texts": [{"text": "Tutorials/Architectural terms", "bbox": [202.046875, 349.5, 593, 45]}, {"text": "This page explains the definition for a variety of terms used when building in Minecraft. This is not a comprehensive list; only those terms which are usable for features at normal Minecraft scales will be covered.", "bbox": [202.046875, 439, 726, 49]}, {"text": "List of terms", "bbox": [202.046875, 512, 726, 43]}, {"text": "See also", "bbox": [202.046875, 1653.5, 726, 43]}, {"text": "Tutorials/Game terms\nTutorials/Construction\nTutorials/Walls and buttresses", "bbox": [238.046875, 1705.5, 690, 73]}, {"text": "External links", "bbox": [202.046875, 1797, 726, 43]}, {"text": "Architectural term glossary (wikipedia)", "bbox": [238.046875, 1849, 690, 25]}]}