{"metadata": {"url": "https://minecraft.fandom.com/wiki/RubyDung", "title": "RubyDung", "time": "17/04/2022 00:13:46"}, "tables": [], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/a/ad/Rubydung5.jpg", "path": "images/img.jpg", "alt_text": "", "caption": "One of the only screenshots available for RubyDung.", "bbox": [747.9375, 418.890625, 180, 135]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/5/5f/200902092053_terrain.png", "path": "images/img.png", "alt_text": "", "caption": "The terrain.png file from RubyDung.", "bbox": [747.9375, 2332.90625, 180, 180]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/7/7e/Rubydung1.jpg", "path": "images/Rubydung1.jpg", "alt_text": "Rubydung1", "caption": null, "bbox": [255.046875, 2716.40625, 120, 90]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/6/64/Rubydung2.jpg", "path": "images/Rubydung2.jpg", "alt_text": "Rubydung2", "caption": null, "bbox": [413.046875, 2716.40625, 120, 90]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/f1/Rubydung3.jpg", "path": "images/Rubydung3.jpg", "alt_text": "Rubydung3", "caption": null, "bbox": [571.046875, 2716.40625, 120, 90]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/5/50/Rubydung4.jpg", "path": "images/Rubydung4.jpg", "alt_text": "Rubydung4", "caption": null, "bbox": [729.046875, 2716.40625, 120, 90]}], "sprites": [], "texts": [{"text": "RubyDung", "bbox": [202.046875, 353.890625, 593, 45]}, {"text": "RubyDung was an unreleased strategy game created by Notch before Minecraft, developed until May 2009 at the earliest.[note 1] Not much else is known about the game other than it was influenced by Dwarf Fortress, and that it was cancelled early in development, before it was even released. Notch's next game would be Minecraft (later known as Minecraft: Java Edition), which is based on RubyDung's codebase.", "bbox": [202.046875, 418.890625, 726, 147]}, {"text": "The name \"RubyDung\" was a placeholder name for a \"dungeon game in the rubylands\", the \"rubylands\" being a rough idea for a game world that Notch had.[1] Rubylands is a project Notch was developing in early 2008.[2][3]", "bbox": [202.046875, 589.890625, 726, 74]}, {"text": "Contents", "bbox": [215.046875, 703.140625, 81, 17]}, {"text": "1 About\n2 Planned Features\n2.1 Items\n3 Creation of Minecraft\n4 Gallery\n5 Notes\n6 References\n7 See also", "bbox": [203.046875, 736.40625, 185, 246]}, {"text": "About", "bbox": [202.046875, 1007.40625, 726, 43]}, {"text": "While most gameplay features/mechanics are unknown, as the game was cancelled during a pre-alpha state - the game was meant to be a clone of Dwarf Fortress had it been finished. It would be easier to play with a heavy focus on accessibility, unlike the former game which has been remarked for being quite complicated and unfriendly to beginners. Since the game was in an early development stage, no GUI, text, or any other such features appear in any of the existing screenshots of the game. There was, however, coding implemented for the player to fight enemies, fire heroes, and hire new ones shown with text on the screen.[4]", "bbox": [202.046875, 1059.40625, 726, 147]}, {"text": "The game featured a 3D isometric perspective, as opposed to Dwarf Fortress's 2D tile-based graphics. It also included a 3d texture mapper, and randomly colored grass and cobblestone textures on the fly. The terrain generation was quite varied, containing many bumps, hills, and monoliths. Unlike the blocky nature of Minecraft, there appeared many sloped surfaces. There were trees using billboard sprites present in the game as well, of which there are lots of in the screenshots that they are present in. In earlier versions of the game, there was also a dirt material which formed maze-like dirt paths, and an alternate, earlier grass texture less resembling the one seen in Minecraft. The only known creatures implemented were the bunny and the hero. It is unknown if there were any sprites for them.[5]", "bbox": [202.046875, 1230.40625, 726, 196]}, {"text": "After the game was cancelled early in development, the codebase would later be reused for Minecraft. Even the grass block and cobblestone block textures that appear in later versions of the RubyDung would appear in the earliest builds of Minecraft.", "bbox": [202.046875, 1450.40625, 726, 73]}, {"text": "Planned Features", "bbox": [202.046875, 1547.90625, 726, 43]}, {"text": "The game was going to be a group manager where you would assemble, equip, level up, and pay heroes of which some progress had been made. A local town would provide quests for the heroes on which the player could send them. When they returned, a replay animation would show of the quest, and the player would get to distribute/sell/equip any loot gathered. The player would gain experience points to level up. The player's level determined how big or how many groups one could have. The player could also construct better headquarters.[6]", "bbox": [202.046875, 1599.90625, 726, 123]}, {"text": "Items", "bbox": [202.046875, 1746.40625, 726, 22]}, {"text": "Items would have existed in three forms:", "bbox": [202.046875, 1780.90625, 726, 25]}, {"text": "Normal Items - These would have been carried, stackable, and have a single use (disappear when used). They would have mostly been collectables and materials. Notch gave examples of such items as: Healing Potion, Crossbow Bolt, and Dragon Hide.[7]", "bbox": [238.046875, 1829.40625, 690, 73]}, {"text": "Multi Use Items - These would have been similar to normal items, except rendered as single items with more than a single use. They would have also have not been stackable. Notch gave examples of such items as: Wand of Healing, and Hot Meal.[8]", "bbox": [238.046875, 1920.90625, 690, 74]}, {"text": "Equipables - These would have consisted of an item type, a material, an optional prefix, and an optional suffix. The item type decides what slot the item could have been equipped in such as a helmet for the head slot. Materials would range from normal ones (iron, wood, etc) to exotic ones that require hero traits to use (glass, dragonscale, etc.) Notch gave examples of such items as: Iron Boots, Legendary Silver Necklace of Gloom, Decorated Wool Cape, and Copper Sword of Dragon Slaying.[9]\nPrefixes would have been single adjectives (Legendary, Blessed, Fine) and would modify the item stats. Suffixes would be in the form \"of <word>\", and add special abilities to the item depending on the suffix.", "bbox": [238.046875, 2012.40625, 690, 202]}, {"text": "Creation of Minecraft", "bbox": [202.046875, 2280.90625, 726, 43]}, {"text": "RubyDung inspired Notch to make Minecraft when he wanted RubyDung to have a first-person view, but when he tried making this, he thought that the textures were too blurry and distorted. Shortly after Notch's days coding for RubyDung, he came across the game Infiniminer, which put down the foundations for Minecraft.", "bbox": [202.046875, 2332.90625, 726, 98]}, {"text": "On October 30, 2009, Notch talked about RubyDung on his blog in an entry titled \"The Origins of Minecraft\".", "bbox": [202.046875, 2454.90625, 726, 49]}, {"text": "Minecraft's source code came from RubyDung, as such, the earliest versions of Minecraft still internally refer to themselves as RubyDung, and still contain the terrain.png file from RubyDung, which dates to February 2009.", "bbox": [202.046875, 2527.90625, 726, 74]}, {"text": "Gallery", "bbox": [202.046875, 2625.40625, 726, 43]}, {"text": "Notes", "bbox": [202.046875, 2857.40625, 726, 43]}, {"text": "The earliest builds of Minecraft, which is based on RubyDung's codebase, still contain the terrain.png file from RubyDung, and it dates to February 2009.", "bbox": [238.046875, 2912.40625, 669, 42]}, {"text": "References", "bbox": [202.046875, 2976.40625, 726, 43]}, {"text": "\"Dunno if I told anyone this, but that version was called \"rubydung\", as a placeholder name for a dungeon game in the rubylands rough gameworld i had in my head.\" – @notch on Twitter, July 18, 2018", "bbox": [238.046875, 3031.40625, 671, 42]}, {"text": "https://jvm-gaming.org/t/rubylands-teaser-very-alpha/31375", "bbox": [248.046875, 3080.40625, 404, 17]}, {"text": "https://web.archive.org/web/20080807172134/http://www.rubylands.com/", "bbox": [248.046875, 3104.90625, 495, 17]}, {"text": "https://jvm-gaming.org/t/rubylands-teaser-very-alpha/31375/9", "bbox": [248.046875, 3129.40625, 419, 17]}, {"text": "https://jvm-gaming.org/t/rubylands-teaser-very-alpha/31375/9", "bbox": [248.046875, 3153.90625, 419, 17]}, {"text": "https://jvm-gaming.org/t/rubylands-teaser-very-alpha/31375/6", "bbox": [248.046875, 3178.40625, 418, 17]}, {"text": "https://web.archive.org/web/20080807172134/http://www.rubylands.com/", "bbox": [248.046875, 3202.90625, 495, 17]}, {"text": "https://web.archive.org/web/20080807172134/http://www.rubylands.com/", "bbox": [248.046875, 3227.40625, 495, 17]}, {"text": "https://web.archive.org/web/20080807172134/http://www.rubylands.com/", "bbox": [248.046875, 3251.90625, 495, 17]}, {"text": "See also", "bbox": [202.046875, 3291.40625, 726, 43]}, {"text": "Dwarf Fortress, another game preceding Minecraft.\nDwarf Fortress Wiki\nDwarf Fortress Website\nInfiniminer, another game preceding Minecraft.\nZombie Town, another game preceding Minecraft.\nLegend of the Chambered, another game preceding Minecraft.\nMinicraft", "bbox": [238.046875, 3343.40625, 690, 195]}]}