{"metadata": {"url": "https://minecraft.fandom.com/wiki/Chat", "title": "Chat", "time": "16/04/2022 22:44:01"}, "tables": [], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/9/9e/Multiplayer_Chat.png", "path": "images/img.png", "alt_text": "", "caption": "A multiplayer chat snippet.", "bbox": [747.9375, 538, 180, 102]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/0/0a/Textformatting.png", "path": "images/img (1).png", "alt_text": "", "caption": "Shows (from up to down) bold, strikethrough, underlined, italicized, and reset (§r) text (also default)", "bbox": [747.9375, 681, 180, 48]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/e/e8/Chat_button.png", "path": "images/Chat button.png", "alt_text": "Chat button", "caption": null, "bbox": [439.984375, 659.5, 25, 25]}, {"src": "https://static.wikia.nocookie.net/ucp-internal-test-starter-commons/images/3/33/XboxOne_Right.png", "path": "images/D-pad right.png", "alt_text": "D-pad right", "caption": null, "bbox": [656.984375, 659.5, 25, 25]}], "sprites": [], "texts": [{"text": "Chat", "bbox": [202.046875, 473, 593, 45]}, {"text": "The chat is a messaging system used to communicate with other players, or to enter commands.", "bbox": [202.046875, 538, 726, 49]}, {"text": "Several of these commands are configurable (the defaults are shown here).", "bbox": [202.046875, 611, 726, 25]}, {"text": "Players can press T(for keyboard) / ‌[BE & EE only](for touchscreen) / ‌[BE only](for controller) to open the chat and talk to other players. Chat functions include:", "bbox": [202.046875, 659.5, 726, 49]}, {"text": "Chat history - A small scroll bar is on the side of the chat bar. The player can also scroll using the mouse wheel or PgUp and PgDn. The last 100 chat messages are stored. Holding down ⇧ Left Shift or ⇧ Right Shift and attempting to scroll up or down slows down scrolling.\nThe player can view their own recently sent messages by pressing the ↑ and ↓ keys while typing.\nClickable links can be pasted in chat.\nThe ability to copy (Ctrl + C) & paste (Ctrl + V) in chat (⌘ Cmd is used as a replacement for Ctrl on some Macs). ⇧ Shift + ↑, ↓, ←, → selects text for the player.\nFont styling: the section symbol (§) allows players to change the style of the text. See the list of formatting codes for further details.\nNote: the section symbol cannot be typed in vanilla clients because they are restricted characters. Even in single player, if § is pasted and posted in chat, the player who sent it is automatically kicked with an \"Illegal characters in chat\" message, and a server-side disconnect.endOfStream error is given. Even in single player, the only available button opens the server selection screen.\nOn Bedrock Edition, certain emojis appear as icons in-game, such as the hunger and armor icons[1]. Other emojis and unknown character show up as a ? (question mark.)", "bbox": [238.046875, 733, 690, 440]}, {"text": "Players can also type commands into the chatbox. Commands are identified by the server with the use of a forward slash (/) at the beginning of the message.", "bbox": [202.046875, 1191, 726, 49]}, {"text": "Simply pressing / acts like a command key; it opens the chat with a / in it.\nTyping / and then pressing Tab ↹ lists available commands, similar to entering the /help command.", "bbox": [238.046875, 1264, 690, 80]}, {"text": "While typing, pressing Tab ↹ autocompletes the first possible command or username starting with the letter(s) typed. If there are multiple usernames or commands beginning with the letter(s), the chat displays a list of possibilities; pressing tab again scrolls through the list.", "bbox": [202.046875, 1361.5, 726, 73]}, {"text": "Some commands may also have additional parameters that may be autocompleted by pressing Tab ↹ at that point.\nCertain commands that handle blocks (/blockdata, /fill, etc.) have parameters that need the x, y, and z coordinates of the target block(s). Using the Tab ↹ key when these coordinates are needed automatically adds the coordinates of the block the player is looking at.", "bbox": [238.046875, 1459, 690, 129]}, {"text": "In Java Edition, the chatbox can be reduced in size, the opacity may be adjusted or it may be hidden via the chat settings in the options menu. In Bedrock Edition, the chat settings are found within the chat screen and include options to change the color of the chat, the font, and its size.", "bbox": [202.046875, 1605.5, 726, 73]}, {"text": "In Bedrock Edition, swear words in multiple languages are censored and show up as asterisks.", "bbox": [202.046875, 1703, 726, 25]}, {"text": "Errors", "bbox": [202.046875, 1751.5, 726, 20]}, {"text": "If the player types a nonexistent command, the command contains syntax errors or the player does not have permission to use the specified command, the player receives an error message and the command does not function.", "bbox": [202.046875, 1780.5, 726, 73]}, {"text": "The user then receives an error message that is only seen by the user who has done the error that can be of all reasons why above.", "bbox": [202.046875, 1878, 726, 49]}, {"text": "References", "bbox": [202.046875, 1951, 726, 43]}, {"text": "https://github.com/TwistedAsylumMC/bedrock-unicode-characters", "bbox": [248.046875, 2006, 438, 17]}]}