{"metadata": {"url": "https://minecraft.fandom.com/wiki/Taxicab_distance", "title": "Taxicab_distance", "time": "17/04/2022 03:32:56"}, "tables": [], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/8/89/Taxicab_vs_euclidean.png", "path": "images/img.png", "alt_text": "", "caption": "Taxicab distance is the distance a taxicab would travel on streets connecting square city blocks.", "bbox": [527.9375, 378, 400, 332]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/2/2b/MinecraftTaxicab.png", "path": "images/img (1).png", "alt_text": "", "caption": "Taxicab distance as represented by Minecraft blocks rather than city streets.", "bbox": [747.9375, 1479.765625, 180, 144]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/8/83/Water_spread_v1-13.png", "path": "images/img (2).png", "alt_text": "", "caption": null, "bbox": [255.046875, 2233.265625, 120, 69]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/e/e9/Lava_spread_v1-13.png", "path": "images/img (3).png", "alt_text": "", "caption": null, "bbox": [413.046875, 2229.765625, 120, 76]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/4/42/LightEmittingBlocks.png", "path": "images/img (4).png", "alt_text": "", "caption": null, "bbox": [600.546875, 2207.765625, 61, 120]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/4/47/Lightning_distribution_BE.png", "path": "images/img (5).png", "alt_text": "", "caption": null, "bbox": [729.046875, 2233.765625, 120, 68]}], "sprites": [], "texts": [{"text": "Taxicab distance", "bbox": [202.046875, 313, 593, 45]}, {"text": "Taxicab distance, also known as rectilinear distance, city block distance, Manhattan distance, and other names, is a metric in taxicab geometry for measuring distance, as an alternative to Euclidean distance (straight-line, or \"as the crow flies\"). Minecraft uses taxicab distance as an efficient range measurement in several elements of the game.", "bbox": [202.046875, 378, 726, 196]}, {"text": "Contents", "bbox": [215.046875, 613.75, 81, 17]}, {"text": "1 Calculation\n2 Usage in Minecraft\n2.1 Taxicab\n2.2 Euclidean", "bbox": [203.046875, 647.015625, 170, 132]}, {"text": "Calculation", "bbox": [202.046875, 804.015625, 726, 43]}, {"text": "Minecraft measures the distance between two points in three-dimensional space in one of two ways, Euclidean distance or taxicab distance, depending on whether geometric accuracy or calculation efficiency is desired.", "bbox": [202.046875, 856.015625, 726, 49]}, {"text": "Euclidean distance", "bbox": [202.046875, 929.015625, 726, 25]}, {"text": "Given two points in 3-D space and , the straight-line distance (Euclidean distance) between them is:", "bbox": [202.046875, 953.515625, 726, 49]}, {"text": "This is geometrically the most accurate calculation. The square root operation, if it needs to be done many times during a game tick, can be processor intensive, particularly on mobile devices that may have slow processors. Too many processor-intensive operations can introduce lag in the game.", "bbox": [202.046875, 1061.765625, 726, 73]}, {"text": "Taxicab distance", "bbox": [202.046875, 1159.265625, 726, 25]}, {"text": "The taxicab distance is a simplified calculation that eliminates the square root and squaring operations by simply calculating the absolute value (positive value) of the difference between each coordinate value:", "bbox": [202.046875, 1183.765625, 726, 49]}, {"text": "This is a less accurate but more efficient calculation suitable for efficiently processing numerous or rapidly-repeating calculations in a short time. A consequence of this calculation is that a taxicab \"circle\" drawn with a constant taxicab radius appears as a diamond, in which the taxicab radius equals the Euclidean radius only in the four cardinal directions (north, south, east, west), and the radius is shorter in all other directions. Similarly, in three dimensions, a taxicab \"sphere\" appears as an octahedron.", "bbox": [202.046875, 1281.265625, 726, 123]}, {"text": "Usage in Minecraft", "bbox": [202.046875, 1427.765625, 726, 43]}, {"text": "Taxicab", "bbox": [202.046875, 1494.765625, 726, 22]}, {"text": "Minecraft makes use of taxicab distance in various situations:", "bbox": [202.046875, 1529.265625, 726, 25]}, {"text": "Light from light sources such as torches, campfires, lanterns, glowstone, etc. illuminate surfaces according to taxicab distance.\nTorches also also melt snow layers within 2 blocks and ice within 3 blocks taxicab distance.\nHeat blocks‌[Education Edition only] melt snow layers and ice within 2 blocks taxicab distance, but do not emit light.\nLiquid (water or lava) flowing horizontally on a flat surface flows from the source in taxicab distance. For example, if flowing water is forced into a 1-block-wide stream and turns corners, it travels 7 blocks. If it is allowed to flow freely on a surface, it also travels 7 blocks taxicab distance.\nIn Bedrock Edition, simulation distance is the distance from the player at which blocks get tick updates (such as lightning strikes), and beyond which mobs despawn; this also uses taxicab distance.\nIn Bedrock Edition, a spawner spawns mobs within a 4-block taxicab horizontal range from the spawner.\nA sponge absorbs water up to 7 blocks away in taxicab distance (an octahedral volume centered on the sponge).\nPhantoms in Java Edition spawn 20–34 blocks above the player, and off to the side by a taxicab distance of up to 10 blocks.\nUsing bone meal on sea pickles that are on coral blocks creates more sea pickles on nearby coral blocks out to a horizontal taxicab distance of 2.\nA block of copper is oxidized according to a taxicab distance search for unwaxed copper blocks within 4 blocks of the block being considered for oxidation.\nShulkers can move along only one of the three grid axes at a time and on integer steps, meaning that they move according to taxicab geometry.\nSome redstone components produce block updates up to two blocks away by taxicab distance, including up and down.", "bbox": [238.046875, 1577.765625, 690, 588]}, {"text": "Horizontal spread of water.\nHorizontal spread of lava.\nTaxicab illumination from various light-emitting blocks.\nThe effect of simulation distance (the diamond area) on lightning strikes around a lightning rod.", "bbox": [238.046875, 2183.765625, 690, 234]}, {"text": "Horizontal spread of water.", "bbox": [240.046875, 2343.765625, 155, 18]}, {"text": "Horizontal spread of lava.", "bbox": [398.046875, 2343.765625, 155, 18]}, {"text": "Taxicab illumination from various light-emitting blocks.", "bbox": [556.046875, 2343.765625, 155, 54]}, {"text": "The effect of simulation distance (the diamond area) on lightning strikes around a lightning rod.", "bbox": [714.046875, 2343.765625, 155, 72]}, {"text": "Euclidean", "bbox": [202.046875, 2441.765625, 726, 22]}, {"text": "Situations in which Euclidean distance is used:", "bbox": [202.046875, 2476.265625, 726, 25]}, {"text": "Mob despawning range in Java Edition.\nDisks in rivers and lakes generate as blocks within a Euclidean distance from a central block.\nEffects of explosions.\nLightning rods redirect lightning within a Euclidean spherical volume centered on the rod, having a radius of 128 blocks in Java Edition and 64 blocks in Bedrock Edition.\nThe /locate command.\nNether portal searches for destination portals.\nSplash potions affect mobs inside a 4-block radius Euclidean sphere.\nTarget selectors used in commands use Euclidean distances.\nA zombie siege is started based on Euclidean distance between a player and the village center.\nFinally, a splash text displays the misspelled word \"Euclidian!\"", "bbox": [238.046875, 2524.765625, 690, 269]}]}