{"metadata": {"url": "https://minecraft.fandom.com/wiki/Featured_servers/Mineplex", "title": "Featured_servers/Mineplex", "time": "17/04/2022 00:57:40"}, "tables": [{"bbox": [624.9375, 837.15625, 300, 422], "headers": {"text": ["Server type", "Address", "Language(s)", "App", "Links"], "bboxes": [[625.9375, 838.15625, 87, 30], [625.9375, 869.1875, 87, 31], [625.9375, 901.21875, 87, 206], [625.9375, 1108.5, 87, 30], [625.9375, 1139.53125, 87, 118]]}, "cells": {"text": ["Minigames", "mco.mineplex.com", "English, Danish, German, French (Canada), French (France), Spanish (Spain), Spanish (United States), Norwegian, Dutch, Portuguese (Brazil), Italian, Swedish, Romanian, Chinese (China), Chinese (Taiwan), Russian, Finnish, Croatian, Polish, Japanese", "", "Website: https://mineplex.com Discord: https://discord.gg/Mineplex Twitter: https://twitter.com/Mineplex"], "bboxes": [[713.9375, 838.15625, 210, 30], [713.9375, 869.1875, 210, 31], [713.9375, 901.21875, 210, 206], [713.9375, 1108.5, 210, 30], [713.9375, 1139.53125, 210, 118]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/c/c5/Move_arrows.svg", "path": "images/Move arrows.png", "alt_text": "Move arrows", "caption": null, "bbox": [260.53125, 516.84375, 32, 32]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/c/c6/Mineplex.png", "path": "images/Mineplex.png", "alt_text": "Mineplex", "caption": null, "bbox": [699.9375, 683.15625, 150, 150]}], "sprites": [], "texts": [{"text": "Featured servers/Mineplex", "bbox": [202.046875, 349.5, 593, 45]}, {"text": "Mineplex is a featured server in the Bedrock Edition. It was introduced in the Better Together Update, It was one of the first servers to partner with Mojang Studios. Mineplex also has a server on Java Edition.", "bbox": [202.046875, 637.6875, 726, 98]}, {"text": "Contents", "bbox": [215.046875, 775.4375, 81, 17]}, {"text": "1 Games\n1.1 Block Hunt\n1.2 Cake Wars\n1.3 Master Builder\n1.4 Skywars\n1.5 Speed Builders\n1.6 Deathrun:\n1.7 TO BE ADDED *Description is from Mineplex", "bbox": [203.046875, 808.703125, 346, 246]}, {"text": "Games", "bbox": [202.046875, 1079.703125, 407, 43]}, {"text": "Block Hunt", "bbox": [202.046875, 1146.703125, 726, 22]}, {"text": "Join either the Hunters or the Hiders in this hide and seek based minigame! The Hunters will be forced to work together to find the Hiders hidden around the map as various blocks and animals! While they start off severely outnumbered, any Hider eliminated by a Hunter will be converted onto the Hunters' team! Finding as many hidden players as quickly as possible is key to winning for the Hunters. However, the Hiders aren't defenseless, they are armed with an axe and a bow, so hiders can launch their own counter-attack. While their weapons are weaker than those of the Hunters, the more damage they do with their bow, the stronger their axe will become! So hide or fight, the choice is yours!*", "bbox": [202.046875, 1181.203125, 726, 196]}, {"text": "Cake Wars", "bbox": [202.046875, 1401.203125, 726, 23]}, {"text": "Winner winner cake for dinner! Winner winner cake for dinner! Protect your cake at all costs and do not let the enemy team eat it. Buy better gear and weapons from capturing the points on the middle and side islands to help you gain more resources to defeat your enemy. Once your cake is eaten, you are no longer able to respawn after death and if you die again, you are out of the game. Be careful when eating an enemies' cake as there might be a trap that could kill you. Keep an eye out for the random cake islands that spawn in as they contain a chest that will give you extra bonuses to help you win the game. Knock your enemies into the void with your PVP skills and taunt them while they fall into the void.*", "bbox": [202.046875, 1435.703125, 726, 171]}, {"text": "Master Builder", "bbox": [202.046875, 1631.203125, 726, 23]}, {"text": "Channel your inner building skills and go crazy in this build off style minigame! You'll be given five minutes to build anything you feel fits within the given theme, so throw some blocks down quickly in an attempt to create your own masterpiece! At the end of the build timer, players will be able to vote on one another's builds and whoever accumulates the most points will be crowned the victor! For those whose builds don't get enough votes however, they'll be forced to watch their hard work explode!*", "bbox": [202.046875, 1665.703125, 726, 122]}, {"text": "Skywars", "bbox": [202.046875, 1812.203125, 726, 23]}, {"text": "Twelve islands high up in the sky and twelve players ready to battle it out. In this classic fast-paced Minecraft game, players spawn on small islands and have to navigate their way to a central island in the hope of finding powerful loot! Be careful though, as you'll have to build over the open sky, leaving yourself open to anyone looking to knock you off for an easier game! You'll have some additional tools at your disposal though depending on the kit you choose! Summon rings of fire, make bridges of ice, or throw blocks at unsuspecting foes! Do whatever it takes to be the last one in the sky.*", "bbox": [202.046875, 1846.703125, 726, 147]}, {"text": "Speed Builders", "bbox": [202.046875, 2017.703125, 726, 22]}, {"text": "Challenge yourself as you are forced to memorize a structure in a matter of mere seconds, and be the first to complete it! Whoever is furthest from completion by the time Gwen has started judging is eliminated!*", "bbox": [202.046875, 2052.203125, 726, 49]}, {"text": "Deathrun:", "bbox": [202.046875, 2125.203125, 726, 23]}, {"text": "TO BE ADDED *Description is from Mineplex", "bbox": [202.046875, 2171.703125, 726, 22]}]}