{"metadata": {"url": "https://minecraft.fandom.com/wiki/Lingering_Potion/ED", "title": "Lingering_Potion/ED", "time": "17/04/2022 03:50:03"}, "tables": [], "images": [], "sprites": [{"text": null, "bbox": [202.046875, 442, 16, 16]}, {"text": null, "bbox": [223.046875, 493, 16, 16]}, {"text": null, "bbox": [223.046875, 542, 16, 16]}, {"text": null, "bbox": [223.046875, 566.5, 16, 16]}, {"text": null, "bbox": [223.046875, 591, 16, 16]}, {"text": null, "bbox": [223.046875, 615.5, 16, 16]}, {"text": null, "bbox": [244.046875, 640, 16, 16]}, {"text": null, "bbox": [265.046875, 664.5, 16, 16]}, {"text": null, "bbox": [265.046875, 738, 16, 16]}, {"text": null, "bbox": [265.046875, 787, 16, 16]}, {"text": null, "bbox": [265.046875, 836, 16, 16]}, {"text": null, "bbox": [265.046875, 860.5, 16, 16]}, {"text": null, "bbox": [265.046875, 885, 16, 16]}, {"text": null, "bbox": [223.046875, 934, 16, 16]}, {"text": null, "bbox": [223.046875, 958.5, 16, 16]}, {"text": null, "bbox": [223.046875, 1007.5, 16, 16]}, {"text": null, "bbox": [223.046875, 1032, 16, 16]}, {"text": null, "bbox": [223.046875, 1056.5, 16, 16]}, {"text": null, "bbox": [223.046875, 1081, 16, 16]}, {"text": null, "bbox": [223.046875, 1105.5, 16, 16]}, {"text": null, "bbox": [223.046875, 1130, 16, 16]}], "texts": [{"text": "Lingering Potion/ED", "bbox": [202.046875, 349.5, 593, 45]}, {"text": "Entity data\nTags common to all entities[show]\n Age: Age of the field. Increases by 1 every tick. When this is bigger than Duration + WaitTime the area effect cloud dissipates.\n Color: The color of the displayed particle. Uses the same format as the color tag from Display Properties.\n Duration: The maximum age of the field after WaitTime.\n DurationOnUse: The amount the duration of the field changes upon applying the effect.\n Effects: A list of the applied effects.\nAn individual effect.\n Ambient: 1 or 0 (true/false) - whether or not this is an effect provided by a beacon and therefore should be less intrusive on the screen. Optional, and defaults to false. Due to a bug, it has no effect on splash potions.\n Amplifier: The amplifier of the effect, with level I having value 0. Negative levels are discussed here. Optional, and defaults to level I.\n Duration: The duration of the effect in ticks. Values 0 or lower are treated as 1. Optional, and defaults to 1 tick.\n Id: The numeric ID of the effect.\n ShowIcon: 1 or 0 (true/false) - true if effect icon is shown. false if no icon is shown.\n ShowParticles: 1 or 0 (true/false) - whether or not this effect produces particles. Optional, and defaults to true. Due to a bug, it has no effect on splash potions.\n Owner: The UUID of the entity who created the cloud, stored as four ints.\n Particle: The particle displayed by the field. This is the exact same as used in the /particle command, including additional parameters used for particles, for example dust 1 0 0 1.\n Potion: The name of the default potion effect. See potion data values for valid IDs.\n Radius: The field's radius.\n RadiusOnUse: The amount the radius changes upon applying the effect. Normally negative.\n RadiusPerTick: The amount the radius changes per tick. Normally negative.\n ReapplicationDelay: The number of ticks before reapplying the effect.\n WaitTime: The time before deploying the field. The Radius is ignored, meaning that any specified effects is not applied and specified particles appear only at the center of the field, until Age hits this number.", "bbox": [202.046875, 439, 726, 737]}]}