{"metadata": {"url": "https://minecraft.fandom.com/wiki/Tutorials/Conquering_a_mountain", "title": "Tutorials/Conquering_a_mountain", "time": "17/04/2022 01:58:13"}, "tables": [], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/6/6f/Jagged_Peaks_1.18.png", "path": "images/img.png", "alt_text": "", "caption": "Mountains are one of the most dangerous biomes in Minecraft", "bbox": [747.9375, 402.5, 180, 101]}], "sprites": [{"text": null, "bbox": [238.046875, 873.5, 16, 16]}, {"text": null, "bbox": [238.046875, 946.5, 16, 16]}, {"text": null, "bbox": [238.046875, 971, 16, 16]}, {"text": null, "bbox": [349.046875, 971, 16, 16]}, {"text": null, "bbox": [238.046875, 1044.5, 16, 16]}, {"text": null, "bbox": [238.046875, 1127.5, 16, 16]}, {"text": null, "bbox": [238.046875, 1152, 16, 16]}], "texts": [{"text": "Tutorials/Conquering a mountain", "bbox": [202.046875, 313, 593, 45]}, {"text": "Mountains are a type of terrain that appear in many different designs, but are typically described as very tall. They can be part of the badlands, possess a barren surface made of stone, or have snowy slopes. Conquering a mountain can be quite a challenge, especially for unprepared players, due to the several dangers, including deep patches of powder snow, the ramming goats, and of course, its steep and towering heights. However, not all mountains are generated equally as it can sometimes just be a big meadow hill or a short mountain peak, so it's best to find one with very tall terrain and a \"peak\" biome. There are many reasons for conquering a mountain. Perhaps you want to harvest its massive reserves of iron and coal ore, or build something cool on top, or maybe you simply want to do it for the fun or challenge.", "bbox": [202.046875, 402.5, 726, 245]}, {"text": "Equipment", "bbox": [202.046875, 671.5, 726, 43]}, {"text": "Necessary Equipment", "bbox": [202.046875, 738.5, 726, 23]}, {"text": "Any common block or ladders, to tower up on cliffs too steep to climb easily.\nScaffolding and twisting vines are good alternatives to ladders, though stumbling upon a jungle or warped forest for appropriate supplies may take a while.\nLeather boots, to prevent falling inside powder snow.\nEnchanting your boots with Feather Falling may help mitigate harm from potentially frequent falling.\nA water bucket in case of any danger; necessary for all missions regardless of difficulty!\nA sword, or an axe most preferably Iron at minimum, to quickly kill as much danger (e.g. Goats and pillagers) as possible. (An axe is stronger and can chop trees, especially if you can't see through the Grove forest or don't have any wood)\nPlenty of nutritious food, such as steak and bread, to regenerate health.", "bbox": [238.046875, 773, 690, 293]}, {"text": "Optional Equipment", "bbox": [202.046875, 1090, 726, 22]}, {"text": "Any banner of your choice to place on top of the summit of a mountain.\nAn Elytra to conquer mountains much more easily. (This is not recommended if you prefer to climb mountains normally or if you think this is cheating)", "bbox": [238.046875, 1124.5, 690, 74]}]}