{"metadata": {"url": "https://minecraft.fandom.com/wiki/Farming", "title": "Farming", "time": "16/04/2022 23:29:41"}, "tables": [], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/4/49/Small_farm.png", "path": "images/img.png", "alt_text": "", "caption": "A small carrot and potato farm.", "bbox": [577.9375, 474.890625, 350, 197]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/0/00/DAB_list.svg", "path": "images/DAB list.png", "alt_text": "DAB list", "caption": null, "bbox": [216.046875, 5731.265625, 20, 15]}], "sprites": [{"text": "Animal farming", "bbox": [202.046875, 1790.40625, 16, 16]}, {"text": "Bee Farming", "bbox": [202.046875, 1863.90625, 16, 16]}, {"text": "Hostile mob farming", "bbox": [202.046875, 1912.90625, 16, 16]}, {"text": "Villager farming", "bbox": [202.046875, 1961.90625, 16, 16]}, {"text": "Guardian farming", "bbox": [202.046875, 2035.40625, 16, 16]}, {"text": "Blaze farming", "bbox": [202.046875, 2084.40625, 16, 16]}, {"text": "Pillager farming", "bbox": [202.046875, 2133.40625, 16, 16]}, {"text": "Drowned farming", "bbox": [202.046875, 2182.40625, 16, 16]}, {"text": "Slime farming", "bbox": [202.046875, 2231.40625, 16, 16]}, {"text": "Spawner farming", "bbox": [202.046875, 2479.40625, 16, 16]}, {"text": "Furnace farming", "bbox": [202.046875, 2960.90625, 16, 16]}, {"text": "Fishing", "bbox": [202.046875, 3704.40625, 16, 16]}, {"text": "Trading for Bottles o'Enchanting", "bbox": [202.046875, 3899.40625, 16, 16]}, {"text": null, "bbox": [202.046875, 4097.90625, 16, 16]}, {"text": null, "bbox": [272.046875, 4097.90625, 16, 16]}, {"text": null, "bbox": [344.046875, 4097.90625, 16, 16]}, {"text": null, "bbox": [420.046875, 4097.90625, 16, 16]}, {"text": null, "bbox": [597.046875, 4097.90625, 16, 16]}, {"text": null, "bbox": [202.046875, 4146.90625, 16, 16]}, {"text": null, "bbox": [315.046875, 4146.90625, 16, 16]}, {"text": "Vine farming", "bbox": [202.046875, 4195.90625, 16, 16]}, {"text": "Kelp farming", "bbox": [202.046875, 4342.90625, 16, 16]}, {"text": "Bamboo farming", "bbox": [202.046875, 4391.90625, 16, 16]}, {"text": "Sugar Cane farming", "bbox": [202.046875, 4440.90625, 16, 16]}, {"text": "Chorus Fruit farming", "bbox": [202.046875, 4489.90625, 16, 16]}, {"text": "Mushroom farming", "bbox": [202.046875, 4538.90625, 16, 16]}, {"text": "Nether Wart farming", "bbox": [202.046875, 4612.40625, 16, 16]}, {"text": "Cactus farming", "bbox": [202.046875, 4731.40625, 16, 16]}, {"text": "Cobblestone farming", "bbox": [202.046875, 4780.40625, 16, 16]}, {"text": "Obsidian farming", "bbox": [202.046875, 4829.40625, 16, 16]}, {"text": "Ice farming", "bbox": [202.046875, 4878.40625, 16, 16]}, {"text": "Tree farming", "bbox": [202.046875, 4927.40625, 16, 16]}, {"text": "Wool farming", "bbox": [202.046875, 4976.40625, 16, 16]}, {"text": "Mycelium", "bbox": [238.046875, 5073.90625, 16, 16]}, {"text": "Grass Block", "bbox": [349.40625, 5073.90625, 16, 16]}, {"text": null, "bbox": [238.046875, 5122.90625, 16, 16]}, {"text": null, "bbox": [238.046875, 5171.90625, 16, 16]}, {"text": "Bone Meal farming", "bbox": [202.046875, 5290.90625, 16, 16]}, {"text": "Iron farming", "bbox": [202.046875, 5339.90625, 16, 16]}, {"text": "Gold farming", "bbox": [202.046875, 5388.90625, 16, 16]}, {"text": "Egg farming", "bbox": [202.046875, 5462.40625, 16, 16]}, {"text": "Cocoa bean farming", "bbox": [202.046875, 5511.40625, 16, 16]}, {"text": "Snow farming", "bbox": [202.046875, 5560.40625, 16, 16]}, {"text": "Fish farming", "bbox": [202.046875, 5609.40625, 16, 16]}, {"text": "Honey farming", "bbox": [202.046875, 5658.40625, 16, 16]}], "texts": [{"text": "Farming", "bbox": [202.046875, 353.890625, 593, 45]}, {"text": "This article is about the practice. For the block on which crops grow, see Farmland. For the village feature, see Farm.", "bbox": [216.046875, 418.890625, 712, 49]}, {"text": "Farming refers to the systematic production of renewable resources. The technique is typically used to get blocks, food, experience and other desired items. Specific types of farming are listed below.", "bbox": [202.046875, 474.890625, 726, 98]}, {"text": "Contents", "bbox": [215.046875, 612.640625, 81, 17]}, {"text": "1 Automation\n2 Mob farming\n3 Experience farming\n4 Food and other crops\n5 Block farming\n6 Item farming", "bbox": [203.046875, 645.90625, 188, 189]}, {"text": "Automation", "bbox": [202.046875, 859.90625, 726, 43]}, {"text": "Farms can be classified as manual, semi-automatic, and fully automatic. Manual farms rely mostly or solely on the player to harvest and restart the farm. Semi-automatic farms use mechanisms to automatically harvest the farm, but they are manually activated by the player. Fully automatic farms do not rely on the player at all and usually use mobs or more complicated mechanisms.", "bbox": [202.046875, 911.90625, 726, 98]}, {"text": "There are other limits to farming regardless of automation:", "bbox": [202.046875, 1033.90625, 726, 25]}, {"text": "Many farms require their chunks to be ticked;. In Bedrock Edition, all loaded chunks in the world are ticked, but in Java Edition, a chunk must also have a player nearby – specifically, some player must be within 128 blocks (horizontal distance only) of the chunk's center. This affects most block changes, including farmland and other crop farms.", "bbox": [202.046875, 1082.40625, 726, 98]}, {"text": "Mobs will generally despawn if they do not have a player nearby; details vary by version, but in general mobs can randomly despawn if no player has been within 32 blocks for at least 30 seconds (sometimes 10 seconds), or if no player is within 128 blocks. In either case, the chunk needs to still be loaded for the despawning process to work. This affects most mob farms, especially those which depend on hostile mobs.", "bbox": [202.046875, 1204.40625, 726, 98]}, {"text": "Many mobs are protected from despawning; by way of summary:", "bbox": [202.046875, 1326.40625, 726, 24]}, {"text": "Any mob that was created as part of a naturally-generated structure.\nAny mob which is carrying an object (or, for enderman, a block) that it wasn't created with.\nAny mob which has interacted with a player: Lured and/or bred with food by a player, tamed by a player, or created by player breeding. This is inherited if they get converted to another mob, thus Zombie villagers are protected if they were created from a villager which had been traded with.\nAny mob which is riding something else -- another mob, a boat, or a minecart.\nAny mob which has been named with a name tag, or has the NBT tag {PersistenceRequired: 1b} .\nVillagers, iron golems and snow golems never despawn. Neither does any boss or miniboss (e.g., elder guardians)\nIn Java Edition, most passive mobs (the classic farm animals) never despawn (exceptions include untamed wolves, cats, etc).", "bbox": [238.046875, 1374.90625, 690, 270]}, {"text": "Within survival mode, this allows using properly-prepared hostile mobs as part of a farm, e.g., a nametagged zombie in an iron farm.", "bbox": [202.046875, 1662.40625, 726, 49]}, {"text": "Mob farming", "bbox": [202.046875, 1735.40625, 726, 43]}, {"text": "Animal farming\nUsing wheat, seeds, beetroot, and carrots to breed animals, to be slaughtered for their products or used in egg, milk, or wool farming.\nBee Farming\nUsing flowers to breed bees to store in beehives and bee nests, and make Honeycomb and/or Honey.\nHostile mob farming\nCreating spawn rooms for hostile mobs to be killed for their drops.\nVillager farming\nFarming villagers requires the player to have enough beds and job site blocks for each villager for them to breed.\nGuardian farming\nFarming guardians by funneling them to a concentrated area for materials and/or experience.\nBlaze farming\nFarming blaze rods from blazes.\nPillager farming\nFarming crossbows, emeralds, iron tools‌[Bedrock Edition only] and ominous banners from pillagers.\nDrowned farming\nFarming tridents, nautilus shells, rotten flesh and copper ingots from drowned.\nSlime farming\nFarming slime balls from slimes.", "bbox": [202.046875, 1787.40625, 726, 490]}, {"text": "Experience farming", "bbox": [202.046875, 2295.40625, 726, 43]}, {"text": "Main article: Tutorials/Experience_farming", "bbox": [216.046875, 2347.40625, 712, 24]}, {"text": "The reason to farm experience is to easily enchant items, or repair tools and armor. Many common experience farms require a difficulty above Peaceful, as they require mobs to spawn. Other uncommon farms use other ways to gain experience, such as fishing or furnaces.", "bbox": [202.046875, 2378.90625, 726, 74]}, {"text": "Spawner farming", "bbox": [202.046875, 2476.40625, 726, 24]}, {"text": "Spawner farming involves waiting at an active monster spawner for monsters to spawn. This includes mobs that do not spawn naturally without the use of spawners, such as cave spiders.", "bbox": [202.046875, 2500.90625, 726, 49]}, {"text": "These can be automated with a water pathway transferring the mobs to a convenient collection or killing area.", "bbox": [202.046875, 2573.90625, 726, 25]}, {"text": "A similar system can be used to adapt \"dark-spawn farms\" to experience harvesting: Mobs are funneled into a grinder to soften them up, then a killing chamber where you can take a sword to them without being targeted. There are several considerations here, the hard part is doing them all at once:", "bbox": [202.046875, 2622.40625, 726, 73]}, {"text": "As usual, spiders generally need to be separated or killed off to avoid them blocking other mobs.\nThe killing chamber must not allow various monsters to aggro:\nCreepers can't see you up close, lest they ignite.\nThe system must not allow baby zombies to escape and run wild. Remember that they can go through a 1-block hole.\nSkeletons can't be able to shoot at you.\nNaturally, the works need to be enderman-proof, and the areas where you wait should have low ceilings to protect you from any who do show up.", "bbox": [238.046875, 2719.90625, 690, 220]}, {"text": "Furnace farming", "bbox": [202.046875, 2957.90625, 726, 25]}, {"text": "Even in peaceful mode, certain crops can be auto-farmed and directed into an automated furnace or smoker. The experience from the smelting is accumulated until the furnace is manually emptied or broken.", "bbox": [202.046875, 2982.40625, 726, 49]}, {"text": "Given automatic farms for smelting stock, fuel, and disposal, the only real limit is how much time a player is willing to let a furnace collect experience between harvests. A full chest of items contains 1,728 items, which requires 144 minutes (2 hours 24 minutes, over 6 game days) in a smoker, double that in a plain furnace.", "bbox": [202.046875, 3055.40625, 726, 73]}, {"text": "Cactus provides the most experience (1/item), but a regular furnace must be used.\nEach furnace accumulates 6 experience per minute. A chestful provides enough experience to go from none to level 32.\nPotatoes (or chicken) provide about a third of that (0.35/item), but a fully-automated farm may be difficult.\nA smoker accumulates 4.2 experience per minute. A chestful provides enough experience to go from none to level 20.\nKelp provides the least experience (0.1/item), but can be cooked in a smoker for 1.2 experience/minute. A chestful provides enough experience to go from nothing to level 10.", "bbox": [238.046875, 3152.90625, 690, 244]}, {"text": "Fuel is difficult to supply automatically, but a bamboo farm may be able to keep up. Alternatively, a fuel chest can be loaded with dried-kelp blocks. A chest full of 1,728 items can be smelted by 18 lava buckets, 22 blocks (or 216 pieces) of coal, 288 logs crafted to planks, 87 dried kelp blocks... or four chests full of bamboo.", "bbox": [202.046875, 3414.90625, 726, 74]}, {"text": "The smelted result can be collected for use, or discarded.", "bbox": [202.046875, 3512.40625, 726, 24]}, {"text": "Cooked potatoes or chicken yield more food value, or compost, than raw.\nCooked kelp can be composted, or crafted into blocks for fuel.\nGreen dye (from cactus) has no use beyond making things green, so it may be necessary to automatically discard it. A clock-driven dropper can be used to throw the dye pieces onto a handy block of cactus, which destroys them.", "bbox": [238.046875, 3560.90625, 690, 123]}, {"text": "Fishing", "bbox": [202.046875, 3701.40625, 726, 24]}, {"text": "Fishing provides a steady stream of experience, food, and treasure. Catches include enchanted rods, bows, and books, which can be used directly, combined in an anvil, or converted to experience in a grindstone.", "bbox": [202.046875, 3725.90625, 726, 49]}, {"text": "Fishing initially yields an average of 12 experience points per minute, which Lure III can increase to 28 points/minute. The rain bonus increases that to over 33 points/minute. At 28 points/minute, fishing for a Minecraft day (20 minutes) yields 560 experience, enough to raise a player from nothing to level 20.", "bbox": [202.046875, 3798.90625, 726, 74]}, {"text": "Trading for Bottles o'Enchanting", "bbox": [202.046875, 3896.40625, 726, 24]}, {"text": "Cleric Villagers can sell you Bottles o'Enchanting, providing a source of experience which can be stored and used at your leisure. They are expensive (3 emeralds apiece), but various crop farms (see below) can let you earn vast amounts of emeralds. Buying the bottles also grants the usual experience for trading. Each stack of 64 bottles offers an average of 448 experience, enough to elevate to level 18 from zero.", "bbox": [202.046875, 3920.90625, 726, 98]}, {"text": "Food and other crops", "bbox": [202.046875, 4042.90625, 726, 43]}, {"text": "Wheat, Carrot, Potato, Beetroot farming, and Sweet Berries\nFarming wheat, carrots, potatoes, beetroots, and Sweet Berries\nPumpkin and Melon farming\nFarming pumpkins and melons\nVine farming\nVines can be farmed for use instead of ladders, decoration, or crafting mossy stone bricks or mossy cobblestone. The Nether also offers weeping vines and twisting vines. In all cases they are initially planted on a block (green vines on the side of the block, weeping vines on the bottom, twisting vines on the top), after which they can be allowed to grow naturally or force-grown with bonemeal. All are harvested with shears, though the Nether vines can be harvested at a 1/3 drop rate without tools.\nKelp farming\nFarming kelp for fuel or decoration.\nBamboo farming\nFarming bamboo for fuel, sticks or scaffolds.\nSugar Cane farming\nFarming sugar canes to make paper and sugar.\nChorus Fruit farming\nFarming chorus fruit for food and popped chorus fruit, which makes purpur blocks and end rods.\nMushroom farming\nFarming mushrooms for use in mushroom stew or creating huge mushrooms. They can be farmed in darkness, in the Nether, or (in any light) on mycelium or podzol blocks.\nNether Wart farming\nFarming nether wart for use in brewing.", "bbox": [202.046875, 4094.90625, 726, 564]}, {"text": "Block farming", "bbox": [202.046875, 4676.40625, 726, 43]}, {"text": "Cactus farming\nFarming cacti for green dye or traps.\nCobblestone farming\nCreating a stone or cobblestone generator for self-repairing shelters or harvesting.\nObsidian farming\nCreating an obsidian generator for obsidian-intensive builds.\nIce farming\nFarming ice using a self-refilling rink.\nTree farming\nFarming trees for wood, saplings, apples, or charcoal.\nWool farming\nFarming wool for many different uses", "bbox": [202.046875, 4728.40625, 726, 294]}, {"text": "Several other blocks can be produced in place and then harvested:", "bbox": [202.046875, 5022.40625, 726, 24]}, {"text": "Mycelium and Grass Block: Mycelium, like grass, can be allowed to spread through plain dirt, then harvested with any Silk Touch tool.\nPodzol does not naturally spread through dirt, but growing a giant spruce tree converts all dirt nearby to podzol, which can be harvested with Silk Touch.\n: Either form of nylium does not naturally spread, but can be made to spread through netherrack by use of bone meal. It can be used for decoration, or for growing Fungus and other Nether plants.", "bbox": [238.046875, 5070.90625, 690, 147]}, {"text": "Item farming", "bbox": [202.046875, 5235.90625, 726, 43]}, {"text": "Bone Meal farming\nFarming bone meal.\nIron farming\nFarming iron ingots by killing iron golems spawned in large villages.\nGold farming\nFarming gold nuggets by killing zombified piglins, which spawn in the Nether or near Nether portals in the Overworld.\nEgg farming\nFarming eggs for use in cake, pumpkin pie or creating chickens.\nCocoa bean farming\nFarming cocoa beans for use in cookies or creating brown wool.\nSnow farming\nTrapping a snow golem and digging the snow it produces.\nFish farming\nFarming fish, experience and other items by fishing with the use of a fishing rod.\nHoney farming\nFarming honey bottles and honeycombs from bee nests.", "bbox": [202.046875, 5287.90625, 726, 417]}]}