{"metadata": {"url": "https://minecraft.fandom.com/wiki/Programs_and_editors/Tectonicus/Custom_Blocks", "title": "Programs_and_editors/Tectonicus/Custom_Blocks", "time": "17/04/2022 05:31:10"}, "tables": [], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/f2/Paper_JE2_BE2.png", "path": "images/Paper JE2 BE2.png", "alt_text": "Paper JE2 BE2", "caption": null, "bbox": [260.53125, 509.59375, 32, 32]}], "sprites": [], "texts": [{"text": "Programs and editors/Tectonicus/Custom Blocks", "bbox": [202.046875, 358.5, 593, 90]}, {"text": "By default Tectonicus will render all the standard Minecraft blocks, but if you're using mods that add new block types then those blocks will be skipped. By making a custom block config you can add in custom block types to Tectonicus so that maps made with your favorite mods will show correctly.", "bbox": [202.046875, 569.1875, 726, 74]}, {"text": "Internally all blocks in Minecraft have a unique number, or id. You can see all of these here: Block IDs. Mods will add blocks by using block ids currently not in use - if you're a mod author then you can make a block config for others to use, or you can ask the mod author to document the new blocks and their ids.", "bbox": [202.046875, 666.6875, 726, 73]}, {"text": "Contents", "bbox": [215.046875, 779.9375, 81, 17]}, {"text": "1 Tutorial: Adding a simple custom block\n2 Replacing Existing Blocks\n3 Removing Existing Blocks\n4 Using Images From A Texture Pack\n5 Different Kinds Of Block\n6 Sub Blocks (for mods)\n7 Available Block Types\n7.1 Air\n7.2 Solid blocks\n7.3 Water\n7.4 Log", "bbox": [203.046875, 813.203125, 290, 332]}, {"text": "Tutorial: Adding a simple custom block", "bbox": [202.046875, 1169.703125, 726, 43]}, {"text": "First, you need to create a custom block file. An empty file looks like this:", "bbox": [202.046875, 1221.703125, 726, 24]}, {"text": "Since this is xml, the extension is usually .xml, but this is not required. We'll save this to C:/customBlockConfig.xml.", "bbox": [202.046875, 1324.203125, 726, 25]}, {"text": "Say you've got a mod that adds a 'cheese' block, made entirely out of hard cheese. It's a solid block (like dirt or stone) but has a yellow image on all sides. You'd add your cheese block so your config looks like this:", "bbox": [202.046875, 1372.703125, 726, 49]}, {"text": "There are a few important things to notice:", "bbox": [202.046875, 1555.703125, 726, 24]}, {"text": "The 'Solid' tag means that this block is completely solid, like dirt.\nThe 'id' is the id of the block.\nThe 'name' is the name given to the block\nThe 'texture' is the image file to use. Png, gif or jpeg are supported.", "bbox": [238.046875, 1604.203125, 690, 98]}, {"text": "Then you need to include your custom config when drawing your map. Find your config file, and add the config to the 'layer' tags as shown (the last two attributes are the new ones):", "bbox": [202.046875, 1720.203125, 726, 49]}, {"text": "Render your map, and the new block should appear!", "bbox": [202.046875, 1861.203125, 726, 25]}, {"text": "Replacing Existing Blocks", "bbox": [202.046875, 1909.703125, 726, 43]}, {"text": "If you want to change how a regular Minecraft block looks, then you can just redefine it in your custom block. For example, if we changed the id above from 200 to 12 (the block id of sand) then all of your sand would appear as cheese.", "bbox": [202.046875, 1961.703125, 726, 73]}, {"text": "Removing Existing Blocks", "bbox": [202.046875, 2059.203125, 726, 43]}, {"text": "If you *only* want custom blocks then you can set 'useDefaultBlocks' to 'false'. This means that you don't get all of the regular Minecraft blocks. You could then use this to make a config containing *only* ores (coal, iron, gold, diamonds) to get a map of where they are under ground. This config would look like this:", "bbox": [202.046875, 2111.203125, 726, 74]}, {"text": "The interesting thing to note here is the texture=\"terrain[0, 2]\" bit. Minecraft block images are stored in a single big image called terrain.png (see Texture pack). Here terrain[0, 2] means use the block image from terrain.png in the first column and third row (the place where gold ore is).", "bbox": [202.046875, 2318.703125, 726, 73]}, {"text": "Any image may be used with [] to select a tile from it, as long as the image has the same grid size as terrain.png (i.e. 16x16). E.g.", "bbox": [202.046875, 2416.203125, 726, 49]}, {"text": "Using Images From A Texture Pack", "bbox": [202.046875, 2575.203125, 726, 43]}, {"text": "As well as using images directly from your hard drive, you can use images from either Minecraft or your texture pack.", "bbox": [202.046875, 2627.203125, 726, 49]}, {"text": "As with regular textures, first the texture pack is checked and if the file does not exist there then the regular minecraft jar is checked.", "bbox": [202.046875, 2782.203125, 726, 49]}, {"text": "Different Kinds Of Block", "bbox": [202.046875, 2855.203125, 726, 43]}, {"text": "So far we have only used 'Solid' blocks, like stone and dirt. You can also add differently shaped blocks if a similar one already exists in Minecraft. For example, a custom plant:", "bbox": [202.046875, 2907.203125, 726, 49]}, {"text": "Here the 'Plant' used instead of 'Solid' means instead of a solid block Tectonicus will draw a X with the image, like regular minecraft plants.", "bbox": [202.046875, 3048.203125, 726, 49]}, {"text": "For examples of all the different kinds of block you can add, please see the default block config used by Tectonicus itself: http://www.triangularpixels.com/Tectonicus/defaultBlockConfig.xml", "bbox": [202.046875, 3121.203125, 726, 49]}, {"text": "Sub Blocks (for mods)", "bbox": [202.046875, 3194.203125, 726, 43]}, {"text": "As well as a block id all blocks have a data value. For simple blocks (like cobblestone) this is ignored. For others (like beds) it stores the direction or other extra data.", "bbox": [202.046875, 3246.203125, 726, 49]}, {"text": "Some blocks (particularly blocks added by mods) use the data like a secondary id. This can be used in the 'id' field.", "bbox": [202.046875, 3319.203125, 726, 25]}, {"text": "Here's an example for the wool blocks in regular minecraft:", "bbox": [202.046875, 3367.703125, 726, 24]}, {"text": "These all have a block id of 35, but use the data to decide which color texture to use. Red wool for example has a data value of 14, so the id actually becomes id=\"35:14\".", "bbox": [202.046875, 3666.203125, 726, 49]}, {"text": "Note that they don't all have to be 'Solid' type blocks. You could mix any block type as you need. This is particularly handy for mods with custom blocks.", "bbox": [202.046875, 3739.203125, 726, 49]}, {"text": "Available Block Types", "bbox": [202.046875, 3812.203125, 726, 43]}, {"text": "Air", "bbox": [202.046875, 3879.203125, 726, 23]}, {"text": "Air blocks are empty space. Use them if you want to disable a regular minecraft block.", "bbox": [202.046875, 3913.703125, 726, 24]}, {"text": "Solid blocks", "bbox": [202.046875, 4026.203125, 726, 23]}, {"text": "Creates a square cube like dirt or stone. May have the same image on all sides, or a different image on the top.", "bbox": [202.046875, 4060.703125, 726, 24]}, {"text": "Optionally may be drawn with 'alphaTest'. This doesn't draw transparent pixels (like glass or mob spawners)", "bbox": [202.046875, 4109.203125, 726, 25]}, {"text": "Water", "bbox": [202.046875, 4319.703125, 726, 22]}, {"text": "A solid block with transparent sides and special handling to make deeper water darker.", "bbox": [202.046875, 4354.203125, 726, 25]}, {"text": "Log", "bbox": [202.046875, 4466.703125, 726, 22]}, {"text": "A solid block with different side and top textures. Texture changes based on the block's data value.", "bbox": [202.046875, 4501.203125, 726, 25]}]}