{"metadata": {"url": "https://minecraft.fandom.com/wiki/Villager/ED", "title": "Villager/ED", "time": "17/04/2022 04:30:24"}, "tables": [], "images": [], "sprites": [{"text": null, "bbox": [202.046875, 446.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 576.6875, 16, 16]}, {"text": null, "bbox": [244.046875, 674.6875, 16, 16]}, {"text": null, "bbox": [223.046875, 725.6875, 16, 16]}, {"text": null, "bbox": [223.046875, 750.1875, 16, 16]}, {"text": null, "bbox": [223.046875, 774.6875, 16, 16]}, {"text": null, "bbox": [223.046875, 848.1875, 16, 16]}], "texts": [{"text": "Villager/ED", "bbox": [202.046875, 349.5, 593, 45]}, {"text": "Entity data\nAdditional fields for mobs that can breed[show]\nTags common to all entities[show]\nTags common to all mobs[show]\nTags common to all villagers[show]\n Inventory: Each compound tag in this list is an item in the villager's inventory, up to a maximum of 8 slots. Items in two or more slots that can be stacked together are automatically be condensed into one slot. If there are more than 8 slots, the last slot is removed until the total is 8. If there are 9 slots but two previous slots can be condensed, the last slot returns after the two other slots are combined.\nAn item in the inventory, excluding the Slot tag.\nTags common to all items[show]\n LastRestock: The last tick the villager went to their job site block to resupply their trades.\n LastGossipDecay: The last tick all gossip of the villager has decreased strength naturally.\n RestocksToday: The number of restocks a villager has done in 10 minutes from the last restock, or 0 if the villager has not restocked in the last 10 minutes. When a villager has restocked twice in less than 10 minutes, it waits at least 10 minutes for another restock.\n Willing: 1 or 0 (true/false) – true if the villager is willing to mate. Becomes true after certain trades (those that would cause offers to be refreshed), and false after mating.", "bbox": [202.046875, 443.1875, 726, 451]}, {"text": "Villager type[show][edit]", "bbox": [210.046875, 913.1875, 710, 20]}, {"text": "Villager profession[show][edit]", "bbox": [210.046875, 969.1875, 710, 20]}]}