{"metadata": {"url": "https://minecraft.fandom.com/wiki/Xbox_360_Edition_TU32", "title": "Xbox_360_Edition_TU32", "time": "17/04/2022 00:44:44"}, "tables": [{"bbox": [624.9375, 621.96875, 300, 267], "headers": {"text": ["Edition", "Internal version", "Release date", "Downloads"], "bboxes": [[625.9375, 622.96875, 135, 30], [625.9375, 654, 135, 140], [625.9375, 795.1875, 135, 30], [625.9375, 826.21875, 135, 30]]}, "cells": {"text": ["Xbox 360 Edition", "Original\nBuild 1.8.0845.0_DLC\nInstaller v0.0.37.1\nReupload\nBuild 1.8.0849.0_DLC\nInstaller v0.0.38.1", "February 12, 2016", "Download", "◄ TU31 TU33 ►"], "bboxes": [[761.484375, 622.96875, 162, 30], [761.484375, 654, 162, 140], [761.484375, 795.1875, 162, 30], [761.484375, 826.21875, 162, 30], [625.9375, 857.25, 298, 30]]}}, {"bbox": [202.046875, 3343.515625, 726, 327], "headers": {"text": ["[hide]\nMinecraft: Xbox 360 Edition versions", "[hide]\nXbox 360 Edition", "Pre-TU0", "TUx", "TU1x", "TU2x", "TU3x", "TU4x", "TU5x", "TU6x", "TU7x", "🎮 Legacy Console Edition version history"], "bboxes": [[205.046875, 3346.515625, 720, 27], [205.046875, 3375.46875, 720, 27], [205.046875, 3404.421875, 79, 25], [205.046875, 3430.921875, 79, 25], [205.046875, 3457.421875, 79, 25], [205.046875, 3483.921875, 79, 25], [205.046875, 3510.421875, 79, 25], [205.046875, 3536.921875, 79, 25], [205.046875, 3563.421875, 79, 25], [205.046875, 3589.921875, 79, 25], [205.046875, 3616.421875, 79, 25], [205.046875, 3642.921875, 720, 25]]}, "cells": {"text": ["[hide]\nXbox 360 Edition\nPre-TU0 Build 0016 Build 0033 Build 0035 GDC build Build 0054\nTUx TU0 TU1 TU2 TU3 TU4 TU5 TU6 TU7 TU8 TU9\nTU1x TU10 TU11 TU12 TU13 TU14 TU15 TU16 TU17 TU18 TU19\nTU2x TU20 TU21 TU22 TU23 TU24 TU25 TU26 TU27 TU28 TU29\nTU3x TU30 TU31 TU32 TU33 TU34 TU35 TU36 TU37 TU38 TU39\nTU4x TU41 TU42 TU43 TU44 TU45 TU46 TU47 TU48 TU49\nTU5x TU50 TU51 TU52 TU53 TU54 TU55 TU56 TU57 TU58 TU59\nTU6x TU60 TU61 TU62 TU63 TU64 TU65 TU66 TU67 TU68 TU69\nTU7x TU70 TU71 TU72 TU73 TU74 TU75", "Build 0016 Build 0033 Build 0035 GDC build Build 0054", "TU0 TU1 TU2 TU3 TU4 TU5 TU6 TU7 TU8 TU9", "TU10 TU11 TU12 TU13 TU14 TU15 TU16 TU17 TU18 TU19", "TU20 TU21 TU22 TU23 TU24 TU25 TU26 TU27 TU28 TU29", "TU30 TU31 TU32 TU33 TU34 TU35 TU36 TU37 TU38 TU39", "TU41 TU42 TU43 TU44 TU45 TU46 TU47 TU48 TU49", "TU50 TU51 TU52 TU53 TU54 TU55 TU56 TU57 TU58 TU59", "TU60 TU61 TU62 TU63 TU64 TU65 TU66 TU67 TU68 TU69", "TU70 TU71 TU72 TU73 TU74 TU75"], "bboxes": [[205.046875, 3375.46875, 720, 265], [286.046875, 3404.421875, 639, 25], [286.046875, 3430.921875, 639, 25], [286.046875, 3457.421875, 639, 25], [286.046875, 3483.921875, 639, 25], [286.046875, 3510.421875, 639, 25], [286.046875, 3536.921875, 639, 25], [286.046875, 3563.421875, 639, 25], [286.046875, 3589.921875, 639, 25], [286.046875, 3616.421875, 639, 25]]}}, {"bbox": [203.046875, 3373.46875, 724, 269], "headers": {"text": ["[hide]\nXbox 360 Edition", "Pre-TU0", "TUx", "TU1x", "TU2x", "TU3x", "TU4x", "TU5x", "TU6x", "TU7x"], "bboxes": [[205.046875, 3375.46875, 720, 27], [205.046875, 3404.421875, 79, 25], [205.046875, 3430.921875, 79, 25], [205.046875, 3457.421875, 79, 25], [205.046875, 3483.921875, 79, 25], [205.046875, 3510.421875, 79, 25], [205.046875, 3536.921875, 79, 25], [205.046875, 3563.421875, 79, 25], [205.046875, 3589.921875, 79, 25], [205.046875, 3616.421875, 79, 25]]}, "cells": {"text": ["Build 0016 Build 0033 Build 0035 GDC build Build 0054", "TU0 TU1 TU2 TU3 TU4 TU5 TU6 TU7 TU8 TU9", "TU10 TU11 TU12 TU13 TU14 TU15 TU16 TU17 TU18 TU19", "TU20 TU21 TU22 TU23 TU24 TU25 TU26 TU27 TU28 TU29", "TU30 TU31 TU32 TU33 TU34 TU35 TU36 TU37 TU38 TU39", "TU41 TU42 TU43 TU44 TU45 TU46 TU47 TU48 TU49", "TU50 TU51 TU52 TU53 TU54 TU55 TU56 TU57 TU58 TU59", "TU60 TU61 TU62 TU63 TU64 TU65 TU66 TU67 TU68 TU69", "TU70 TU71 TU72 TU73 TU74 TU75"], "bboxes": [[286.046875, 3404.421875, 639, 25], [286.046875, 3430.921875, 639, 25], [286.046875, 3457.421875, 639, 25], [286.046875, 3483.921875, 639, 25], [286.046875, 3510.421875, 639, 25], [286.046875, 3536.921875, 639, 25], [286.046875, 3563.421875, 639, 25], [286.046875, 3589.921875, 639, 25], [286.046875, 3616.421875, 639, 25]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/c/c2/Xbox_360_Edition_TU32.png", "path": "images/Xbox 360 Edition TU32.png", "alt_text": "Xbox 360 Edition TU32", "caption": null, "bbox": [634.9375, 459.96875, 280, 158]}, {"src": "https://static.wikia.nocookie.net/ucp-internal-test-starter-commons/images/a/a4/Xbox_360.svg", "path": "images/Xbox 360.png", "alt_text": "Xbox 360", "caption": null, "bbox": [462.390625, 3381.46875, 16, 16]}], "sprites": [], "texts": [{"text": "Xbox 360 Edition TU32", "bbox": [202.046875, 349.5, 593, 45]}, {"text": "TU32 was a version of Xbox 360 Edition released on February 12, 2016.[1] This version is based on Java Edition 1.8. This version was reuploaded before it was sent out to users.[2]", "bbox": [202.046875, 414.5, 726, 74]}, {"text": "[edit]", "bbox": [202.046875, 512, 726, 24]}, {"text": "Contents", "bbox": [215.046875, 624.75, 81, 17]}, {"text": "1 Fixes\n2 See also\n3 References", "bbox": [203.046875, 658.015625, 145, 104]}, {"text": "Fixes", "bbox": [202.046875, 786.515625, 407, 43]}, {"text": "113 issues fixed", "bbox": [202.046875, 838.515625, 726, 25]}, {"text": "MCCE-48 – Water Spreading Creates New Source Blocks.\nMCCE-571 – Interface Opacity and Tooltip Opacity issues on PS Vita.\nMCCE-772 – Animals get stuck in corners of fence-type blocks.\nMCCE-817 – Map walls are broken since CU19 on Xbox One.\nMCCE-826 – Beacon height limit.\nMCCE-829 – The end build limit is smaller.\nMCCE-831 – Player skin is the default skin when holding a map.\nMCCE-833 – When Interface opacity is down, hotbar faded tools will not show their durability.\nMCCE-856 – Red sandstone stairs texture incorrect.\nMCCE-863 – The map does not work as it should unless \"View Hand\" is turned on.\nMCCE-865 – Rabbits only appear to spawn naturally in snow biomes.\nMCCE-878 – Book and quill saving issue: opening and closing an edited (not signed) writeable book deletes the saved pages.\nMCCE-885 – Feather Falling enchantment does not reduce fall or ender pearl damage.\nMCCE-886 – Feather Falling IV not working\nMCCE-962 – Increase to slime spawning.\nMCCE-1009 – Skulls in the inventory and held in first person are oversized.\nMCCE-1024 – Raw fish and raw salmon have the same texture in the Natural Texture Pack.\nMCCE-1072 – In the City Texture Pack it shows smooth red sandstone as a rough block but when you place it, it is smooth.\nMCCE-1091 – Some fire caused by ghast's fireball explosion is not displayed.\nMCCE-1127 – Wolfs default collar color had changed from orange to red.\nMCCE-1142 – Minecraft Capes using incorrect texture.\nMCCE-1192 – Texture under the bed is the texture of the top of the bed.\nMCCE-1202 – Map dark when facing north or south.\nMCCE-1214 – Texture of any potion turns black while holding it in the End or Nether.\nMCCE-1349 – Penned animals de-spawn when leaving the chunk.\nMCCE-1366 – When placing a torch under water to reset / refill the air meter will often cause a crash.\nMCCE-1367 – Melon farm with piston causes crash.\nMCCE-1403 – Hunger meter always regenerates when switching from peaceful to any other difficulty.\nMCCE-1415 – Hunger meter depletion glitch\nMCCE-1434 – Fishing rod bobber sticks to walls.\nMCCE-1455 – Piston/slime block duplication.\nMCCE-1457 – TNT can destroy blocks placed well beyond the world border.\nMCCE-1476 – Skin Pack 6: Faith Connors' Mirror's Edge Skin first person view bugged on Xbox 360.\nMCCE-1488 – 'Getting an Upgrade' trophy/achievement fails to unlock while crafting a stone pickaxe using classic crafting.", "bbox": [238.046875, 869.015625, 690, 931]}, {"text": "Fix for crash when ender chest is mined for a few seconds.\nFix for an intermittent crash when placing beds on snow.\nFix for a crash when a Superflat world session with a combination of multiple planks or wood, lava and air layers is saved.\nFix for a crash after destroying blocks and exploring a Superflat world with multiple sand, air and TNT Layers.\nImproved random seed generator to select worlds with a better spread of biomes.\nFix for Villagers not harvesting crops from farmland created by the player.\nFix for glass not being able to be broken by hand in Adventure mode.\nFix for an issue where the user renames a 'Spawn Egg' and places it in water, causing debug text to be displayed.\nFix for an issue when the \"Body Guard\" trophy/achievement does not unlock as expected when the iron golem is built in a certain way.\nFix for an issue where a player cannot see other players after dying and respawning.\nFix for an issue where baby horses appear to be adults after feeding with one golden carrot.\nFix for issue where two primary powers can be applied to the player's character through the beacon UI.\nFix for an issue where a Torch and a Redstone Torch have two hitboxes.\nFix for de-spawn protections not being applied to baby animals created with Spawn Eggs.\nFix for issue where item quantity for bottle o' enchanting, nether star, enchanted golden apple and strength indicator for potions are not affected by Interface Opacity when in Quick Select.\nFix for death message with incorrect text is displayed when the player is killed with a named weapon.\nFix for worlds generating slightly differently every time even with the same seed.\nFix for issue where leather clothes, spawn eggs and potions are displayed improperly when the player is above 256 blocks or is in a place where there is no source of daylight.\nFix for Doors, Trapdoors and Fence Gates missing a sound effect when closing.\nFix for issue where opening certain menus does not cancel the eating, drinking or bow charging animations.\nFixed an issue where items that have no custom names were not showing up in edit text field in the Anvil.\nFix for ocelots not sprinting away from the player.\nFix for pistons and objects pushed by them having corrupted, black textures while animating.\nFix for falling gravel, Sand and Red Sand blocks displaying with very dark textures.\nFix for issue where texture pack changes to vanilla Minecraft textures if the player joins a friend's session.\nAdded first person rendering of additional skin parts for the left and right arms.\nFix for an issue when in a split-screen session where at least one player does not get critical hit particles.\nFix for seeing through the base of falling blocks.\nFix for missing mining animation for skulls, heads, signs, chests and beacons.\nFix for issue where changing the Interface Opacity to specific values causes visual issues with the item and button icons on the HUD.\nFix for issue when traveling directly north or south in a minecart where the player automatically turns to face eastwards.\nFix for missing tooltip for 'Exit' / 'Dismount' actions.\nFix for guardians not being spawned around ocean monuments on a Superflat world.\nFix for city Texture Pack missing textures for multiple kinds of doors while holding in the player's hand\nFix for sign text not displaying.\nFix for cows needing to take 11 hits with hand or 3 hits with any Sword to be killed.\nFix for clownfish description displaying incorrect information.\nFix for Golden Apple's regeneration animation not being smooth.\nFix for issues using certain symbols while renaming items on the Anvil.\nFixed an issue unlocking the 'Iron Belly' trophy.", "bbox": [238.046875, 1818.015625, 690, 1151]}, {"text": "See also", "bbox": [202.046875, 2993.515625, 726, 43]}, {"text": "Xbox One Edition CU20\nPlayStation 3 Edition 1.23\nPlayStation 4 Edition 1.23\nPlayStation Vita Edition 1.23\nWii U Edition Patch 3", "bbox": [238.046875, 3045.515625, 690, 123]}, {"text": "References", "bbox": [202.046875, 3186.015625, 726, 43]}, {"text": "\"Minecraft: Xbox 360 Edition Patch change logs\" – Minecraft Forum, February 12, 2016.", "bbox": [248.046875, 3241.015625, 549, 17]}, {"text": "\"Can't play multiplayer after update\" by 4JSteve, February 12, 2016. \"845 was the original update and 849 was the re-submission.\"", "bbox": [238.046875, 3265.515625, 686, 41]}]}