{"metadata": {"url": "https://minecraft.fandom.com/wiki/Herobrine/StreamFAQ", "title": "Herobrine/StreamFAQ", "time": "17/04/2022 04:05:36"}, "tables": [], "images": [], "sprites": [], "texts": [{"text": "Herobrine/StreamFAQ", "bbox": [202.046875, 347, 538, 45]}, {"text": "This source is an interview of historic events between a Minecraft wiki admin and Copeland, concerning frequently asked/wanted answers about how and why the stream took place.\nThis page exists to allow users to view this source material before its wikification. ", "bbox": [250.53125, 483.59375, 629, 73]}, {"text": "1 - How did you decide to stage this hoax?", "bbox": [202.046875, 601.6875, 726, 25]}, {"text": "I came across the original Herobrine creepypasta on /v/ and immediately liked it. The first thing I did was photoshop Herobrine into one of my screenshots and I posted it in the stream's chat. It got a pretty big reaction from everybody, ranging from laughs to people asking me through PM if it was real because they were scared. It was pretty great, so I knew the next step would be to include Herobrine into one of my streams. I spent a little while brainstorming different ideas, and testing out different things in game. Initially I wanted to do it on SMP (SMP having come out about 3 weeks prior) but SMP was very glitchy at the time, and too much could have went wrong. Retexturing blocks was out of the question since the wall 'Herobrine' was on was an outside wall, and could be seen easily. I ended up retexturing a painting since there were none in my world at the time and it looked pretty good at a glance. My world had both wood and iron doors at the time of the hoax, so those wouldn't have worked.", "bbox": [202.046875, 650.1875, 726, 245]}, {"text": "I started the stream like normal and just played Minecraft like normal, except avoided going near the room the Herobrine painting was in. About 2 hours into the stream I went into the room pretending like I was going to furnish it but he was right in front of the door, just as planned. I screamed and jerked the camera away so nobody could get a good look at it. I thought it was pretty darn believable!", "bbox": [202.046875, 919.1875, 726, 98]}, {"text": "2 - How many people were \"in\" on it?", "bbox": [202.046875, 1041.1875, 726, 49]}, {"text": "Nobody. I was originally going to ask somebody to be Herobrine over SMP, which would have involved somebody else, but since that wasn't needed I didn't see any reason to tell anybody. I didn't admit he was real to anybody - even my closest friends - until almost an entire year after the incident.", "bbox": [202.046875, 1114.1875, 726, 98]}, {"text": "People often assume that Patimuss and I conspired together for our two different sightings, but that's not true. I actually wasn't even around when he did his stream, and didn't even know he did until I came on the site afterwards.", "bbox": [202.046875, 1236.1875, 726, 73]}, {"text": "3 - You had a lot of choice for your hoax. It could have easily been Slenderman, or a more notable meme. Why herobrine?", "bbox": [202.046875, 1333.6875, 726, 74]}, {"text": "Like I mentioned earlier, I liked the original creepypasta originally. Unlike Slenderman or anything else, it was Minecraft specific. I think that's what it had going for it, really. It just wouldn't be the same if it was just an old meme thrown into the Minecraft world. Nobody would care about a Slenderman sighting in Minecraft.", "bbox": [202.046875, 1431.1875, 726, 98]}, {"text": "4 - How did you think the community would have reacted to your stream?", "bbox": [202.046875, 1553.1875, 726, 49]}, {"text": "I thought a couple hundred people would enjoy it and it'd be forgotten about by the next week. I really didn't expect a whole lot to happen with him - if I had, I'd of put a little more effort into my first post and advertised the stream more in it ;].", "bbox": [202.046875, 1626.1875, 726, 98]}, {"text": "But, seriously, I did not expect it at all. Then again, Minecraft was a lot less popular back then - and I didn't expect the game to explode into the popularity it has now, either.", "bbox": [202.046875, 1748.1875, 726, 49]}, {"text": "5 - How did you react when the community started to really get into the video?", "bbox": [202.046875, 1821.1875, 726, 49]}, {"text": "Yeah - surprised mostly. The whole thing just kept growing and growing. I loved reading all the posts people made in the original thread but then people started making their own threads, and then their own fake sightings, and then videos. It quickly went from me enjoying the few posts it got to it getting too many mentions for me to possibly ever read. It was pretty weird watching it grow like that.", "bbox": [202.046875, 1894.1875, 726, 122]}, {"text": "6 - Did this change anything with the stream, in regard to content, audience etc.?", "bbox": [202.046875, 2040.6875, 726, 49]}, {"text": "Yeah, most definitely. For the first day or so you really couldn't go back 10 lines without somebody saying something about Herobrine. Then it started to die down on the second and third days, since all of the regulars in the stream had gotten bored with him, but then all these new people started coming by and talking about Herobrine again. We got a lot of new people into the stream after the hoax, but most didn't stay very long. We ran a pretty adult-rated stream, and I feel like a lot of the Minecraft Forum users were younger. I was unwilling to change my content for the new audience, so most ended up leaving pretty fast. Still, with the large number of new people checking it out a small percentage stayed, and our audience grew pretty significantly.", "bbox": [202.046875, 2113.6875, 726, 196]}, {"text": "7 - When Herobrine's popularity exploded, was there any form of spam? any backlash?", "bbox": [202.046875, 2333.6875, 726, 49]}, {"text": "Tons of it. We had lots of new guys coming into the chat and saying stuff like \"Where's Herobrine?\", \"Is he real?\", \"So you did Herobrine?\". A lot of the older viewers weren't too happy with that. I Wasn't, either, to be honest, but there wasn't a whole lot I could do - our chat program was pretty limited. I also had a lot of people who blamed me for Herobrine's popularity, and got upset at me because they were tired of hearing about him everywhere. I understand that, but, the blame was definitely missplaced there. I couldn't stop it at that point, nor was I the one posting about him any more.", "bbox": [202.046875, 2406.6875, 726, 172]}, {"text": "8 - This hoax propelled your stream for a while, being a very popular source of mystery for a brief while. Did any of this newfound popularity stick?", "bbox": [202.046875, 2602.1875, 726, 73]}, {"text": "Haha, not really. After a few months with the video gone and the original post buried, seeing people asking about him only happened a few times a day. We did gain a small number of loyal viewers, though, and they stuck around. Then I had broke off with my partner on Brocraft and started a new stream, and while a lot of people migrated over and we kept the same chat and Livestream channel, we no longer have the old Brocraft URL or name - so after the move the number of people asking about him fell to almost none.", "bbox": [202.046875, 2699.6875, 726, 147]}, {"text": "9 - When you created this hoax, what did you see Herobrine as being? vengeful? or just creepy?", "bbox": [202.046875, 2870.6875, 726, 49]}, {"text": "I always kind of viewed him as being pretty scary, but not dangerous. I never thought of him as something that could hurt the player or even destroy their projects. To me he will always be off in the distance, watching the player from afar and leaving little clues about his presence, but never directly interacting with you.", "bbox": [202.046875, 2943.6875, 726, 98]}, {"text": "10 - Why do you think the community latched on to your stream so much?", "bbox": [202.046875, 3114.1875, 726, 24]}, {"text": "Honestly, I think the stream was pretty convincing. I had plenty of people who genuinely asked me if he was real or not. I even had people who knew me for a while saying things like \"Copeland never screams like that, it sounded like he was genuinely terrified\". Even the video seemed pretty convincing - so long as you didn't pause it. And since it was all done live, and the first 2 hours of the stream didn't even hint at what I was going to do, it all just seemed like it could have maybe been real. And I like to think that little bit of doubt people have is what helped make the video so popular.", "bbox": [202.046875, 3162.6875, 726, 172]}, {"text": "11 - Do you feel partly responsible for herobrine's popularity?", "bbox": [202.046875, 3358.1875, 726, 49]}, {"text": "Not really. Sure, I'm happy with how the stream went and I think it was pretty convincing, and I think that without the stream Herobrine would have probably stayed an obscure creepypasta - but it was the community that made it popular. After the initial stream and subsequent forum post I was done. I didn't do anything else at all to help Herobrine's popularity. I guess I sparked the popularity, instead of helped it. Maybe that's more fitting.", "bbox": [202.046875, 3431.1875, 726, 122]}, {"text": "12 - What are your thoughts on Mojang's stance on implementing Herobrine?", "bbox": [202.046875, 3577.6875, 726, 49]}, {"text": "I don't think Herobrine should be added to the game. I think that would ruin a lot of what makes Herobrine what he is. As soon as you make him canon you can't make legends or rumors about him any more, and that's most of the fun.", "bbox": [202.046875, 3650.6875, 726, 98]}, {"text": "13 - What do you think of the Herobrine mod that's floating about? Anything you particularly like, or dislike about it?", "bbox": [202.046875, 3772.6875, 726, 74]}, {"text": "I've actually never heard of it before right now. I found the most popular \"Herobrine mod\" on the forums - I assume that's the one you're talking about. I read about it and watched the videos and it doesn't seem like my version of Herobrine at all. But that's the beauty of urban legends; you're free to interpret it how you like, and expand on the story, give it your own twists.", "bbox": [202.046875, 3870.1875, 726, 122]}, {"text": "14 - What happened to Brocraft since the stream?", "bbox": [202.046875, 4016.6875, 726, 49]}, {"text": "I left the site a few months after the hoax. I ran the site with an ex-buddy of mine, and the two of us had a big argument over what's acceptable on the site and I ended up running my own stream. He kept the URL and the \"Brocraft\" name, but I kept the Livestream channel. I'm not really sure what's happened on there since then.", "bbox": [202.046875, 4089.6875, 726, 98]}, {"text": "15 - What are your current thoughts on Herobrine?", "bbox": [202.046875, 4211.6875, 726, 49]}, {"text": "Honestly, I don't really have many. Herobrine was fun for a while but got old pretty fast. I really haven't thought much about Herobrine at all in the past 2 years. If I happen to see him mentioned I think \"Oh, hey, Herobrine, I remember him\" and that's about it. Someone on my Steam Friend's list had to tell me about the Wikipedia page. It incorrectly said I had a wife for 2 years.", "bbox": [202.046875, 4284.6875, 726, 123]}, {"text": "16 - If you had a second chance, would you have done this stream any differently?", "bbox": [202.046875, 4431.1875, 726, 49]}, {"text": "Hmm, not really. I probably would have plugged the stream in the original forum post, but that's about it. I'm happy with my contribution to the whole Herobrine thing, and I don't think I could have done a whole lot else, or even anything better.", "bbox": [202.046875, 4504.1875, 726, 98]}]}