{"metadata": {"url": "https://minecraft.fandom.com/wiki/Zombie_Town", "title": "Zombie_Town", "time": "16/04/2022 22:39:48"}, "tables": [], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/a/a8/ZombieTown.png", "path": "images/img.png", "alt_text": "", "caption": "Image from the Zombie Town test, which uses the player model later used in Minecraft.", "bbox": [747.9375, 414.5, 180, 198]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/a/aa/Left_4k_Dead.jpg", "path": "images/img.jpg", "alt_text": "", "caption": "Left 4k Dead, a zombie game by Notch. This is the predecessor to Zombie Town.", "bbox": [747.9375, 770.015625, 180, 180]}], "sprites": [], "texts": [{"text": "Zombie Town", "bbox": [202.046875, 349.5, 593, 45]}, {"text": "Zombie Town is a game that Markus Persson (Notch) developed in February of 2009. The game's characters were adopted as the humans in Minecraft a few months later. They formed the first character model for Minecraft.", "bbox": [202.046875, 414.5, 726, 74]}, {"text": "Contents", "bbox": [215.046875, 527.75, 81, 17]}, {"text": "1 History\n2 Trivia\n3 References\n4 See also", "bbox": [203.046875, 561.015625, 145, 132]}, {"text": "History", "bbox": [202.046875, 718.015625, 726, 43]}, {"text": "Before Notch started to work on Minecraft, he took part in various editions of the Java 4K Game Programming Contest from 2005 to 2009. This competition, initiated by Java programmers, was about writing the best possible computer game with a maximum size of 4 kibibytes (4096 bytes). Notch submitted the following games:", "bbox": [202.046875, 770.015625, 726, 122]}, {"text": "2005: Sonic Racer 4k: a racing game.\n2005: Dungeon4k: a dungeon crawler.\n2005: Hunters4k: a first-person shooter.\n2006: Miners4k: a mining game.\n2008: t4kns: a real-time strategy game.\n2009: Left 4k Dead: a zombie shooter, inspired by Left 4 Dead.\n2009: MEG4kMAN: a Mega Man fan-game.", "bbox": [238.046875, 916.515625, 690, 172]}, {"text": "Due to the nature of the contest, these games were extremely simple. Left 4k Dead is similar to Pac-Man; the character walks through a labyrinth of corridors and rooms that are sparsely illuminated with a flashlight. Zombies frequently attack and have to be shot.", "bbox": [202.046875, 1106.015625, 726, 73]}, {"text": "The zombie theme appeared to be prevalent throughout Notch's games, and he was planning an improved sequel to Left 4k Dead, which he called Zombie Town.[1] Notch wanted three-dimensional pawns, inspired by Grand Theft Auto: Chinatown Wars. For the first time in his life, he programmed the completely three-dimensional representation of figure textures from scratch.[2]", "bbox": [202.046875, 1203.515625, 726, 98]}, {"text": "In May 2009, Notch started developing Minecraft. Using the characters from Zombie Town as Steve: three days after into development, he added Zombie Town's characters into Minecraft as humans.[3] They were the first tests for the player character, which was necessary for the later introduced multiplayer mode.", "bbox": [202.046875, 1325.515625, 726, 74]}, {"text": "Trivia", "bbox": [202.046875, 1423.015625, 726, 43]}, {"text": "Notch's video of the game was called \"Zombie Town\", however, in his blog post he referred to the game as \"ZombieTown\".\nOn Twitter, Notch referred to the game on two different occasions, once as “Zombietown”,[4] and again as “zombietown”.[5] He also revealed that he had made around four different unreleased projects under the same name.\nThe original upload of the Zombie Town video was located here, but it has since been blocked, though archived versions are still available.", "bbox": [238.046875, 1475.015625, 690, 171]}, {"text": "References", "bbox": [202.046875, 1664.515625, 726, 43]}, {"text": "\"The origins of Minecraft\" (archived) – The Word of Notch, October 30, 2009.", "bbox": [248.046875, 1719.515625, 470, 17]}, {"text": "\"Zombie Town\" (archived) by Notch – Archive.org, October 30, 2009.", "bbox": [248.046875, 1744.015625, 422, 17]}, {"text": "\"Exhausted, but happy\" (archived) – The Word of Notch, May 14, 2009.", "bbox": [248.046875, 1768.515625, 434, 17]}, {"text": "\"(...) Metagun remake, Minitale, and Zombietown (needs better name). And, you know, Minecraft and 0x10c. Fun! =D\" – @notch on Twitter, May 24, 2012", "bbox": [238.046875, 1793.015625, 685, 42]}, {"text": "\"I went with zombietown. I think it's the fourth project I have with that name across various /backup/old_2/ folders\" – @notch on Twitter, February 2, 2017", "bbox": [238.046875, 1842.015625, 589, 42]}, {"text": "See also", "bbox": [202.046875, 1906.015625, 726, 43]}, {"text": "Minecraft 4k, another game Notch created for the Java 4K contest.\nRubyDung, another game preceding Minecraft.\nLegend of the Chambered, another game preceding Minecraft.\nInfiniminer, another game preceding Minecraft.\nMinicraft, another game created for a contest.", "bbox": [238.046875, 1958.015625, 690, 122]}]}