{"metadata": {"url": "https://minecraft.fandom.com/wiki/Tutorials/Slime_farming", "title": "Tutorials/Slime_farming", "time": "17/04/2022 02:09:31"}, "tables": [{"bbox": [202.046875, 1285.515625, 449, 212], "headers": {"text": ["Chunks mined", "Probability of finding at least 1 slime chunk (%)"], "bboxes": [[202.546875, 1310.515625, 111, 31], [313.734375, 1310.515625, 337, 31]]}, "cells": {"text": ["07", "52.17", "14", "77.12", "16", "81.47", "22", "90.15", "29", "95.29"], "bboxes": [[202.546875, 1341.609375, 111, 31], [313.734375, 1341.609375, 337, 31], [202.546875, 1372.703125, 111, 31], [313.734375, 1372.703125, 337, 31], [202.546875, 1403.796875, 111, 31], [313.734375, 1403.796875, 337, 31], [202.546875, 1434.890625, 111, 31], [313.734375, 1434.890625, 337, 31], [202.546875, 1465.984375, 111, 31], [313.734375, 1465.984375, 337, 31]]}}], "images": [], "sprites": [], "texts": [{"text": "Tutorials/Slime farming", "bbox": [202.046875, 313, 593, 45]}, {"text": "Slime farming is a method of automatically spawning and killing slimes to easily obtain slimeballs, which can be crafted into slime blocks.", "bbox": [202.046875, 402.5, 711, 49]}, {"text": "Both slime blocks and sticky pistons, which are crafted using slimeballs, are essential in many redstone builds. Slimeballs can also be crafted into magma cream, which is needed for brewing potions of fire resistance. Because slime blocks break instantly when hit (with a bare hand or any tool), they are useful for quickly displacing and clearing out volumes of water, even when under the effect of Mining Fatigue inflicted by an elder guardian.", "bbox": [202.046875, 475.5, 711, 123]}, {"text": "Contents", "bbox": [215.046875, 637.75, 81, 17]}, {"text": "1 Method\n1.1 Pre-build\n1.2 Spawning\n1.3 Transportation\n1.4 Separation and killing trap\n1.5 Item collection (optional)\n2 Basic survival build\n3 Other designs\n3.1 Mysticat's 1.15+ Easy Slime Farm 3-minute Tutorial\n3.2 ilmango's 1.10+ Slime Farm (18,200 slimeballs/h)", "bbox": [203.046875, 671.015625, 392, 303]}, {"text": "Method", "bbox": [202.046875, 999.015625, 711, 43]}, {"text": "Pre-build", "bbox": [202.046875, 1066.015625, 711, 22]}, {"text": "Before building a slime farm, first decide whether to build it in a slime chunk or swamp biome. Every chunk that is generated in a world has a 10% chance of being a slime chunk. Within slime chunks, slimes can spawn when Y < 40. This method requires an underground room to be dug out before the farm is constructed. Slime spawning in swamps can occur between Y=51 and Y=69. This method has the advantage of not requiring a dug-out room prior to building the farm, and the size of the farm is not limited, unlike the slime-chunk method, although the spawn rates are lower in a swamp.", "bbox": [202.046875, 1100.515625, 711, 147]}, {"text": "Alternately, you can use the Chunkbase Slime Chunk Finder web app to locate chunks for your game seed.", "bbox": [202.046875, 1511.578125, 711, 25]}, {"text": "Spawning", "bbox": [202.046875, 1560.078125, 711, 22]}, {"text": "The first step in constructing either farm is the spawning place. In most farm designs, spawning platforms are created which spawn slimes that are then moved to a killing trap, usually a drowning trap to split larger slimes down and dispatch the smallest size. Spawning pads are usually constructed with a 2½-block gap using slabs, to allow all types of slimes to spawn. It is important to illuminate the spawn platforms a bit to allow slimes to spawn while preventing other hostile mobs from spawning. It is also recommended to illuminate horizontal surfaces in a 128-block radius around the farm, to keep the hostile mob cap as low as possible.", "bbox": [202.046875, 1594.578125, 711, 147]}, {"text": "Transportation", "bbox": [202.046875, 1765.578125, 711, 23]}, {"text": "The second step in building a slime farm is transportation. In pre-1.8 traps, this is usually achieved by using 'canals' of water separated by signs. As slimes can swim in snapshot 14w06a and above, specific water placement is required in Java Edition 1.8 and above. Or using an iron golem to attract the slime to the killing spot.", "bbox": [202.046875, 1800.078125, 711, 73]}, {"text": "Separation and killing trap", "bbox": [202.046875, 1897.578125, 711, 23]}, {"text": "The final step in building a slime farm is the separation and killing trap. To separate the different sizes down to the smallest, a drowning trap is usually used. The largest type of slime is split to the medium size, and medium to small. The slimes are then taken off to another trap to be killed, usually another drowning trap. Separation trap could be used as a killing trap also.", "bbox": [202.046875, 1932.078125, 711, 98]}, {"text": "Alternatively, a water stream carrying the slimes flowing into a cactus trap can be used. Hoppers around the base of the cacti then collect the drops. This has the advantage of killing all sizes of slimes without the need for separation. A downside of this method is that the cacti destroy around 20% of the slimeballs that are dropped.", "bbox": [202.046875, 2054.078125, 711, 73]}, {"text": "A quick and lossless method for killing slimes is using magma blocks. Slimes can either be pushed there with a water stream, drawn there by iron golems, or allowed to roam off the side on their own. A hopper minecart track underneath the magma blocks can be used to collect the drops.", "bbox": [202.046875, 2151.578125, 711, 74]}, {"text": "For an interesting option, vindicators named \"Johnny\", or zoglins attack all slimes, but the slimes never retaliate.", "bbox": [202.046875, 2249.078125, 711, 24]}, {"text": "Item collection (optional)", "bbox": [202.046875, 2297.578125, 711, 23]}, {"text": "To automatically collect the slimeballs produced by the farm, create a hole below the end of the trap, with hoppers feeding into one or more double chests.", "bbox": [202.046875, 2332.078125, 711, 49]}, {"text": "Basic survival build", "bbox": [202.046875, 2405.078125, 711, 43]}, {"text": "The simplest slime farm that requires the least amount of resources is Jioge's 1.8 slime grinder, which has been tested to work in 1.16. This farm requires a spawn chunk, at least 9 signs, 3 hoppers and a chest, and many torches. Glass blocks are also helpful (particularly on top of the chest so that it can still be opened without letting water or slimes into the collection room). Because slimes can swim upward and horizontally, it is important to note how water is placed in the drowning trap.", "bbox": [202.046875, 2457.078125, 711, 122]}, {"text": "Rarely, a wandering trader and its trader llamas may spawn in this farm and drown, leaving you with a lead and a piece of leather in your collection chest.", "bbox": [202.046875, 2603.578125, 711, 49]}, {"text": "If not properly lit, undead mobs may spawn in this farm and collect in the trap without dying. An observation deck above is useful for letting you fire an arrow into an opening to clear out any \"by-catch\" mobs.", "bbox": [202.046875, 2676.578125, 711, 49]}, {"text": "Other designs", "bbox": [202.046875, 3006.578125, 711, 43]}, {"text": "Other more elaborate designs require more exotic and expensive resources.", "bbox": [202.046875, 3058.578125, 711, 25]}, {"text": "Mysticat's 1.15+ Easy Slime Farm 3-minute Tutorial", "bbox": [202.046875, 3107.078125, 711, 22]}, {"text": "A very simple design that gets you enough slimeballs without being overkill.", "bbox": [202.046875, 3141.578125, 711, 25]}, {"text": "ilmango's 1.10+ Slime Farm (18,200 slimeballs/h)", "bbox": [202.046875, 3453.078125, 711, 22]}, {"text": "This slime farm's design is quite different from most of the others. It uses fewer spawning pads, which, due to the way the slime spawning algorithm works, increases the spawning rates (see video for more details). The slimes are then lured off of the platforms using iron golems and killed by magma blocks.", "bbox": [202.046875, 3487.578125, 711, 74]}]}