{"metadata": {"url": "https://minecraft.fandom.com/wiki/Tutorials/Major_League_Gaming", "title": "Tutorials/Major_League_Gaming", "time": "17/04/2022 03:29:30"}, "tables": [], "images": [], "sprites": [], "texts": [{"text": "Tutorials/Major League Gaming", "bbox": [202.046875, 313, 593, 45]}, {"text": "MLGs are tricks in Minecraft, where a player can unleash to survive falling from heights and dying. There are many MLGs available in Minecraft. It stands for Major League Gaming.", "bbox": [202.046875, 402.5, 726, 49]}, {"text": "Water bucket MLG - falling with momentum, and before hitting ground placing water. Negates damage, but sometimes you miss the water and die! Lava MLG works too, but only if there is another lava source below the first, or if you clutch a wall before.", "bbox": [202.046875, 475.5, 726, 74]}, {"text": "Hay bale MLG - same as water, but you place a hay bale instead. Damage reduced by 80%", "bbox": [202.046875, 573, 726, 24]}, {"text": "Cobweb MLG - same as water, but you place a cobweb instead, reducing all damage. But then, you’re stuck in a cobweb! Make sure you have a sword or shears!", "bbox": [202.046875, 621.5, 726, 49]}, {"text": "Boat MLG (Java Edition only) Either ride a boat of a high place, or place it and enter it before hitting ground. If you try this in Bedrock Edition, you’ll just take 100% fall damage, unless you land the boat in water.", "bbox": [202.046875, 694.5, 726, 49]}, {"text": "Vine/Ladder MLG - before ground impact, place a ladder/vine on the side of a block and land.", "bbox": [202.046875, 767.5, 726, 25]}, {"text": "Scaffolding MLG - before ground impact, place scaffolding.", "bbox": [202.046875, 816, 726, 24]}, {"text": "Mid-air Slow Falling MLG -drink a Potion of Slow Falling before ground impact, and land.", "bbox": [202.046875, 864.5, 726, 25]}, {"text": "Slime/Honey block MLG - same as water MLG, but you will bounce high up into the air (slime), reducing all damage. Just don’t land on the edge!", "bbox": [202.046875, 913, 726, 49]}, {"text": "Boots (armor) Feather Falling MLG - enchant boots with Feather Falling, and land with reduced damage.", "bbox": [202.046875, 986, 726, 24]}]}