{"metadata": {"url": "https://minecraft.fandom.com/wiki/Featured_servers/CubeCraft", "title": "Featured_servers/CubeCraft", "time": "17/04/2022 04:05:47"}, "tables": [{"bbox": [624.9375, 978.84375, 300, 401], "headers": {"text": ["Server type", "Address", "Language(s)", "App", "Links"], "bboxes": [[625.9375, 979.84375, 87, 30], [625.9375, 1010.875, 87, 54], [625.9375, 1065.9375, 87, 140], [625.9375, 1207.125, 87, 52], [625.9375, 1260.1875, 87, 118]]}, "cells": {"text": ["Minigames", "play.cubecraft.net mco.cubecraft.net", "Arabic, Bulgarian, Catalan, Czech, Danish, Dutch, English, Finnish, German, Hungarian, Italian, Polish, Portuguese (BR), Portuguese (EU), Russian, Spanish, Swedish, Turkish.", "CubeCraft Companion (Discontinued)", "Discord: https://discord.gg/cubecraft\nTwitter: @CubeCraftGames\nWebsite: https://www.cubecraft.net"], "bboxes": [[713.9375, 979.84375, 210, 30], [713.9375, 1010.875, 210, 54], [713.9375, 1065.9375, 210, 140], [713.9375, 1207.125, 210, 52], [713.9375, 1260.1875, 210, 118]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/c/c5/Move_arrows.svg", "path": "images/Move arrows.png", "alt_text": "Move arrows", "caption": null, "bbox": [260.53125, 689.09375, 32, 32]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/e/e7/Dark_Oak_Sapling_JE7_BE2.png", "path": "images/Dark Oak Sapling JE7 BE2.png", "alt_text": "Dark Oak Sapling JE7 BE2", "caption": null, "bbox": [260.53125, 823.78125, 32, 32]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/7/78/CubeCraft.png", "path": "images/CubeCraft.png", "alt_text": "CubeCraft", "caption": null, "bbox": [699.9375, 928.84375, 150, 46]}], "sprites": [], "texts": [{"text": "Featured servers/CubeCraft", "bbox": [202.046875, 509.5, 593, 45]}, {"text": "CubeCraft is a featured Server in the Bedrock Edition. It was introduced in the Better Together Update. The content in CubeCraft focuses on minigames. Currently, there are eight minigames that can be played on this server: EggWars, SkyWars, Survival Games, BlockWars, Lucky Blocks, Skyblock, MinerWare, Battle Arena, Parkour, and the experimental gamemodes. CubeCraft also has a server on Java Edition.", "bbox": [202.046875, 883.375, 726, 172]}, {"text": "Contents", "bbox": [215.046875, 1094.625, 81, 17]}, {"text": "1 Minigames\n1.1 EggWars\n1.2 Lucky Blocks\n1.3 SkyWars\n1.4 Skyblock\n1.5 BlockWars\n1.6 Battle Arena\n1.7 Survival Games\n1.8 Parkour\n1.9 MinerWare\n1.10 Capture The Flag\n2 Parties\n3 Friending Players", "bbox": [203.046875, 1127.890625, 188, 389]}, {"text": "Minigames", "bbox": [202.046875, 1541.390625, 726, 43]}, {"text": "EggWars", "bbox": [202.046875, 1608.390625, 726, 23]}, {"text": "EggWars can be played solo, with teams of two teams of four, and Mega (Teams of 10). Each team is randomly assigned a colour to distinguish between them. The object of the game is to be the last player or team alive. An EggWars map consists of a floating home island for each team, and a larger middle island in the centre of the map. Teams begin the game with one egg on their home island. As long as a team's egg is alive, players on that team respawn upon death. Therefore, destroying other teams' eggs is a major goal. On the home islands there is also a shop (in the form of a villager) and several token generators. These generators periodically create certain types of tokens that can be traded for helpful items in the shop. Some tokens are higher value and can be traded for better items. In order of value, the token types are iron, gold, diamond, and emerald. The higher value generators can initially only be found on the central island. Each generator can also be upgraded which decreases the intervals between tokens spawning in.", "bbox": [202.046875, 1642.890625, 726, 245]}, {"text": "Lucky Blocks", "bbox": [202.046875, 1911.890625, 726, 22]}, {"text": "Lucky Blocks can be played solo or with teams of four. Lucky Blocks is like SkyWars but with a twist of instead of having chests with items in there is lucky blocks. The aim of the game is to eliminate the other players by killing them with the loot that is acquired from the Lucky Blocks which are located around the map, and for you (or your team) to be the last one(s) standing. Lucky Blocks was originally part of the Beta Test, but since been released after 2 updates.", "bbox": [202.046875, 1946.390625, 726, 123]}, {"text": "SkyWars", "bbox": [202.046875, 2092.890625, 726, 22]}, {"text": "SkyWars can be played solo, in teams of two, in teams of four, or in a mega mode that has teams of ten or a special gamemode for \"VIP's\" called Chaos. The goal of skywars is to be part of the last surviving team. Teams in skywars begin on smaller home islands floating in the void around a central larger middle island. Chests with loot can be found scattered around the map. Players can acquire items such as weapons and armor from these chests that will help them win battles with enemy players. The chests on the central island contain better loot than the ones on the home islands, which provides an incentive to go to the middle of the map. After certain periods of time, the chests around the map will refill with more (and progressively better) loot.", "bbox": [202.046875, 2127.390625, 726, 172]}, {"text": "Skyblock", "bbox": [202.046875, 2322.890625, 726, 22]}, {"text": "Cubecraft Skyblock is a very unique type of Skyblock. You start on one island, and as you complete quests by gathering items or doing other things, you unlock new islands. As you gain more islands, you gain access to animal/monster spawners, ore generators, saplings, and plants. You can sell items in a Skyblock shop, and also buy certain items (specifically dirt, water, spawners, generators, plants, and saplings). True", "bbox": [202.046875, 2357.390625, 726, 98]}, {"text": "BlockWars", "bbox": [202.046875, 2479.390625, 726, 23]}, {"text": "BlockWars is a game of Red Vs. Blue. Currently there's only two gamemodes, CTF, Which stands for Capture the Flag, and Bridge. The aim of the game is to capture the enemy flag. It's a 5v5 team gamemode.There is also a Bridge game where you have to travel across a bridge and jump in to the opponents scoring pit.", "bbox": [202.046875, 2513.890625, 726, 73]}, {"text": "Battle Arena", "bbox": [202.046875, 2611.390625, 726, 23]}, {"text": "PvP games, Duels and FFA are all in the Battle Arena Lobby. This lobby is new before all the PvP games are at Beta Games", "bbox": [202.046875, 2645.890625, 726, 49]}, {"text": "Survival Games", "bbox": [202.046875, 2718.890625, 726, 22]}, {"text": "Survival Games is based on the popular Minecraft interpretation of the Hunger Games. There are currently two modes, Teams of 2 and Solos. In this game, twelve players are put into a map or 'arena', and the game ends when one player is left alive. Players begin in a circle around some middle structure on the map. This structure contains many chests full of loot that can be used in battles. There are other chests that can be found around the map, but they generally have worse loot than the ones in the middle structure. When the game starts, PvP is turned off for twenty seconds. This allows players to safely retrieve loot from the middle chests. As the game continues, players are encouraged to go toward the centre of the map in several ways. First, the middle chests can refill with more loot to use. Secondly, the border of the map begins to shrink. Any player who goes outside the border will start to suffocate.", "bbox": [202.046875, 2753.390625, 726, 221]}, {"text": "Parkour", "bbox": [202.046875, 2997.890625, 726, 22]}, {"text": "There are several parkours in the Parkour Lobby from the hub to the level itself. It has 5 difficulties(4 on the levels) with being Simple(hub only), Easy, Normal, Difficult, and Impossible. There is also a Competitive Parkour, where you duel someone to parkour. Multiple Modifiers such as Speed Boosts, Blindness, Don't Stop Moving are also available.", "bbox": [202.046875, 3032.390625, 726, 74]}, {"text": "MinerWare", "bbox": [202.046875, 3129.890625, 726, 22]}, {"text": "MinerWare can only be played solo, in games of twelve players. Each game has fifteen rounds, each of which consists of a 'microgame', or round that usually lasts about ten to fifteen seconds. The winner of each game is the player with the most points at the end. There are many microgames that can be played, each of which has some goal that is explained when the microgame begins. Any player that accomplishes this goal will be awarded one point. As the game goes on, the microgames will become more difficult to complete due to shorter timers being used. After the fifteen microgames, a longer 'boss game' is played. Boss games have longer timers, usually around 90 seconds, and they are worth three points. Currently, there are three boss games: TNT run, bow Spleef, and colour floor. Unlike the other minigames in CubeCraft, Minerware can end in a tie between two or more players with the same score.", "bbox": [202.046875, 3164.390625, 726, 221]}, {"text": "Capture The Flag", "bbox": [202.046875, 3408.890625, 726, 22]}, {"text": "Capture The Flag is a Minigame where you attempt to capture the opponent's flag and guard your own. There are many maps,and when you spawn,you get 1 Stone Sword,1 Stone Pickaxe,1 Stone Axe,1 Bow,32 Arrows,32 Blocks of ether Blue of Red Terracotta,and 8 Oak Wood. The first on who brings the enemy flag back to their own flag three times will win. If both are tied,they will enter overtime. Also,if one team captured the flag one time and the other two times,the team who captured the flag most will win.", "bbox": [202.046875, 3443.390625, 726, 123]}, {"text": "Parties", "bbox": [202.046875, 3589.890625, 726, 43]}, {"text": "On the CubeCraft server, players have the option to form a party of up to four people, although it can be increased, depending on how high level of \"VIP\" you have. When players are in a party they play minigames on the same team. The player who initially forms the party by sending the party invites is designated the party leader. Only the leader is able to select minigames to play. In addition, no party members can join a new minigame before the entire party is done playing the current game. Instead, players who are out of the game spectate. Parties are not able to play games or game modes with teams that are smaller than the number of players in the party. The only exception is minerware: despite being a solo game, parties can play minerware together. If the leader of a party leaves the server, the party is disbanded. Similarly, if any other member of the party leaves the server they also leave the party.", "bbox": [202.046875, 3641.890625, 726, 220]}, {"text": "Friending Players", "bbox": [202.046875, 3886.390625, 726, 43]}, {"text": "If players often form parties together on CubeCraft, it may be beneficial for them to join each other's friend lists. To do so, one player simply sends a friend request to another who is on the server. The second player can then accept the request. Players are notified whenever one of their friends joins or leaves the server, and they can send party invites to each other faster.", "bbox": [202.046875, 3938.390625, 726, 98]}]}