{"metadata": {"url": "https://minecraft.fandom.com/wiki/Survival", "title": "Survival", "time": "17/04/2022 01:03:39"}, "tables": [{"bbox": [202.046875, 2452.015625, 525, 1549], "headers": {"text": ["Java Edition Classic", "May 16, 2009", "June 14, 2009", "August 4, 2009", "August 18, 2009", "0.24 SURVIVAL TEST", "Java Edition Indev", "0.31", "20100129", "Java Edition Infdev", "20100327", "Java Edition Alpha", "v1.0.15", "Java Edition", "1.3.1", "Pocket Edition Alpha", "v0.2.0", "v0.3.0", "Legacy Console Edition", "TU1", "CU1", "1.0", "Patch 1", "1.0.1", "New Nintendo 3DS Edition", "0.1.0"], "bboxes": [[202.546875, 2452.515625, 524, 31], [202.546875, 2483.609375, 217, 55], [202.546875, 2539.203125, 217, 55], [202.546875, 2594.796875, 217, 80], [202.546875, 2674.890625, 217, 55], [202.546875, 2730.484375, 217, 387], [202.546875, 3117.765625, 524, 31], [202.546875, 3148.859375, 77, 31], [279.921875, 3148.859375, 140, 31], [202.546875, 3179.953125, 524, 31], [202.546875, 3211.046875, 217, 55], [202.546875, 3266.640625, 524, 31], [202.546875, 3297.734375, 217, 276], [202.546875, 3573.828125, 524, 31], [202.546875, 3604.921875, 217, 178], [202.546875, 3783.015625, 524, 31], [202.546875, 3814.109375, 217, 31], [202.546875, 3845.203125, 217, 31], [202.546875, 3876.296875, 524, 31], [202.546875, 3907.390625, 38, 31], [240.734375, 3907.390625, 39, 31], [279.921875, 3907.390625, 33, 31], [313.109375, 3907.390625, 64, 31], [377.296875, 3907.390625, 43, 31], [202.546875, 3938.484375, 524, 31], [202.546875, 3969.578125, 217, 31]]}, "cells": {"text": ["Notch discussed Survival among the various game modes he envisioned for the game.", "Notch discussed his vision of how Survival mode would work.", "Survival mode testing starts. At this time, there was no health bar, and resource management was being tested.", "Hearts are shown, mobs take damage when hit.", "Added Survival mode in Survival Test. During this time, death was permanent, meaning players could not respawn and the level needed to be restarted unless a save file had been created.", "A score system was implemented, where players gain more points the more mobs they kill. The player's score can only be seen when they die. Other mobs give more or less points than others: pigs give 10 points, zombies and skeletons give 100 points, and creepers give 250 points.", "Until mid-Alpha, Survival single-player was the only available mode besides Classic Creative mode.", "Crafting is introduced.", "Death is no longer permanent; the player is now able to respawn.", "Added multiplayer. Originally, Notch allowed only a limited number of people from the Minecraft IRC channel to participate in the first tests of multiplayer. These invitees could invite other people to test out this mode; however, the password was leaked and the server was quickly filled up. Notch released the first version of the multiplayer server software on the 4th of August, 2010. The client was updated so that players could enter the IP of a server to join it.", "Singleplayer was abolished in a technical sense. Instead, the player hosts a server that they can either close or open to others at any time. This change was intended to reduce the labor required to fix bugs for two different parts of Minecraft, at a slight performance cost.", "Added Survival mode.", "Crafting was introduced.", "Added Survival mode.", "Added Survival mode."], "bboxes": [[420.484375, 2483.609375, 307, 55], [420.484375, 2539.203125, 307, 55], [420.484375, 2594.796875, 307, 80], [420.484375, 2674.890625, 307, 55], [420.484375, 2730.484375, 307, 129], [420.484375, 2859.578125, 307, 178], [420.484375, 3037.671875, 307, 80], [420.484375, 3148.859375, 307, 31], [420.484375, 3211.046875, 307, 55], [420.484375, 3297.734375, 307, 276], [420.484375, 3604.921875, 307, 178], [420.484375, 3814.109375, 307, 31], [420.484375, 3845.203125, 307, 31], [420.484375, 3907.390625, 307, 31], [420.484375, 3969.578125, 307, 31]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/5/50/Survival1.17.png", "path": "images/img.png", "alt_text": "", "caption": "Survival mode in Minecraft. The health and hunger bars, as well as the hotbar, are visible in this picture.", "bbox": [552.9375, 630.5, 375, 199]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/b/b7/Crafting_Table_JE4_BE3.png", "path": "images/img (1).png", "alt_text": "", "caption": "A crafting table, required to craft most items.", "bbox": [787.9375, 1316.015625, 140, 140]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/f7/PackInventoryWindow.png", "path": "images/img (2).png", "alt_text": "", "caption": "The basic Survival mode inventory from version 1.12.", "bbox": [202.046875, 1560.515625, 180, 170]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/0/0b/Big_Cave_Entrance.png", "path": "images/img (3).png", "alt_text": "", "caption": "In caves like this, players can find many resources needed to advance in Survival mode.", "bbox": [747.9375, 1846.015625, 180, 95]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/a/a4/Midnight_survival.png", "path": "images/img (4).png", "alt_text": "", "caption": "A player building a house at night.", "bbox": [747.9375, 2198.015625, 180, 93]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/3/3b/BuildCollaboration.png", "path": "images/img (5).png", "alt_text": "", "caption": "Two players working together to build a shelter in Survival multiplayer", "bbox": [747.9375, 2348.015625, 180, 110]}], "sprites": [], "texts": [{"text": "Survival", "bbox": [202.046875, 509.5, 593, 45]}, {"text": "This article is about the game mode. For information about Survival multiplayer, see Multiplayer. For the latter part of the Classic development phase that included Survival features, see Survival Test.", "bbox": [216.046875, 574.5, 712, 49]}, {"text": "Survival is one of the game modes in Minecraft. Players must collect resources, build structures, battle mobs, eat, and explore the world in an effort to survive.", "bbox": [202.046875, 630.5, 726, 98]}, {"text": "In Bedrock Edition, players may receive achievements in a world not set to Flat while playing Survival mode with cheats off, add-ons off, and host privileges off. If a player creates a world in Creative mode and then loads it in Survival mode, the player cannot earn achievements in that world. In Minecraft Survival, the main goal is to survive, build, explore, and have fun, but also an optional goal in Survival is to defeat the ender dragon and the wither.", "bbox": [202.046875, 752.5, 726, 196]}, {"text": "Contents", "bbox": [215.046875, 988.25, 81, 17]}, {"text": "1 Gameplay\n1.1 Goals\n1.2 Survival single-player (SSP)\n1.3 Survival multiplayer (SMP)\n2 History\n3 Issues\n4 See also", "bbox": [203.046875, 1021.515625, 252, 218]}, {"text": "Gameplay", "bbox": [202.046875, 1264.015625, 726, 43]}, {"text": "In Survival, players have an inventory that consists of four rows of slots used to store items, nine of which are found on the hotbar. All blocks require a certain amount of time to break, unlike Creative mode where blocks can be instantly destroyed. These items can be used in recipes to create tools including (Pickaxe, Axe, Sword, Hoe, Shovel) and other items. The recipes can also be accessed easier by clicking the Recipe book in the bottom left corner. This process is known as crafting. Most crafting recipes require a crafting table. Some items cannot be obtained by crafting normally and require a furnace for processing (e.g. glass requires sand for smelting). Various other crafting stations exist for other uses, such as brewing, repairing, and enchanting.", "bbox": [202.046875, 1316.015625, 726, 220]}, {"text": "In Survival mode, the player is able to receive damage from the environment (fall damage, suffocation, lava, and freezing) and from hostile mobs (unless playing on Peaceful, where hostile mobs are disabled). A player who receives enough damage dies and returns to the world spawn, or to a previously slept-in bed, or in the Nether to a respawn anchor if the player set one.", "bbox": [202.046875, 1560.515625, 726, 123]}, {"text": "If cheats are enabled, a player can switch to Survival mode by using the command /gamemode survival but cannot earn achievements and advancements.", "bbox": [202.046875, 1707.015625, 726, 49]}, {"text": "Goals", "bbox": [202.046875, 1780.015625, 726, 22]}, {"text": "See also: Tutorials/Beginner's guide", "bbox": [216.046875, 1814.515625, 712, 25]}, {"text": "The player can get an \"ending\" in Survival mode by defeating the ender dragon in the End, but this does not terminate play; it provides a trophy item (a dragon egg), a large amount of experience, triggers the \"End Poem\" and unlocks a gateway to allow easier access to the outer end islands; another common goal is to fulfill all the predefined achievements (advancements in Java Edition). Oceans also invite exploration, as they have corals, monuments, and adapted creatures like guardians, fish and drowned. The player can also optionally fight the wither boss in order to obtain a nether star so that they can craft a beacon, which also completes all of the in-game achievements. A player can search for an elytra and more after finding an end city in the End.", "bbox": [202.046875, 1846.015625, 726, 220]}, {"text": "Survival single-player (SSP)", "bbox": [202.046875, 2090.515625, 726, 23]}, {"text": "Survival single-player is the default game mode of Minecraft. Single-player may be played online or offline, as long as the player has played the game at least once in order to allow the game files to be downloaded to their device.", "bbox": [202.046875, 2125.015625, 726, 49]}, {"text": "Survival multiplayer (SMP)", "bbox": [202.046875, 2198.015625, 726, 22]}, {"text": "Main article: Multiplayer", "bbox": [216.046875, 2232.515625, 712, 25]}, {"text": "Survival multiplayer allows players to connect to a central Minecraft server. This enables them to interact with each other and work together (or against each other) in order to achieve their Survival goals. This is mostly used for friends to play on a private server together.", "bbox": [202.046875, 2264.015625, 726, 98]}, {"text": "History", "bbox": [202.046875, 2386.015625, 526, 43]}, {"text": "Issues", "bbox": [202.046875, 4063.671875, 726, 43]}, {"text": "Issues relating to \"Survival\" are maintained on the bug tracker. Report issues there.", "bbox": [202.046875, 4115.671875, 726, 25]}, {"text": "See also", "bbox": [202.046875, 4164.171875, 726, 43]}, {"text": "A beginner's guide to surviving in Minecraft\nCreative\nHardcore", "bbox": [238.046875, 4216.171875, 690, 73]}, {"text": "Gameplay[show] [edit]", "bbox": [205.046875, 4310.671875, 720, 25]}]}