{"metadata": {"url": "https://minecraft.fandom.com/wiki/South-east_rule", "title": "South-east_rule", "time": "17/04/2022 01:04:27"}, "tables": [{"bbox": [202.046875, 1641.703125, 725, 247], "headers": {"text": ["Java Edition Beta", "1.6", "Test Build 3", "Java Edition", "1.0.0", "Beta 1.9 Prerelease 4"], "bboxes": [[202.546875, 1642.203125, 724, 31], [202.546875, 1673.296875, 47, 129], [249.734375, 1673.296875, 102, 129], [202.546875, 1802.390625, 724, 31], [202.546875, 1833.484375, 47, 55], [249.734375, 1833.484375, 102, 55]]}, "cells": {"text": ["Prevented dispensers from firing arrows, eggs, or snowballs through a solid block right next to the dispenser if the dispenser is facing west or south. At this time, this was known as the south-west rule, as at the time the positive X coordinate was west. This meant that any effects that now follow the south-east rule, followed the south-west rule at the time.", "Changed the south-west rule to the south-east rule, as positive X was changed from west to east."], "bboxes": [[351.953125, 1673.296875, 575, 129], [351.953125, 1833.484375, 575, 55]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/3/3e/Clock_JE3_BE3.gif", "path": "images/Clock JE3 BE3.png", "alt_text": "Clock JE3 BE3", "caption": null, "bbox": [260.53125, 455.59375, 32, 32]}], "sprites": [], "texts": [{"text": "South-east rule", "bbox": [202.046875, 349.5, 593, 45]}, {"text": "The south-east rule, also known as the Z-X rule, is an unintentional mechanic in Minecraft wherein various effects occur based on the cardinal directions, specifically in a south-east variant.", "bbox": [202.046875, 539.6875, 726, 49]}, {"text": "Contents", "bbox": [215.046875, 628.4375, 81, 17]}, {"text": "1 Effects\n2 Model/Texture orientation\n3 History\n4 See also", "bbox": [203.046875, 661.703125, 217, 132]}, {"text": "Effects", "bbox": [202.046875, 818.703125, 726, 43]}, {"text": "The following list contains effects that happen in Minecraft, relating to the south, east, or south-east cardinal directions, including:", "bbox": [202.046875, 870.703125, 726, 49]}, {"text": "Rails curve south or east when they are initially placed at a \"T\" intersection or a \"+\" intersection. They also curve away from the south or east when powered.\nAn exception to this is if there is an intersection on a downhill rail track, the minecart continues on the downhill track, even if the south-east rule applies. (see Rail#Downhill rule)\nAny mobs that are spawned by spawn eggs, /summon, monster spawners, the player, or by breeding, always appear to be facing the southern direction initially.\nTNT cannons tend to fire farther when facing east or south.\nMany bugs cause problems relating to south and east, such as villagers trying to cram into the house that is mostly in the southern-eastern area of the village.\nWhen the player is exactly inside the middle of a block, they are pushed out of the block north-east.\n2×2 trees are unable to grow, if north, west or northwest diagonal block is occupied up to the final height of the tree.\nWhen the player first spawns into the world, they spawn facing south.", "bbox": [238.046875, 943.703125, 690, 343]}, {"text": "Model/Texture orientation", "bbox": [202.046875, 1310.203125, 726, 43]}, {"text": "Blocks can be split into 3 categories based on the model behavior.", "bbox": [202.046875, 1362.203125, 726, 24]}, {"text": "Always the same way (only has 1 orientation, no other facing version exists); for example, cobblestone, planks, bookshelf, obsidian, ores, etc.\nThe texture orientation is based on the location of the block, not dependent on the placing direction (dirt, grass blocks)\nBased on the mode of placing, it uses a certain predictable orientation/block state (glazed terracotta, furnace, piston, logs)", "bbox": [238.046875, 1410.703125, 690, 147]}, {"text": "History", "bbox": [202.046875, 1575.703125, 726, 43]}, {"text": "See also", "bbox": [202.046875, 1921.578125, 726, 43]}, {"text": "Coordinates\nCompass\nDebug screen", "bbox": [238.046875, 1973.578125, 690, 74]}, {"text": "Gameplay[show] [edit]", "bbox": [205.046875, 2068.078125, 720, 25]}]}