{"metadata": {"url": "https://minecraft.fandom.com/wiki/Weapon", "title": "Weapon", "time": "17/04/2022 01:16:17"}, "tables": [], "images": [], "sprites": [{"text": "Sword", "bbox": [238.046875, 693, 16, 16]}, {"text": null, "bbox": [828.046875, 766.5, 16, 16]}, {"text": "Axe", "bbox": [238.046875, 833.5, 16, 16]}, {"text": "shield", "bbox": [238.046875, 931.5, 16, 16]}, {"text": "Trident", "bbox": [238.046875, 998.5, 16, 16]}, {"text": "netherite sword", "bbox": [613.046875, 1023, 16, 16]}, {"text": "netherite sword", "bbox": [631.046875, 1047.5, 16, 16]}, {"text": "Hoe", "bbox": [338.046875, 1163.5, 16, 16]}, {"text": "Pickaxe", "bbox": [397.40625, 1163.5, 16, 16]}, {"text": "Shovel", "bbox": [508.765625, 1163.5, 16, 16]}, {"text": "Bow", "bbox": [238.046875, 1404, 16, 16]}, {"text": "arrow", "bbox": [603.40625, 1404, 16, 16]}, {"text": "Crossbow", "bbox": [238.046875, 1495.5, 16, 16]}, {"text": "Firework Rocket", "bbox": [509.046875, 1544.5, 16, 16]}, {"text": "Fireball", "bbox": [238.046875, 1636, 16, 16]}, {"text": "Dispenser", "bbox": [651.40625, 1636, 16, 16]}, {"text": "Ghast", "bbox": [830.765625, 1636, 16, 16]}, {"text": "Blaze", "bbox": [238.046875, 1660.5, 16, 16]}, {"text": "Ender Dragon", "bbox": [452.046875, 1685, 16, 16]}, {"text": "dragon fireball", "bbox": [702.40625, 1685, 16, 16]}, {"text": "lingering potion of harming", "bbox": [603.046875, 1709.5, 16, 16]}, {"text": "glass bottle", "bbox": [513.046875, 1734, 16, 16]}, {"text": "dragon's breath", "bbox": [649.40625, 1734, 16, 16]}, {"text": "Splash Potion", "bbox": [238.046875, 1776.5, 16, 16]}, {"text": "Lingering Potion", "bbox": [359.40625, 1776.5, 16, 16]}, {"text": "Tipped Arrow", "bbox": [511.765625, 1776.5, 16, 16]}, {"text": "Instant Damage", "bbox": [682.125, 1776.5, 18, 18]}, {"text": "Poison", "bbox": [812.484375, 1776.5, 18, 18]}, {"text": "Wither", "bbox": [238.046875, 1801, 18, 18]}, {"text": "Weakness", "bbox": [238.046875, 1825.5, 18, 18]}, {"text": "Slowness", "bbox": [330.40625, 1825.5, 18, 18]}, {"text": "Slow Falling", "bbox": [446.765625, 1825.5, 18, 18]}, {"text": "Snowball", "bbox": [238.046875, 1868, 16, 16]}, {"text": "Egg", "bbox": [353.40625, 1868, 16, 16]}, {"text": "armor", "bbox": [671.765625, 1868, 16, 16]}, {"text": null, "bbox": [458.046875, 1892.5, 16, 16]}, {"text": "Ender Pearl", "bbox": [655.046875, 1892.5, 16, 16]}, {"text": "End Crystal", "bbox": [238.046875, 2084.5, 16, 16]}, {"text": "Respawn Anchor", "bbox": [367.40625, 2084.5, 16, 16]}, {"text": "Cobweb", "bbox": [238.046875, 2133.5, 16, 16]}, {"text": "Flint and Steel", "bbox": [238.046875, 2158, 16, 16]}, {"text": "Fire Charge", "bbox": [385.40625, 2158, 16, 16]}, {"text": "Lava Bucket", "bbox": [250.046875, 2182.5, 16, 16]}, {"text": "Water Bucket", "bbox": [708.046875, 2207, 16, 16]}, {"text": "Obsidian", "bbox": [292.046875, 2231.5, 16, 16]}, {"text": "TNT", "bbox": [238.046875, 2256, 16, 16]}, {"text": "TNT Minecart", "bbox": [713.046875, 2280.5, 16, 16]}, {"text": "Creeper", "bbox": [824.40625, 2280.5, 16, 16]}, {"text": "Bed", "bbox": [238.046875, 2305, 16, 16]}, {"text": "Redstone", "bbox": [238.046875, 2378.5, 16, 16]}, {"text": "Cactus", "bbox": [444.046875, 2476.5, 16, 16]}, {"text": "Sweet Berry Bush", "bbox": [534.40625, 2476.5, 16, 16]}, {"text": "Wither Rose", "bbox": [686.765625, 2476.5, 16, 16]}, {"text": "Campfire", "bbox": [800.125, 2476.5, 16, 16]}, {"text": "Magma Block", "bbox": [238.046875, 2501, 16, 16]}], "texts": [{"text": "Weapon", "bbox": [202.046875, 347, 593, 45]}, {"text": "For the feature in Minecraft Dungeons, see MCD:Weapon.", "bbox": [216.046875, 412, 712, 25]}, {"text": "Weapons are items that can be used to damage entities. They can take the form of a sword, bow, or various other items capable of dealing damage. They can also be enchanted to deal more damage or add other benefits.", "bbox": [202.046875, 443.5, 726, 49]}, {"text": "There are various types of weapons:", "bbox": [202.046875, 516.5, 726, 24]}, {"text": "Melee weapons", "bbox": [202.046875, 565, 726, 43]}, {"text": "Melee weapons can be held while punching to deal extra damage, but with a longer attack time than punching. (attack time is a cooldown time for a weapon)", "bbox": [202.046875, 617, 726, 49]}, {"text": "Swords are generally the most effective melee weapon, due to their high damage per second‌[Java Edition only] compared to other weapons. All swords have a cooldown time of 0.6 seconds, 60% faster than axes.‌[Java Edition only] Swords are the only weapon type that can do sweep attacks to hit multiple targets. In Bedrock Edition, they deal more damage than any other melee weapon except for tridents. ‌[Bedrock Edition only]", "bbox": [238.046875, 690, 690, 123]}, {"text": "Axes in Java Edition deal more damage per hit than their sword counterparts, but have a slower cooldown. Wooden and stone axes have a cooldown time of 1.2 seconds, 80% slower than swords. Iron axes have a cooldown time of 1.1 seconds, 70% slower than swords. Golden, diamond, and netherite axes have a cooldown time of 1 second, 60% slower than swords. Axes are the only weapon type that can disable a shield, which can be lengthened with Cleaving‌[upcoming: JE Combat Tests]. In Bedrock Edition, axes deal one less damage than their sword counterparts.", "bbox": [238.046875, 830.5, 690, 147]}, {"text": "Tridents can be swung, dealing the same damage as an unenchanted stone, iron, or diamond axe‌[Java Edition only] or the same damage as an unenchanted netherite sword ‌[Bedrock Edition only], and when thrown they always do the same damage as an unenchanted netherite sword. They have 10% faster attack speed than golden, diamond, and netherite axes‌[Java Edition only], being 0.9 seconds. Unlike most other projectiles, they are not slowed down in water, but a thrown trident must be retrieved, unless enchanted with Loyalty.", "bbox": [238.046875, 995.5, 690, 147]}, {"text": "Other tools, like Hoes, Pickaxes, and Shovels can be used as weapons, but they are not as effective as other melee weapons.", "bbox": [238.046875, 1160.5, 690, 49]}, {"text": "Swords and Tridents use one durability point per hit, while Axes, Pickaxes, Hoes and Shovels use two.", "bbox": [238.046875, 1227.5, 690, 24]}, {"text": "Ranged weapons", "bbox": [202.046875, 1276, 726, 43]}, {"text": "Ranged weapons are not as effective in close combat, but they are effective at attacking enemies from a distance.", "bbox": [202.046875, 1328, 726, 49]}, {"text": "Bows are the most common ranged weapon, shooting arrows at enemies to deal damage. Bows have a charge up mechanic, similar to melee weapons, and arrows go the farthest and deal the most damage when shot from a fully charged bow.", "bbox": [238.046875, 1401, 690, 74]}, {"text": "Crossbows have a longer range than bows, and deal more damage, but take longer to charge when unenchanted. The charging time can be drastically reduced with the Quick Charge enchantment to charge far faster than a bow. They can also shoot Firework Rockets to deal splash damage, but unlike the bow, crossbows cannot fire a partially charged attack; the player must fully charge a crossbow to load it and fire. Furthermore, a crossbow can be charged and put away to be fired later.", "bbox": [238.046875, 1492.5, 690, 122]}, {"text": "Fireballs cannot be launched by a player, but can be fired by a Dispenser or shot from a Ghast or Blaze to explode and set its surroundings on fire upon impact. Ghast fireballs can also be used to damage terrain, but can be deflected. The Ender Dragon uses a special type of dragon fireball that is purple and releases a purple lingering effect cloud similar to that of a lingering potion of harming when it explodes. This particle cloud can be collected using a glass bottle to get dragon's breath.", "bbox": [238.046875, 1633, 690, 123]}, {"text": "Splash Potions, Lingering Potions, or Tipped Arrows with the Instant Damage, Poison, or Wither‌[Bedrock Edition only] status effects can be effectively used to damage enemies. Other effects like Weakness, Slowness, and Slow Falling can be used to significantly hinder an opponent in a fight.", "bbox": [238.046875, 1773.5, 690, 73]}, {"text": "Snowballs and Eggs do not deal any damage, but can damage armor and deal knockback,‌[BE only]‌[upcoming: JE Combat Tests] and unlike a bow, can be thrown quickly. Ender Pearls can be used, but it teleports the player to the entity.", "bbox": [238.046875, 1865, 690, 74]}, {"text": "Other weapons", "bbox": [202.046875, 1956.5, 726, 43]}, {"text": "Other items listed below can be used as weapons but usually have other intended uses and should be used strategically.", "bbox": [202.046875, 2008.5, 726, 49]}, {"text": "End Crystals and Respawn Anchors can be used to deal excessive explosive damage to targets in quick succession.\nCobwebs can be used to drastically slow the move speed of targets.\nFlint and Steels and Fire Charges can be used to set the ground on fire and damage enemies.\nA Lava Bucket can deal serious damage to enemies and significantly slow them down, but it requires strategic placing. In certain situations, it can be used in conjunction with a Water Bucket to suffocate the entity in Obsidian.\nTNT is an effective weapon against enemies, whether planted and ignited on the spot or buried beforehand and activated in a chase. The player can substitute this with a TNT Minecart, Creeper, or a Bed when used outside of the Overworld.\nHostile mobs can be used as weapons when used strategically, but this can be hard to set up due to the fact that these mobs also attempt to attack the player.\nRedstone traps can be used to kill the entity with all sorts of environmental damage, ranging from fall damage to suffocation to anything in between, but these must be prepared beforehand.\nAnvils can be used to damage mobs and players, at the cost of damaging the anvil.\nCertain blocks cause damage on contact, and can be used as barriers to mobs and players without the ability to break blocks. These include a Cactus, an Sweet Berry Bush, a Wither Rose, a Campfire and Magma Block (if the target isn't sneaking or wearing frost walker boots).", "bbox": [238.046875, 2081.5, 690, 441]}]}