{"metadata": {"url": "https://minecraft.fandom.com/wiki/Wii_U_Edition_Patch_3", "title": "Wii_U_Edition_Patch_3", "time": "17/04/2022 04:15:56"}, "tables": [{"bbox": [624.9375, 455.96875, 300, 126], "headers": {"text": ["Edition", "Release date", "Downloads"], "bboxes": [[625.9375, 456.96875, 132, 30], [625.9375, 488, 132, 30], [625.9375, 519.03125, 132, 30]]}, "cells": {"text": ["Wii U Edition", "February 26, 2016", "3 Download", "◄ Patch 2 Patch 4 ►"], "bboxes": [[759.421875, 456.96875, 165, 30], [759.421875, 488, 165, 30], [759.421875, 519.03125, 165, 30], [625.9375, 550.0625, 298, 30]]}}, {"bbox": [202.046875, 10910.515625, 726, 270], "headers": {"text": ["[hide]\nMinecraft: Wii U Edition versions", "[hide]\nWii U Edition", "Patch x", "Patch 1x", "Patch 2x", "Patch 3x", "Patch 4x", "🎮 Legacy Console Edition version history"], "bboxes": [[205.046875, 10913.515625, 720, 27], [205.046875, 10942.46875, 720, 27], [205.046875, 10971.421875, 83, 25], [205.046875, 10997.921875, 83, 49], [205.046875, 11048.921875, 83, 25], [205.046875, 11075.421875, 83, 49], [205.046875, 11126.421875, 83, 25], [205.046875, 11152.921875, 720, 25]]}, "cells": {"text": ["[hide]\nWii U Edition\nPatch x Patch 1 Patch 2 Patch 3 Patch 4 Patch 5 Patch 6 Patch 7 Patch 8 Patch 9\nPatch 1x Patch 10 Patch 11 Patch 12 Patch 13 Patch 14 Patch 15 Patch 16 Patch 17 Patch 18 Patch 19\nPatch 2x Patch 20 Patch 21 Patch 23 Patch 24 Patch 25 Patch 26 Patch 27 Patch 28 Patch 29\nPatch 3x Patch 30 Patch 31 Patch 32 Patch 33 Patch 34 Patch 35 Patch 36 Patch 37 Patch 38 Patch 39\nPatch 4x Patch 40 Patch 41 Patch 42 Patch 43", "Patch 1 Patch 2 Patch 3 Patch 4 Patch 5 Patch 6 Patch 7 Patch 8 Patch 9", "Patch 10 Patch 11 Patch 12 Patch 13 Patch 14 Patch 15 Patch 16 Patch 17 Patch 18 Patch 19", "Patch 20 Patch 21 Patch 23 Patch 24 Patch 25 Patch 26 Patch 27 Patch 28 Patch 29", "Patch 30 Patch 31 Patch 32 Patch 33 Patch 34 Patch 35 Patch 36 Patch 37 Patch 38 Patch 39", "Patch 40 Patch 41 Patch 42 Patch 43"], "bboxes": [[205.046875, 10942.46875, 720, 208], [290.046875, 10971.421875, 635, 25], [290.046875, 10997.921875, 635, 49], [290.046875, 11048.921875, 635, 25], [290.046875, 11075.421875, 635, 49], [290.046875, 11126.421875, 635, 25]]}}, {"bbox": [203.046875, 10940.46875, 724, 212], "headers": {"text": ["[hide]\nWii U Edition", "Patch x", "Patch 1x", "Patch 2x", "Patch 3x", "Patch 4x"], "bboxes": [[205.046875, 10942.46875, 720, 27], [205.046875, 10971.421875, 83, 25], [205.046875, 10997.921875, 83, 49], [205.046875, 11048.921875, 83, 25], [205.046875, 11075.421875, 83, 49], [205.046875, 11126.421875, 83, 25]]}, "cells": {"text": ["Patch 1 Patch 2 Patch 3 Patch 4 Patch 5 Patch 6 Patch 7 Patch 8 Patch 9", "Patch 10 Patch 11 Patch 12 Patch 13 Patch 14 Patch 15 Patch 16 Patch 17 Patch 18 Patch 19", "Patch 20 Patch 21 Patch 23 Patch 24 Patch 25 Patch 26 Patch 27 Patch 28 Patch 29", "Patch 30 Patch 31 Patch 32 Patch 33 Patch 34 Patch 35 Patch 36 Patch 37 Patch 38 Patch 39", "Patch 40 Patch 41 Patch 42 Patch 43"], "bboxes": [[290.046875, 10971.421875, 635, 25], [290.046875, 10997.921875, 635, 49], [290.046875, 11048.921875, 635, 25], [290.046875, 11075.421875, 635, 49], [290.046875, 11126.421875, 635, 25]]}}], "images": [{"src": "https://static.wikia.nocookie.net/ucp-internal-test-starter-commons/images/7/7e/WiiU.svg", "path": "images/WiiU.png", "alt_text": "WiiU", "caption": null, "bbox": [481.390625, 10953.96875, 16, 5]}], "sprites": [], "texts": [{"text": "Wii U Edition Patch 3", "bbox": [202.046875, 349.5, 593, 45]}, {"text": "Patch 3 was a version of Wii U Edition released on February 26, 2016.[1] This version is equivalent to Java Edition 1.8, adding content from the Bountiful Update. [edit]", "bbox": [202.046875, 414.5, 726, 74]}, {"text": "Contents", "bbox": [215.046875, 576.25, 81, 17]}, {"text": "1 Additions\n1.1 Blocks\n1.2 Items\n1.3 Mobs\n1.4 World generation\n1.5 Gameplay\n1.6 General\n2 Changes\n2.1 Blocks\n2.2 Items\n2.3 Mobs\n2.4 World generation\n2.5 Gameplay\n2.6 General\n3 Fixes\n4 See also\n5 References", "bbox": [203.046875, 609.515625, 183, 503]}, {"text": "Additions", "bbox": [202.046875, 1137.015625, 726, 43]}, {"text": "Blocks", "bbox": [202.046875, 1204.015625, 726, 22]}, {"text": "Added podzol, granite, polished granite, andesite, polished andesite, diorite, polished diorite, prismarine, dark prismarine, prismarine bricks, red sand, red sandstone, smooth red sandstone, chiseled red sandstone, red sandstone stairs, sea lanterns, wet sponge, slime blocks, coarse dirt, packed ice, acacia saplings, dark oak saplings.", "bbox": [238.046875, 1238.515625, 690, 98]}, {"text": "Items", "bbox": [202.046875, 1360.515625, 726, 23]}, {"text": "Added armor stand, raw rabbit, cooked rabbit, rabbit stew, raw mutton, cooked mutton, rabbit's foot, rabbit hide, potion of leaping, potion of water breathing, salmon, cooked salmon, clownfish, pufferfish, blue orchid, allium, azure bluet, tulips, oxeye daisy, sunflower, lilac, poppy (replaces rose), rose bush, peony, double tall grass, large ferns, prismarine crystals, prismarine shard.\nSpawn eggs in creative mode for rabbits, endermites and guardians.", "bbox": [238.046875, 1395.015625, 690, 122]}, {"text": "Mobs", "bbox": [202.046875, 1541.515625, 726, 23]}, {"text": "Endermite, guardian, elder guardian, rabbit, chicken jockey.\nRabbits have the changes that was ported to Java Edition 1.9.[more information needed]", "bbox": [238.046875, 1576.015625, 690, 49]}, {"text": "World generation", "bbox": [202.046875, 1649.015625, 726, 22]}, {"text": "Structures", "bbox": [202.046875, 1683.515625, 726, 25]}, {"text": "Added ocean monuments", "bbox": [238.046875, 1714.015625, 690, 24]}, {"text": "Biomes", "bbox": [202.046875, 1756.515625, 726, 25]}, {"text": "Added Mesa, Mega Taiga, Roofed Forest, Birch Forest, Forest, Savanna, Extreme Hills+, Deep Ocean, Snowless Taiga, and 20 new technical biomes.", "bbox": [238.046875, 1787.015625, 690, 49]}, {"text": "Gameplay", "bbox": [202.046875, 1860.015625, 726, 22]}, {"text": "Enchantments", "bbox": [202.046875, 1894.515625, 726, 25]}, {"text": "Luck of the Sea, Lure, Depth Strider", "bbox": [238.046875, 1925.015625, 690, 24]}, {"text": "General", "bbox": [202.046875, 1973.515625, 726, 23]}, {"text": "Tutorial", "bbox": [202.046875, 2008.015625, 726, 24]}, {"text": "Created a new tutorial world.", "bbox": [238.046875, 2038.515625, 690, 25]}, {"text": "Skin packs", "bbox": [202.046875, 2081.015625, 726, 24]}, {"text": "Added Biome Settlers Skin Pack 1.", "bbox": [238.046875, 2111.515625, 690, 25]}, {"text": "Changes", "bbox": [202.046875, 2160.015625, 726, 43]}, {"text": "Blocks", "bbox": [202.046875, 2227.015625, 726, 22]}, {"text": "Dispensers can place pumpkins or wither skeleton skulls to spawn iron golems, snow golems and withers, provided the body is built in a valid configuration.\nAnvil repairing has been rebalanced.\nMoss stone, mossy stone bricks and chiseled stone bricks are now obtainable via crafting.\nCracked stone bricks and sponges are now obtainable via smelting.\nWhen a furnace runs out of fuel, the smelting progress will rewind at 2× speed.\nEmpty furnaces will only accept fuel and empty buckets in the fuel slot.\nItem frames now emit a redstone signal and can rotate in 8 directions.\nRedstone comparators can now detect the rotation of an item in an item frame and output an equivalent power signal.\nButtons can now be placed on the top and bottom of blocks.\nPowered activator rails now dismount entities riding minecarts.\nCauldrons with water in them will put out burning entities, taking away one water level each time.\nWhen harvested with Silk Touch enchantment, huge mushrooms now drop blocks with corresponding mushroom texture (red or brown) on all sides, rather than the one with spores.\nSponges are now obtainable in survival mode and now soak up contiguous water source blocks out to a taxicab distance of 5 when placed, thereupon turning into a new wet sponge.\nSugar cane color is affected by the biome color (similar to leaves, grass and vines).\nMonster Spawners can now have the mob they spawn change by placing the corresponding spawn egg", "bbox": [238.046875, 2261.515625, 690, 466]}, {"text": "Items", "bbox": [202.046875, 2751.015625, 726, 22]}, {"text": "Added flint and steel and fire charge sound effect when igniting blocks.\nArrows decelerate much more quickly underwater and extinguish if on fire.\nUpdated audio for minecarts.", "bbox": [238.046875, 2785.515625, 690, 74]}, {"text": "Mobs", "bbox": [202.046875, 2883.015625, 726, 22]}, {"text": "Most mobs can now swim.\nSkeletons and rabbits now flee from wolves.\nCreepers, skeletons, wither skeletons and zombies drop their heads when killed by charged creepers.\nSpiders no longer see players through solid blocks.\nBabies' growth can be accelerated by feeding them.\nBaby zombies now drop experience.\nCreepers can now be ignited with flint and steel.\nAdult zombie pigmen will forgive after a short time (and lose the aggro speed boost), but will continue to attack until the player escapes their aggro distance.\nWitches can now drink and drop potions of water breathing.\nSheep now drop mutton when they die.\nUpdated sounds for cows and mooshrooms.\nVillagers have additional professions and trades, will now harvest crops if they are farmers, will only breed when willing and will turn into witches when struck by lightning.", "bbox": [238.046875, 2917.515625, 690, 343]}, {"text": "World generation", "bbox": [202.046875, 3284.515625, 726, 23]}, {"text": "Melons can now be found in jungle biomes similar to pumpkins.\nSwamp biomes now spawn with blue orchid flowers and the coast is covered in staggered dirt block with lily pads between them.\nPlains biomes now generate with azure bluets, oxeye daises, tulips and double tall grass.\nExtreme hills biomes now have snow at higher elevations, gravel, flat valleys near sea level and are slightly higher.\nOcean biomes contains only gravel on the floor instead of sand, dirt and gravel.\nDesert temples now spawn with stained clay instead of dyed wool.", "bbox": [238.046875, 3319.015625, 690, 196]}, {"text": "Gameplay", "bbox": [202.046875, 3539.015625, 726, 22]}, {"text": "Fishing", "bbox": [202.046875, 3573.515625, 726, 25]}, {"text": "Now has particle effects - bubbles will show up moving towards the bobber just before the player has something on the hook. This has the appearance of a fish swimming towards the hook.\nNew items can be caught from fishing\nTreasure: enchanted fishing rod, enchanted bow, enchanted book, name tag, tripwire hook, lily pad and saddle.\nJunk: damaged fishing rod, water bottle, rotten flesh, string, leather, bowl, stick, bone, tripwire hook, ink sac and damaged leather boots.", "bbox": [238.046875, 3604.015625, 690, 177]}, {"text": "Enchanting", "bbox": [202.046875, 3799.515625, 726, 25]}, {"text": "Now consumes lapis lazuli and has been rebalanced.\nEnchanted books can receive multiple enchants at once.", "bbox": [238.046875, 3830.015625, 690, 49]}, {"text": "General", "bbox": [202.046875, 3903.015625, 726, 22]}, {"text": "Nether portals", "bbox": [202.046875, 3937.515625, 726, 25]}, {"text": "New nether portal building rules: any rectangular shape from 4×5 to 23×23.\nIf the portal in the nether is big enough, ghasts can travel through.\nWill now be activated by any fire block within the frame.", "bbox": [238.046875, 3968.015625, 690, 73]}, {"text": "Fixes", "bbox": [202.046875, 4059.515625, 726, 43]}, {"text": "This version combines fixes from several other console versions", "bbox": [202.046875, 4111.515625, 726, 25]}, {"text": "113 issues fixed", "bbox": [202.046875, 4184.515625, 726, 25]}, {"text": "MCCE-48 – Water Spreading Creates New Source Blocks.\nMCCE-571 – Interface Opacity and Tooltip Opacity issues on PS Vita.\nMCCE-772 – Animals get stuck in corners of fence-type blocks.\nMCCE-817 – Map walls are broken since CU19 on Xbox One.\nMCCE-826 – Beacon height limit.\nMCCE-829 – The end build limit is smaller.\nMCCE-831 – Player skin is the default skin when holding a map.\nMCCE-833 – When Interface opacity is down, hotbar faded tools will not show their durability.\nMCCE-856 – Red sandstone stairs texture incorrect.\nMCCE-863 – The map does not work as it should unless \"View Hand\" is turned on.\nMCCE-865 – Rabbits only appear to spawn naturally in snow biomes.\nMCCE-878 – Book and quill saving issue: opening and closing an edited (not signed) writeable book deletes the saved pages.\nMCCE-885 – Feather Falling enchantment does not reduce fall or ender pearl damage.\nMCCE-886 – Feather Falling IV not working\nMCCE-962 – Increase to slime spawning.\nMCCE-1009 – Skulls in the inventory and held in first person are oversized.\nMCCE-1024 – Raw fish and raw salmon have the same texture in the Natural Texture Pack.\nMCCE-1072 – In the City Texture Pack it shows smooth red sandstone as a rough block but when you place it, it is smooth.\nMCCE-1091 – Some fire caused by ghast's fireball explosion is not displayed.\nMCCE-1127 – Wolfs default collar color had changed from orange to red.\nMCCE-1142 – Minecraft Capes using incorrect texture.\nMCCE-1192 – Texture under the bed is the texture of the top of the bed.\nMCCE-1202 – Map dark when facing north or south.\nMCCE-1214 – Texture of any potion turns black while holding it in the End or Nether.\nMCCE-1349 – Penned animals de-spawn when leaving the chunk.\nMCCE-1366 – When placing a torch under water to reset / refill the air meter will often cause a crash.\nMCCE-1367 – Melon farm with piston causes crash.\nMCCE-1403 – Hunger meter always regenerates when switching from peaceful to any other difficulty.\nMCCE-1415 – Hunger meter depletion glitch\nMCCE-1434 – Fishing rod bobber sticks to walls.\nMCCE-1455 – Piston/slime block duplication.\nMCCE-1457 – TNT can destroy blocks placed well beyond the world border.\nMCCE-1476 – Skin Pack 6: Faith Connors' Mirror's Edge Skin first person view bugged on Xbox 360.\nMCCE-1488 – 'Getting an Upgrade' trophy/achievement fails to unlock while crafting a stone pickaxe using classic crafting.", "bbox": [238.046875, 4215.015625, 690, 906]}, {"text": "Fix for crash when ender chest is mined for a few seconds.\nFix for an intermittent crash when placing beds on snow.\nFix for a crash when a Superflat world session with a combination of multiple planks or wood, lava and air layers is saved.\nFix for a crash after destroying blocks and exploring a Superflat world with multiple sand, air and TNT Layers.\nImproved random seed generator to select worlds with a better spread of biomes.\nFix for Villagers not harvesting crops from farmland created by the player.\nFix for glass not being able to be broken by hand in Adventure mode.\nFix for an issue where the user renames a 'Spawn Egg' and places it in water, causing debug text to be displayed.\nFix for an issue when the \"Body Guard\" trophy/achievement does not unlock as expected when the iron golem is built in a certain way.\nFix for an issue where a player cannot see other players after dying and respawning.\nFix for an issue where baby horses appear to be adults after feeding with one golden carrot.\nFix for issue where two primary powers can be applied to the player's character through the beacon UI.\nFix for an issue where a Torch and a Redstone Torch have two hitboxes.\nFix for de-spawn protections not being applied to baby animals created with Spawn Eggs.\nFix for issue where item quantity for bottle o' enchanting, nether star, enchanted golden apple and strength indicator for potions are not affected by Interface Opacity when in Quick Select.\nFix for death message with incorrect text is displayed when the player is killed with a named weapon.\nFix for worlds generating slightly differently every time even with the same seed.\nFix for issue where leather clothes, spawn eggs and potions are displayed improperly when the player is above 256 blocks or is in a place where there is no source of daylight.\nFix for Doors, Trapdoors and Fence Gates missing a sound effect when closing.\nFix for issue where opening certain menus does not cancel the eating, drinking or bow charging animations.\nFixed an issue where items that have no custom names were not showing up in edit text field in the Anvil.\nFix for ocelots not sprinting away from the player.\nFix for pistons and objects pushed by them having corrupted, black textures while animating.\nFix for falling gravel, Sand and Red Sand blocks displaying with very dark textures.\nFix for issue where texture pack changes to vanilla Minecraft textures if the player joins a friend's session.\nAdded first person rendering of additional skin parts for the left and right arms.\nFix for an issue when in a split-screen session where at least one player does not get critical hit particles.\nFix for seeing through the base of falling blocks.\nFix for missing mining animation for skulls, heads, signs, chests and beacons.\nFix for issue where changing the Interface Opacity to specific values causes visual issues with the item and button icons on the HUD.\nFix for issue when traveling directly north or south in a minecart where the player automatically turns to face eastwards.\nFix for missing tooltip for 'Exit' / 'Dismount' actions.\nFix for guardians not being spawned around ocean monuments on a Superflat world.\nFix for city Texture Pack missing textures for multiple kinds of doors while holding in the player's hand\nFix for sign text not displaying.\nFix for cows needing to take 11 hits with hand or 3 hits with any Sword to be killed.\nFix for clownfish description displaying incorrect information.\nFix to update the sponge texture.\nFix for the tutorial message about boats shows the wrong button prompt for exiting the boat.\nFix to allow saves that had been well explored to save player state again.\nFix for Golden Apple's regeneration animation not being smooth.\nFix for issues using certain symbols while renaming items on the Anvil.\nFixed an issue unlocking the 'Iron Belly' trophy.\nFix for 'Acquire Hardware' achievement not unlocking when an ingot is removed by the Quick Move button.\nFix for 'Delicious Fish' achievement being able to be be unlocked without cooking a Raw Fish.\nFix for a crash when adding a Split-screen Client on the host's console while the game player slots are full.", "bbox": [238.046875, 5139.515625, 690, 1299]}, {"text": "29 issues fixed", "bbox": [202.046875, 6504.515625, 726, 25]}, {"text": "MCCE-11 – Tall building glitch\nMCCE-29 – Cloud sync fails\nMCCE-61 – Heart misplace\nMCCE-64 – Falling sand bug\nMCCE-85 – Jukebox: \"Now playing: Music Disc\" never disappears\nMCCE-89 – Lead animation incorrect when horse is tied to post\nMCCE-181 – Inventory and world save were at different points\nMCCE-216 – No Minecart Sound\nMCCE-237 – Beacon Beam working incorrectly.\nMCCE-245 – Hoppers always enabled with redstone deactivation.\nMCCE-298 – Faliure to load:' Already Playing Game'\nMCCE-390 – Title lags or crashes when creating a superflat world with many layers of degrading grass or mycelium tiles.\nMCCE-420 – Doors do not stack correctly (should stack up to 64)\nMCCE-438 – Double Piston Extenders Broken\nMCCE-466 – Water flickers/change colors at distance with Natural Texture Pack\nMCCE-486 – When ending regeneration while health display is bouncing, it stops on a certain frame of the bounce\nMCCE-494 – Sign hitbox flicker\nMCCE-555 – No sound when walking on grass\nMCCE-564 – Horses not spawning\nMCCE-598 – Lag when looking in some parts of world\nMCCE-607 – Netherack fence connects to wood fence\nMCCE-653 – Game mode slider broken\nMCCE-656 – Survival bug\nMCCE-667 – Bug when switching game mode\nMCCE-668 – Switching gamemode in game does not switch completely\nMCCE-670 – Worlds do not show Creative menu\nMCCE-685 – Switching between game mode causes game to go crazy\nMCCE-734 – Wood and nether brick fences connect\nMCCE-762 – Iron golems not working", "bbox": [238.046875, 6535.015625, 690, 759]}, {"text": "18 issues fixed", "bbox": [202.046875, 7361.015625, 726, 24]}, {"text": "MCCE-499 – Ocelots Spawning endless\nMCCE-635 – Chest Quick Move\nMCCE-689 – Gamemode switch does not work from host options\nMCCE-690 – Weird Knockback\nMCCE-712 – Rotten flesh is called Rådden fisk in danish\nMCCE-786 – Single users saves being deleted while others aren't.\nMCCE-819 – When I save it doesn't always save/the autosave feature does not work\nMCCE-863 – The map does not work as it should (unless \"View Hand\" is turned on)\nMCCE-1005 – Name tags freeze console\nMCCE-1026 – Stuck in sign unable to type, exit sign or even dashboard\nMCCE-1569 – Oak and Iron Doors Items have wrong texture In the Inventory\nMCCE-1691 – Slimes Are Spawning in Witch huts\nMCCE-1695 – Slime chunk in the End\nMCCE-1698 – slime spawn in witch hut\nMCCE-1706 – slimes are spawning in the nether\nMCCE-1758 – There are slimes sapwning in the Nether\nFix for animals in love mode lacking heart particles for the duration of Love Mode.\nFix for slimes spawning in the Nether.", "bbox": [238.046875, 7391.515625, 690, 441]}, {"text": "113 issues fixed", "bbox": [202.046875, 7899.015625, 726, 24]}, {"text": "MCCE-48 – Water Spreading Creates New Source Blocks.\nMCCE-571 – Interface Opacity and Tooltip Opacity issues on PS Vita.\nMCCE-772 – Animals get stuck in corners of fence-type blocks.\nMCCE-817 – Map walls are broken since CU19 on Xbox One.\nMCCE-826 – Beacon height limit.\nMCCE-829 – The end build limit is smaller.\nMCCE-831 – Player skin is the default skin when holding a map.\nMCCE-833 – When Interface opacity is down, hotbar faded tools will not show their durability.\nMCCE-856 – Red sandstone stairs texture incorrect.\nMCCE-863 – The map does not work as it should unless \"View Hand\" is turned on.\nMCCE-865 – Rabbits only appear to spawn naturally in snow biomes.\nMCCE-878 – Book and quill saving issue: opening and closing an edited (not signed) writeable book deletes the saved pages.\nMCCE-885 – Feather Falling enchantment does not reduce fall or ender pearl damage.\nMCCE-886 – Feather Falling IV not working\nMCCE-962 – Increase to slime spawning.\nMCCE-1009 – Skulls in the inventory and held in first person are oversized.\nMCCE-1024 – Raw fish and raw salmon have the same texture in the Natural Texture Pack.\nMCCE-1072 – In the City Texture Pack it shows smooth red sandstone as a rough block but when you place it, it is smooth.\nMCCE-1091 – Some fire caused by ghast's fireball explosion is not displayed.\nMCCE-1127 – Wolfs default collar color had changed from orange to red.\nMCCE-1142 – Minecraft Capes using incorrect texture.\nMCCE-1192 – Texture under the bed is the texture of the top of the bed.\nMCCE-1202 – Map dark when facing north or south.\nMCCE-1214 – Texture of any potion turns black while holding it in the End or Nether.\nMCCE-1349 – Penned animals de-spawn when leaving the chunk.\nMCCE-1366 – When placing a torch under water to reset / refill the air meter will often cause a crash.\nMCCE-1367 – Melon farm with piston causes crash.\nMCCE-1403 – Hunger meter always regenerates when switching from peaceful to any other difficulty.\nMCCE-1415 – Hunger meter depletion glitch\nMCCE-1434 – Fishing rod bobber sticks to walls.\nMCCE-1455 – Piston/slime block duplication.\nMCCE-1457 – TNT can destroy blocks placed well beyond the world border.\nMCCE-1476 – Skin Pack 6: Faith Connors' Mirror's Edge Skin first person view bugged on Xbox 360.\nMCCE-1488 – 'Getting an Upgrade' trophy/achievement fails to unlock while crafting a stone pickaxe using classic crafting.", "bbox": [238.046875, 7929.515625, 690, 907]}, {"text": "Fix for crash when ender chest is mined for a few seconds.\nFix for an intermittent crash when placing beds on snow.\nFix for a crash when a Superflat world session with a combination of multiple planks or wood, lava and air layers is saved.\nFix for a crash after destroying blocks and exploring a Superflat world with multiple sand, air and TNT Layers.\nImproved random seed generator to select worlds with a better spread of biomes.\nFix for Villagers not harvesting crops from farmland created by the player.\nFix for glass not being able to be broken by hand in Adventure mode.\nFix for an issue where the user renames a 'Spawn Egg' and places it in water, causing debug text to be displayed.\nFix for an issue when the \"Body Guard\" trophy/achievement does not unlock as expected when the iron golem is built in a certain way.\nFix for an issue where a player cannot see other players after dying and respawning.\nFix for an issue where baby horses appear to be adults after feeding with one golden carrot.\nFix for issue where two primary powers can be applied to the player's character through the beacon UI.\nFix for an issue where a Torch and a Redstone Torch have two hitboxes.\nFix for de-spawn protections not being applied to baby animals created with Spawn Eggs.\nFix for issue where item quantity for bottle o' enchanting, nether star, enchanted golden apple and strength indicator for potions are not affected by Interface Opacity when in Quick Select.\nFix for death message with incorrect text is displayed when the player is killed with a named weapon.\nFix for worlds generating slightly differently every time even with the same seed.\nFix for issue where leather clothes, spawn eggs and potions are displayed improperly when the player is above 256 blocks or is in a place where there is no source of daylight.\nFix for Doors, Trapdoors and Fence Gates missing a sound effect when closing.\nFix for issue where opening certain menus does not cancel the eating, drinking or bow charging animations.\nFixed an issue where items that have no custom names were not showing up in edit text field in the Anvil.\nFix for ocelots not sprinting away from the player.\nFix for pistons and objects pushed by them having corrupted, black textures while animating.\nFix for falling gravel, Sand and Red Sand blocks displaying with very dark textures.\nFix for issue where texture pack changes to vanilla Minecraft textures if the player joins a friend's session.\nAdded first person rendering of additional skin parts for the left and right arms.\nFix for an issue when in a split-screen session where at least one player does not get critical hit particles.\nFix for seeing through the base of falling blocks.\nFix for missing mining animation for skulls, heads, signs, chests and beacons.\nFix for issue where changing the Interface Opacity to specific values causes visual issues with the item and button icons on the HUD.\nFix for issue when traveling directly north or south in a minecart where the player automatically turns to face eastwards.\nFix for missing tooltip for 'Exit' / 'Dismount' actions.\nFix for guardians not being spawned around ocean monuments on a Superflat world.\nFix for city Texture Pack missing textures for multiple kinds of doors while holding in the player's hand\nFix for sign text not displaying.\nFix for cows needing to take 11 hits with hand or 3 hits with any Sword to be killed.\nFix for clownfish description displaying incorrect information.\nFix to update the sponge texture.\nFix for the tutorial message about boats shows the wrong button prompt for exiting the boat.\nFix to allow saves that had been well explored to save player state again.\nFix for Golden Apple's regeneration animation not being smooth.\nFix for issues using certain symbols while renaming items on the Anvil.\nFixed an issue unlocking the 'Iron Belly' trophy.\nFix for 'Acquire Hardware' achievement not unlocking when an ingot is removed by the Quick Move button.\nFix for 'Delicious Fish' achievement being able to be be unlocked without cooking a Raw Fish.\nFix for a crash when adding a Split-screen Client on the host's console while the game player slots are full.", "bbox": [238.046875, 8854.015625, 690, 1298]}, {"text": "See also", "bbox": [202.046875, 10609.515625, 726, 43]}, {"text": "Xbox 360 Edition TU33\nXbox One Edition CU21\nPlayStation 3 Edition 1.24\nPlayStation 4 Edition 1.24\nPlayStation Vita Edition 1.24", "bbox": [238.046875, 10661.515625, 690, 123]}, {"text": "References", "bbox": [202.046875, 10802.015625, 726, 43]}, {"text": "\"Minecraft: Wii U Edition Patch change logs\" – Minecraft Forum, February 26, 2016.", "bbox": [248.046875, 10857.015625, 520, 17]}]}