{"metadata": {"url": "https://minecraft.fandom.com/wiki/Featured_servers/The_Hive", "title": "Featured_servers/The_Hive", "time": "16/04/2022 23:31:59"}, "tables": [{"bbox": [624.9375, 766.046875, 300, 290], "headers": {"text": ["Server type", "Address", "Language(s)", "App", "Links"], "bboxes": [[625.9375, 767.046875, 87, 30], [625.9375, 798.078125, 87, 31], [625.9375, 830.109375, 87, 74], [625.9375, 905.203125, 87, 30], [625.9375, 936.234375, 87, 118]]}, "cells": {"text": ["Minigames", "geo.hivebedrock.network", "English, French, German, Japanese, Portuguese (Brazil), Spanish, Mexican Spanish", "", "Discord: https://discord.gg/hive\nTwitter: @theHiveMC\nInstagram: @theHiveMC\nFacebook: Hive Games\nWebsite: https://playhive.com"], "bboxes": [[713.9375, 767.046875, 210, 30], [713.9375, 798.078125, 210, 31], [713.9375, 830.109375, 210, 74], [713.9375, 905.203125, 210, 30], [713.9375, 936.234375, 210, 118]]}}, {"bbox": [202.046875, 3783.59375, 725, 572], "headers": {"text": ["Bedrock Edition", "November 18, 2017", "October 16, 2018", "October 28, 2018", "November 4, 2018", "November 8, 2018", "March 17, 2019", "June 16, 2019", "June 22, 2019", "September 20, 2019", "October 6, 2019", "October 24, 2019", "December 7, 2019", "March 9, 2020", "April 10, 2020", "May 15, 2020"], "bboxes": [[202.546875, 3784.09375, 724, 31], [202.546875, 3815.1875, 145, 31], [202.546875, 3846.28125, 145, 55], [202.546875, 3901.875, 145, 31], [202.546875, 3932.96875, 145, 31], [202.546875, 3964.0625, 145, 31], [202.546875, 3995.15625, 145, 31], [202.546875, 4026.25, 145, 31], [202.546875, 4057.34375, 145, 31], [202.546875, 4088.4375, 145, 55], [202.546875, 4144.03125, 145, 31], [202.546875, 4175.125, 145, 31], [202.546875, 4206.21875, 145, 31], [202.546875, 4237.3125, 145, 31], [202.546875, 4268.40625, 145, 31], [202.546875, 4299.5, 145, 55]]}, "cells": {"text": ["The Hive is announced as a new server partner at MINECON Earth 2017.", "The Hive is released with Deathrun, Treasure Wars, and Hide & Seek and is available in the server list.", "Ghost Invasion is now available for a limited time Halloween game.", "Treasure Wars: Duos is now available.", "Asia region is released hosted in Japan.", "Murder Mystery is now available.", "Survival Games is now available.", "Treasure Wars: Mega is now available for a limited time.", "Quests are now available.", "Daily login rewards are now available.", "The Hive releases their first marketplace map, Pirate's Fortune.", "The Hive has their first live event for Christmas, where 14,000 players attended.", "Just Build is now available.", "A re-themed Snow Wars (Ground Wars) is released for a limited time Easter game.", "SkyWars is now available, achieving the highest concurrent player count on Bedrock (39,520)."], "bboxes": [[347.734375, 3815.1875, 579, 31], [347.734375, 3846.28125, 579, 55], [347.734375, 3901.875, 579, 31], [347.734375, 3932.96875, 579, 31], [347.734375, 3964.0625, 579, 31], [347.734375, 3995.15625, 579, 31], [347.734375, 4026.25, 579, 31], [347.734375, 4057.34375, 579, 31], [347.734375, 4088.4375, 579, 55], [347.734375, 4144.03125, 579, 31], [347.734375, 4175.125, 579, 31], [347.734375, 4206.21875, 579, 31], [347.734375, 4237.3125, 579, 31], [347.734375, 4268.40625, 579, 31], [347.734375, 4299.5, 579, 55]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/c/c5/Move_arrows.svg", "path": "images/Move arrows.png", "alt_text": "Move arrows", "caption": null, "bbox": [260.53125, 533.484375, 32, 32]}, {"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/9/92/The_Hive.png", "path": "images/The Hive.png", "alt_text": "The Hive", "caption": null, "bbox": [699.9375, 712.046875, 150, 50]}], "sprites": [], "texts": [{"text": "Featured servers/The Hive", "bbox": [202.046875, 353.890625, 593, 45]}, {"text": "The Hive is a Minecraft Featured Server on Bedrock Edition platform. It currently has the highest concurrent player count for Bedrock in history (54,663 as of 25/7/2021). There are currently 20 games, 2 seasonal games and 2 LTM (Limited Time Mode) games. The Hive also had a server on Java Edition until April 15, 2021.", "bbox": [202.046875, 666.578125, 726, 147]}, {"text": "Contents", "bbox": [215.046875, 853.328125, 81, 17]}, {"text": "1 Games\n1.1 Hide and Seek\n1.2 DeathRun\n1.3 Treasure Wars\n1.4 Murder Mystery\n1.5 Survival Games\n1.6 Just Build\n1.7 SkyWars\n1.8 Block Drop\n1.8.1 Ghost Invasion\n1.8.2 Snow Wars\n2 Regions and Servers\n3 History", "bbox": [203.046875, 886.59375, 191, 389]}, {"text": "Games", "bbox": [202.046875, 1300.09375, 726, 43]}, {"text": "Hide and Seek", "bbox": [202.046875, 1367.09375, 726, 22]}, {"text": "Hide and Seek is one of the three games originally launched on Hive's release. One player is randomly selected as a seeker and the rest are hiders. The hiders can use taunts, which give points and xp when used. These taunts can be seen and heard by both the hiders and the seekers. Hiders will also eventually get a wooden sword called the seeker smasher 1000. The hiders must hide as a block from the seekers.", "bbox": [202.046875, 1401.59375, 726, 98]}, {"text": "DeathRun", "bbox": [202.046875, 1523.59375, 726, 23]}, {"text": "DeathRun was originally made by The Hive on Java Edition but was ported over to Bedrock Edition for release. Two players are randomly chosen as a “death” and they must set off traps in order to kill players who are running through a course filled with parkour and traps.When a player reaches the goal the timer will shorten by a certain amount of time.Players would also have a leap ability with a 15 second cooldown. The ability makes launches you a couple of blocks from the original area.", "bbox": [202.046875, 1558.09375, 726, 122]}, {"text": "Treasure Wars", "bbox": [202.046875, 1704.59375, 726, 23]}, {"text": "Treasure Wars is the Hive's version of the popular minigame called BedWars. It has the highest play count in the hive currently. Players can either play solo (8 teams of 1), duos (8 teams of 2), trios (4 teams of 3), squads (4 teams of 4), or mega (2 teams of 6-12, depending on amount of players). Players must destroy other team's treasures by breaking it, to stop them from respawning and kill them to win the game. Players of all teams can buy items with the in-game currency of gold, diamonds, and emeralds. All special items (Ender Pearls, Snowballs, Boom Boxes, Tracking Compasses, and Golden Apples) can be bought with diamonds and emeralds only.", "bbox": [202.046875, 1739.09375, 726, 147]}, {"text": "Murder Mystery", "bbox": [202.046875, 1910.09375, 726, 22]}, {"text": "One player is chosen as the murderer (equipped with a throwable weapon and iron sword called sharpened sword) and must kill all the players in the game. One player is also chosen as the sheriff (equipped with a bow called a Zapper and a zapper charge) and must kill the murderer. If the murderer kills the sheriff it will drop a sheriff hat.If a innocent gets the sheriff hat they will become the sheriff. The remaining players are innocents and must collect 10 coins around the map in order to get a single-shot zapper to kill the murderer they can also get special effects including swiftness,invisibility,night vision,and jump boost.Some maps also contain teleporters which can bring you to another teleporter location.Players can’t teleport for 5 seconds after they teleported.", "bbox": [202.046875, 1944.59375, 726, 172]}, {"text": "Survival Games", "bbox": [202.046875, 2140.09375, 726, 22]}, {"text": "Survival Games is a modern take on the Hive's Java Edition Survival Games. 24 players enter the game and must loot chests around the map to get weapons and also find food because hunger does do damage here. There are two types of chest tier 1 and tier 2.A tier 2 chest uses the ender chest. When four players are left (or when the timer runs out), players are teleported to a deathmatch arena. Players can find cache cows (3 per game) and supply crates around the map in order to get better loot.", "bbox": [202.046875, 2174.59375, 726, 123]}, {"text": "Just Build", "bbox": [202.046875, 2321.09375, 726, 22]}, {"text": "Just Build is a fast-paced building game where players can either build solo or as a duo. They have five minutes (10 minutes in Extended mode) to construct a build related to a randomly chosen theme. Once the timer is up, everyone votes on the other teams builds with colored concrete. The team with the highest voting score wins, however they can't vote for themself. The 4 versions are Solo, Solo Extended, Duos and Duos Extended.", "bbox": [202.046875, 2355.59375, 726, 98]}, {"text": "SkyWars", "bbox": [202.046875, 2477.59375, 726, 23]}, {"text": "SkyWars: Lucky Ores is the Hive's newest game and offers a unique take on the popular SkyWars minigame. Players must mine ores around the map in order to get better loot. Those ores are not normal ores – they drop special items according to the ore type, for example, mining redstone ore gives you an extra heart ,player can only have 5 extra hearts.. There is a Mystery Chest on the middle island which once destroyed drops better loot. There are four types of boom boxes in the game (explosive boxes that take damage to players but do not break blocks) in the game: normal, knockback, poison, and frozen – which can be thrown (except knockback). Players can also get spells from breaking lapis ore. There are three types of spells: life spell (regenerates four hearts of player's health), swiftness (gives player 5 seconds of speed) and fire trail (next 10 blocks walked over will be set on fire). There are also chests at the starting island (3 in solo, 4 in duos, 6 in trios and squads). There are an additional 4 ender chests at the middle area with diamond items (6 in the squads map Castle). These chests have chain and iron armor, andesite, Crumbling Cobblestone, snowballs, iron swords, and ender peals. There is also a kit mode to SkyWars.", "bbox": [202.046875, 2512.09375, 726, 269]}, {"text": "Block Drop", "bbox": [202.046875, 2805.59375, 726, 23]}, {"text": "Block Drop was a mini game made public first In 2021. It wasn't meant to celebrate any holidays unlike the other seasonal games. The game concept is simple. As players walk around on the blocks the blocks will slowly disappear. Block drop also has power ups to help you win or boost your chances. Sometimes they will make one layer disappear from the game from time to time. One game breaking glitch is when you stand on a block and don't move the block won't disappear.", "bbox": [202.046875, 2840.09375, 726, 122]}, {"text": "Ghost Invasion", "bbox": [202.046875, 2986.59375, 726, 20]}, {"text": "Ghost Invasion is a game where players must avoid getting infected by ghosts and killing them with their zappers. As a ghost, your goal is to infect all humans by exploding near them. As a human, your goal is to either kill all ghosts until they are unable to respawn or stay alive until the match is over. The game concept is similar to the concept of murder mystery.", "bbox": [202.046875, 3015.59375, 726, 98]}, {"text": "Snow Wars", "bbox": [202.046875, 3137.59375, 726, 20]}, {"text": "Snow Wars is a game where 8-player teams must fill most of the arena's ground with their team's color by hitting opposing team players with snowballs (or eggs), or shooting other players with a bow. The game ends if the entire ground is painted with the team's color or if most of the ground is painted when the match ends. It is no longer here since it was a seasonal game only available during winter fest.", "bbox": [202.046875, 3166.59375, 726, 98]}, {"text": "Regions and Servers", "bbox": [202.046875, 3288.59375, 726, 43]}, {"text": "The Hive has servers in 3 regions.", "bbox": [202.046875, 3340.59375, 726, 25]}, {"text": "North America / Canada ca.hivebedrock.network\nEurope / France fr.hivebedrock.network\nAsia / Singapore sg.hivebedrock.network", "bbox": [238.046875, 3389.09375, 690, 73]}, {"text": "If you use geo.hivebedrock.network to access, the system will find that the has an optimal It finds the region and transfers you to it.", "bbox": [202.046875, 3480.59375, 726, 49]}, {"text": "Also, there was a major change regarding the server on March 31, 2019. The server host had been changed from Vultr to OVH and the Asia region had been moved from Japan to Singapore.", "bbox": [202.046875, 3553.59375, 726, 49]}, {"text": "History", "bbox": [202.046875, 3626.59375, 726, 43]}, {"text": "Trivia:", "bbox": [202.046875, 3678.59375, 726, 25]}, {"text": "Treasures wars mega use to be a Limited Time Mode before it was changed to be a permanent game mode.", "bbox": [238.046875, 3727.09375, 690, 24]}]}