{"metadata": {"url": "https://minecraft.fandom.com/wiki/Villager_(old)/ED", "title": "Villager_(old)/ED", "time": "16/04/2022 22:35:54"}, "tables": [], "images": [], "sprites": [{"text": null, "bbox": [202.046875, 502.390625, 16, 16]}, {"text": null, "bbox": [223.046875, 606.390625, 16, 16]}, {"text": null, "bbox": [223.046875, 630.890625, 16, 16]}, {"text": null, "bbox": [223.046875, 679.890625, 16, 16]}, {"text": null, "bbox": [223.046875, 753.390625, 16, 16]}, {"text": null, "bbox": [223.046875, 851.390625, 16, 16]}, {"text": null, "bbox": [223.046875, 900.390625, 16, 16]}, {"text": null, "bbox": [244.046875, 998.390625, 16, 16]}, {"text": null, "bbox": [223.046875, 1049.390625, 16, 16]}, {"text": null, "bbox": [244.046875, 1073.890625, 16, 16]}, {"text": null, "bbox": [265.046875, 1098.390625, 16, 16]}, {"text": null, "bbox": [286.046875, 1122.890625, 16, 16]}, {"text": null, "bbox": [286.046875, 1171.890625, 16, 16]}, {"text": null, "bbox": [286.046875, 1220.890625, 16, 16]}, {"text": null, "bbox": [286.046875, 1269.890625, 16, 16]}, {"text": null, "bbox": [286.046875, 1320.890625, 16, 16]}, {"text": null, "bbox": [286.046875, 1371.890625, 16, 16]}], "texts": [{"text": "Villager (old)/ED", "bbox": [202.046875, 353.890625, 593, 45]}, {"text": "This article is about the entity data of villager before Village & Pillage. For the current entity data, see Villager/ED.", "bbox": [216.046875, 443.390625, 712, 49]}, {"text": "Entity data\nTags common to all entities[show]\nTags common to all mobs[show]\nAdditional fields for mobs that can breed[show]\n Profession: The ID of the texture used for this villager. This also influences trading options.\n Riches: Currently unused. Increases by the number of emeralds traded to a villager any time they are traded.\n Career: The ID of this villager's career. This also influences trading options and the villager's name in the GUI (if it does not have a CustomName). If 0, the next time offers are refreshed, the game will assign a new Career and reset CareerLevel to 1.\n CareerLevel: The current level of this villager's trading options. Influences the trading options generated by the villager; if it is greater than their career's maximum level, no new offers are generated. Increments when a trade causes offers to be refreshed. If 0, the next trade to do this will assign a new Career and set CareerLevel to 1. Set to a high enough level and there will be no new trades to release (Career must be set to 1 or above).\n Willing: 1 or 0 (true/false) - true if the villager is willing to mate. Becomes true after certain trades (those which would cause offers to be refreshed), and false after mating.\n Inventory: Each compound tag in this list is an item in the villager's inventory, up to a maximum of 8 slots. Items in two or more slots that can be stacked together will automatically be condensed into one slot. If there are more than 8 slots, the last slot will be removed until the total is 8. If there are 9 slots but two previous slots can be condensed, the last slot will be present after the two other slots are combined.\nAn item in the inventory, excluding the Slot tag.\nTags common to all items[show]\n Offers: Is generated when the trading menu is opened for the first time.\n Recipes: List of trade options.\nA trade option.\n rewardExp: 1 or 0 (true/false) - true if this trade will provide XP orb drops. All trades from naturally-generated villagers in Java Edition reward XP orbs.\n maxUses: The maximum number of times this trade can be used before it is disabled. Increases by a random amount from 2 to 12 when offers are refreshed.\n uses: The number of times this trade has been used. The trade becomes disabled when this is greater or equal to maxUses.\n buy: The first 'cost' item, without the Slot tag.\nTags common to all items[show]\n buyB: May not exist. The second 'cost' item, without the Slot tag.\nTags common to all items[show]\n sell: The item being sold for each set of cost items, without the Slot tag.\nTags common to all items[show]", "bbox": [202.046875, 499.390625, 726, 921]}]}