{"metadata": {"url": "https://minecraft.fandom.com/wiki/Commands/stats", "title": "Commands/stats", "time": "17/04/2022 00:13:54"}, "tables": [{"bbox": [624.9375, 608.234375, 300, 86], "headers": {"text": ["Permission level\nrequired", "Restrictions"], "bboxes": [[625.9375, 609.234375, 222, 52], [625.9375, 662.296875, 222, 30]]}, "cells": {"text": ["2", "None"], "bboxes": [[849.203125, 609.234375, 75, 52], [849.203125, 662.296875, 75, 30]]}}, {"bbox": [202.046875, 2240.765625, 357, 125], "headers": {"text": ["Java Edition", "1.8", "14w28a", "14w29a", "1.13", "17w45a"], "bboxes": [[202.546875, 2241.265625, 356, 31], [202.546875, 2272.359375, 38, 62], [240.734375, 2272.359375, 68, 31], [240.734375, 2303.453125, 68, 31], [202.546875, 2334.546875, 38, 31], [240.734375, 2334.546875, 68, 31]]}, "cells": {"text": ["Added /stats.", "Added QueryResults to /stats.", "Removed /stats."], "bboxes": [[308.921875, 2272.359375, 250, 31], [308.921875, 2303.453125, 250, 31], [308.921875, 2334.546875, 250, 31]]}}], "images": [{"src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/3/35/Information_icon.svg", "path": "images/Information icon.png", "alt_text": "Information icon", "caption": null, "bbox": [260.53125, 514.171875, 32, 32]}], "sprites": [{"text": null, "bbox": [260.53125, 459.984375, 32, 32]}], "texts": [{"text": "Commands/stats", "bbox": [202.046875, 353.890625, 593, 45]}, {"text": "Manages the updating of scoreboard objectives with the results of other commands.", "bbox": [202.046875, 566.765625, 726, 49]}, {"text": "Commands can be executed by blocks (specifically, command blocks and signs) or by entities (players can execute commands directly, and other entities can be the origin of commands indirectly with the /execute command). When a command is executed, the command returns one or more \"command stats\": the success count, number of blocks affected, number of entities affected, number of items affected, and/or a query result (such as from /time query daytime).", "bbox": [202.046875, 639.765625, 726, 147]}, {"text": "The stats command allows \"selectors\" and \"objectives\" to be set (or cleared) for each of these command stats for specific blocks or entities. Selectors (for example, @e) are stored exactly as entered, and don't get evaluated immediately. When a command is later run by the block or entity, the stored selector is then used to target (other) entities and update their scoreboard objective with the value of the command stat. That value can then be displayed or operated on, just like any other scoreboard value.", "bbox": [202.046875, 810.765625, 726, 123]}, {"text": "The success count from a command block can also be acquired with a redstone comparator, but that is capped at a maximum value of 15, while scoreboard objectives can hold any value from -2,147,483,648 to 2,147,483,647. Success counts and query results are also usually displayed in the chat.", "bbox": [202.046875, 957.265625, 726, 73]}, {"text": "Syntax", "bbox": [202.046875, 1054.765625, 726, 25]}, {"text": "stats block <x> <y> <z> clear <stat>\nstats block <x> <y> <z> set <stat> <selector> <objective>\nstats entity <selector2> clear <stat>\nstats entity <selector2> set <stat> <selector> <objective>", "bbox": [202.046875, 1079.265625, 726, 98]}, {"text": "Arguments", "bbox": [202.046875, 1177.265625, 726, 24]}, {"text": "x y z (block mode only)\nSpecifies the position of the block to post command stats from. x and z must be between -30,000,000 and 30,000,000 (inclusive, without the commas) and y must be between 0 and 255 (inclusive). May use tilde notation to specify a position relative to the command's execution.", "bbox": [202.046875, 1201.765625, 726, 98]}, {"text": "selector2 (entity mode only)\nSpecifies the entity to post command stats from. Must be a player name or a target selector.", "bbox": [202.046875, 1299.765625, 726, 49]}, {"text": "stat\nSpecifies the command stat whose selector and objective are to be cleared or set. Must be one of:\nAffectedBlocks — returns the number of blocks affected by a command\nAffectedEntities — returns the number of entities affected by a command\nAffectedItems — returns the number of items affected by a command\nQueryResult — returns the result of a command query\nSuccessCount — returns a command's success count", "bbox": [202.046875, 1348.765625, 726, 178]}, {"text": "selector (set mode only)\nSpecifies the selector to be evaluated when a command is run by the specified block or entity to determine which entity(ies) scoreboard objective is to be updated with the result returned by stat. May be anything because it is not evaluated until a command is run by the specified block or entity, but only a player name or a target selector produces useful results (though player names can be fake, so even real players don't need to be online).", "bbox": [202.046875, 1544.265625, 726, 147]}, {"text": "objective (set mode only)\nSpecifies the name of the objective to be updated with the result returned by stat. May be anything because it is not evaluated until a command is run by the specified block or entity, but only the name of a defined objective produces useful results.", "bbox": [202.046875, 1691.265625, 726, 98]}, {"text": "Result", "bbox": [202.046875, 1789.265625, 726, 24]}, {"text": "Fails if the arguments are not specified correctly, if the specified block cannot track stats (in other words, it fails if the specified block is not a command block or sign), or if selector2 fails to evaluate to one or more valid entities (named players must be online).", "bbox": [202.046875, 1813.765625, 726, 74]}, {"text": "On success, clears or sets the selector and objective to be updated with the result returned by stat.", "bbox": [202.046875, 1887.265625, 726, 24]}, {"text": "Examples", "bbox": [202.046875, 1911.765625, 726, 25]}, {"text": "To set the block at (0,64,0) to update scoreboard objective MyObj of the nearest player with the value of any query result returned by the block:\nstats block 0 64 0 set QueryResult @p MyObj", "bbox": [202.046875, 1936.265625, 726, 73]}, {"text": "To stop the block at (0,64,0) from updating any scoreboard obectives with the success count of commands it executes:\nstats block 0 64 0 clear SuccessCount", "bbox": [202.046875, 2009.765625, 726, 74]}, {"text": "To have the nearest wither skull update the scoreboard objective NumBlocks of fake player #FakePlayer with the number of blocks affected by commands executed by the wither skull:\nstats entity @e[type=wither_skull,c=1] set AffectedBlocks #FakePlayer NumBlocks", "bbox": [202.046875, 2083.265625, 726, 73]}, {"text": "History", "bbox": [202.046875, 2174.765625, 726, 43]}, {"text": "See also", "bbox": [202.046875, 2404.140625, 726, 43]}, {"text": "Tutorials/Command stats\n/blockdata — can also change the selector and objectives of blocks by altering data tags directly\n/entitydata — can also change the selector and objectives of entities by altering data tags directly", "bbox": [202.046875, 2456.140625, 726, 73]}, {"text": "Commands[show] [edit]", "bbox": [205.046875, 2546.640625, 720, 25]}]}